FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 0 : Address not resolved */
#define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Pos             ( 0UL )                                                    /*!< Position of EVENTS_NOTRESOLVED field. */
#define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Msk             ( 0x1UL << AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Pos ) /*!< Bit mask of EVENTS_NOTRESOLVED field. */
#define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_NotGenerated    ( 0UL )                                                    /*!< Event not generated */
#define AAR_EVENTS_NOTRESOLVED_EVENTS_NOTRESOLVED_Generated       ( 1UL )                                                    /*!< Event generated */

/* Register: AAR_PUBLISH_END */
/* Description: Publish configuration for event END */

/* Bit 31 :   */
#define AAR_PUBLISH_END_EN_Pos         ( 31UL )                            /*!< Position of EN field. */
#define AAR_PUBLISH_END_EN_Msk         ( 0x1UL << AAR_PUBLISH_END_EN_Pos ) /*!< Bit mask of EN field. */
#define AAR_PUBLISH_END_EN_Disabled    ( 0UL )                             /*!< Disable publishing */
#define AAR_PUBLISH_END_EN_Enabled     ( 1UL )                             /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event END will publish to. */
#define AAR_PUBLISH_END_CHIDX_Pos      ( 0UL )                                 /*!< Position of CHIDX field. */
#define AAR_PUBLISH_END_CHIDX_Msk      ( 0xFFUL << AAR_PUBLISH_END_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: AAR_PUBLISH_RESOLVED */
/* Description: Publish configuration for event RESOLVED */

/* Bit 31 :   */
#define AAR_PUBLISH_RESOLVED_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define AAR_PUBLISH_RESOLVED_EN_Msk         ( 0x1UL << AAR_PUBLISH_RESOLVED_EN_Pos ) /*!< Bit mask of EN field. */
#define AAR_PUBLISH_RESOLVED_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define AAR_PUBLISH_RESOLVED_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RESOLVED will publish to. */
#define AAR_PUBLISH_RESOLVED_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define AAR_PUBLISH_RESOLVED_CHIDX_Msk      ( 0xFFUL << AAR_PUBLISH_RESOLVED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: AAR_PUBLISH_NOTRESOLVED */
/* Description: Publish configuration for event NOTRESOLVED */

/* Bit 31 :   */
#define AAR_PUBLISH_NOTRESOLVED_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define AAR_PUBLISH_NOTRESOLVED_EN_Msk         ( 0x1UL << AAR_PUBLISH_NOTRESOLVED_EN_Pos ) /*!< Bit mask of EN field. */
#define AAR_PUBLISH_NOTRESOLVED_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define AAR_PUBLISH_NOTRESOLVED_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event NOTRESOLVED will publish to. */
#define AAR_PUBLISH_NOTRESOLVED_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define AAR_PUBLISH_NOTRESOLVED_CHIDX_Msk      ( 0xFFUL << AAR_PUBLISH_NOTRESOLVED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: AAR_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Write '1' to enable interrupt for event NOTRESOLVED */
#define AAR_INTENSET_NOTRESOLVED_Pos         ( 2UL )                                   /*!< Position of NOTRESOLVED field. */
#define AAR_INTENSET_NOTRESOLVED_Msk         ( 0x1UL << AAR_INTENSET_NOTRESOLVED_Pos ) /*!< Bit mask of NOTRESOLVED field. */
#define AAR_INTENSET_NOTRESOLVED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define AAR_INTENSET_NOTRESOLVED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define AAR_INTENSET_NOTRESOLVED_Set         ( 1UL )                                   /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event RESOLVED */
#define AAR_INTENSET_RESOLVED_Pos            ( 1UL )                                /*!< Position of RESOLVED field. */
#define AAR_INTENSET_RESOLVED_Msk            ( 0x1UL << AAR_INTENSET_RESOLVED_Pos ) /*!< Bit mask of RESOLVED field. */
#define AAR_INTENSET_RESOLVED_Disabled       ( 0UL )                                /*!< Read: Disabled */
#define AAR_INTENSET_RESOLVED_Enabled        ( 1UL )                                /*!< Read: Enabled */
#define AAR_INTENSET_RESOLVED_Set            ( 1UL )                                /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event END */
#define AAR_INTENSET_END_Pos                 ( 0UL )                           /*!< Position of END field. */
#define AAR_INTENSET_END_Msk                 ( 0x1UL << AAR_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define AAR_INTENSET_END_Disabled            ( 0UL )                           /*!< Read: Disabled */
#define AAR_INTENSET_END_Enabled             ( 1UL )                           /*!< Read: Enabled */
#define AAR_INTENSET_END_Set                 ( 1UL )                           /*!< Enable */

/* Register: AAR_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Write '1' to disable interrupt for event NOTRESOLVED */
#define AAR_INTENCLR_NOTRESOLVED_Pos         ( 2UL )                                   /*!< Position of NOTRESOLVED field. */
#define AAR_INTENCLR_NOTRESOLVED_Msk         ( 0x1UL << AAR_INTENCLR_NOTRESOLVED_Pos ) /*!< Bit mask of NOTRESOLVED field. */
#define AAR_INTENCLR_NOTRESOLVED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define AAR_INTENCLR_NOTRESOLVED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define AAR_INTENCLR_NOTRESOLVED_Clear       ( 1UL )                                   /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event RESOLVED */
#define AAR_INTENCLR_RESOLVED_Pos            ( 1UL )                                /*!< Position of RESOLVED field. */
#define AAR_INTENCLR_RESOLVED_Msk            ( 0x1UL << AAR_INTENCLR_RESOLVED_Pos ) /*!< Bit mask of RESOLVED field. */
#define AAR_INTENCLR_RESOLVED_Disabled       ( 0UL )                                /*!< Read: Disabled */
#define AAR_INTENCLR_RESOLVED_Enabled        ( 1UL )                                /*!< Read: Enabled */
#define AAR_INTENCLR_RESOLVED_Clear          ( 1UL )                                /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event END */
#define AAR_INTENCLR_END_Pos                 ( 0UL )                           /*!< Position of END field. */
#define AAR_INTENCLR_END_Msk                 ( 0x1UL << AAR_INTENCLR_END_Pos ) /*!< Bit mask of END field. */
#define AAR_INTENCLR_END_Disabled            ( 0UL )                           /*!< Read: Disabled */
#define AAR_INTENCLR_END_Enabled             ( 1UL )                           /*!< Read: Enabled */
#define AAR_INTENCLR_END_Clear               ( 1UL )                           /*!< Disable */

/* Register: AAR_STATUS */
/* Description: Resolution status */

/* Bits 3..0 : The IRK that was used last time an address was resolved */
#define AAR_STATUS_STATUS_Pos    ( 0UL )                            /*!< Position of STATUS field. */
#define AAR_STATUS_STATUS_Msk    ( 0xFUL << AAR_STATUS_STATUS_Pos ) /*!< Bit mask of STATUS field. */

