FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: AAR_ENABLE */
/* Description: Enable AAR */

/* Bits 1..0 : Enable or disable AAR */
#define AAR_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define AAR_ENABLE_ENABLE_Msk         ( 0x3UL << AAR_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define AAR_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disable */
#define AAR_ENABLE_ENABLE_Enabled     ( 3UL )                            /*!< Enable */

/* Register: AAR_NIRK */
/* Description: Number of IRKs */

/* Bits 4..0 : Number of Identity Root Keys available in the IRK data structure */
#define AAR_NIRK_NIRK_Pos    ( 0UL )                         /*!< Position of NIRK field. */
#define AAR_NIRK_NIRK_Msk    ( 0x1FUL << AAR_NIRK_NIRK_Pos ) /*!< Bit mask of NIRK field. */

/* Register: AAR_IRKPTR */
/* Description: Pointer to IRK data structure */

/* Bits 31..0 : Pointer to the IRK data structure */
#define AAR_IRKPTR_IRKPTR_Pos    ( 0UL )                                   /*!< Position of IRKPTR field. */
#define AAR_IRKPTR_IRKPTR_Msk    ( 0xFFFFFFFFUL << AAR_IRKPTR_IRKPTR_Pos ) /*!< Bit mask of IRKPTR field. */

/* Register: AAR_ADDRPTR */
/* Description: Pointer to the resolvable address */

/* Bits 31..0 : Pointer to the resolvable address (6-bytes) */
#define AAR_ADDRPTR_ADDRPTR_Pos    ( 0UL )                                     /*!< Position of ADDRPTR field. */
#define AAR_ADDRPTR_ADDRPTR_Msk    ( 0xFFFFFFFFUL << AAR_ADDRPTR_ADDRPTR_Pos ) /*!< Bit mask of ADDRPTR field. */

/* Register: AAR_SCRATCHPTR */
/* Description: Pointer to data area used for temporary storage */

/* Bits 31..0 : Pointer to a scratch data area used for temporary storage during resolution. A space of minimum 3 bytes must be reserved. */
#define AAR_SCRATCHPTR_SCRATCHPTR_Pos    ( 0UL )                                           /*!< Position of SCRATCHPTR field. */
#define AAR_SCRATCHPTR_SCRATCHPTR_Msk    ( 0xFFFFFFFFUL << AAR_SCRATCHPTR_SCRATCHPTR_Pos ) /*!< Bit mask of SCRATCHPTR field. */


/* Peripheral: ACL */
/* Description: Access control lists */

/* Register: ACL_ACL_ADDR */
/* Description: Description cluster: Start address of region to protect. The start address must be word-aligned. */

/* Bits 31..0 : Start address of flash region n. The start address must point to a flash page boundary. */
#define ACL_ACL_ADDR_ADDR_Pos    ( 0UL )                                   /*!< Position of ADDR field. */
#define ACL_ACL_ADDR_ADDR_Msk    ( 0xFFFFFFFFUL << ACL_ACL_ADDR_ADDR_Pos ) /*!< Bit mask of ADDR field. */

/* Register: ACL_ACL_SIZE */
/* Description: Description cluster: Size of region to protect counting from address ACL[n].ADDR. Writing a '0' has no effect. */

/* Bits 31..0 : Size of flash region n in bytes. Must be a multiple of the flash page size. */
#define ACL_ACL_SIZE_SIZE_Pos    ( 0UL )                                   /*!< Position of SIZE field. */
#define ACL_ACL_SIZE_SIZE_Msk    ( 0xFFFFFFFFUL << ACL_ACL_SIZE_SIZE_Pos ) /*!< Bit mask of SIZE field. */

/* Register: ACL_ACL_PERM */
/* Description: Description cluster: Access permissions for region n as defined by start address ACL[n].ADDR and size ACL[n].SIZE */

/* Bit 2 : Configure read permissions for region n. Writing a '0' has no effect. */
#define ACL_ACL_PERM_READ_Pos         ( 2UL )                            /*!< Position of READ field. */
#define ACL_ACL_PERM_READ_Msk         ( 0x1UL << ACL_ACL_PERM_READ_Pos ) /*!< Bit mask of READ field. */
#define ACL_ACL_PERM_READ_Enable      ( 0UL )                            /*!< Allow read instructions to region n. */
#define ACL_ACL_PERM_READ_Disable     ( 1UL )                            /*!< Block read instructions to region n. */

/* Bit 1 : Configure write and erase permissions for region n. Writing a '0' has no effect. */
#define ACL_ACL_PERM_WRITE_Pos        ( 1UL )                             /*!< Position of WRITE field. */
#define ACL_ACL_PERM_WRITE_Msk        ( 0x1UL << ACL_ACL_PERM_WRITE_Pos ) /*!< Bit mask of WRITE field. */
#define ACL_ACL_PERM_WRITE_Enable     ( 0UL )                             /*!< Allow write and erase instructions to region n. */
#define ACL_ACL_PERM_WRITE_Disable    ( 1UL )                             /*!< Block write and erase instructions to region n. */


/* Peripheral: MUTEX */
/* Description: MUTEX 0 */

/* Register: MUTEX_MUTEX */
/* Description: Description collection: Mutex register */

/* Bit 0 : Mutex register n */
#define MUTEX_MUTEX_MUTEX_Pos         ( 0UL )                            /*!< Position of MUTEX field. */
#define MUTEX_MUTEX_MUTEX_Msk         ( 0x1UL << MUTEX_MUTEX_MUTEX_Pos ) /*!< Bit mask of MUTEX field. */
#define MUTEX_MUTEX_MUTEX_Unlocked    ( 0UL )                            /*!< Mutex n is in unlocked state */
#define MUTEX_MUTEX_MUTEX_Locked      ( 1UL )                            /*!< Mutex n is in locked state */


/* Peripheral: CCM */
/* Description: AES CCM mode encryption */

/* Register: CCM_TASKS_KSGEN */
/* Description: Start generation of keystream. This operation will stop by itself when completed. */

/* Bit 0 : Start generation of keystream. This operation will stop by itself when completed. */
#define CCM_TASKS_KSGEN_TASKS_KSGEN_Pos        ( 0UL )                                      /*!< Position of TASKS_KSGEN field. */
#define CCM_TASKS_KSGEN_TASKS_KSGEN_Msk        ( 0x1UL << CCM_TASKS_KSGEN_TASKS_KSGEN_Pos ) /*!< Bit mask of TASKS_KSGEN field. */
#define CCM_TASKS_KSGEN_TASKS_KSGEN_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: CCM_TASKS_CRYPT */
/* Description: Start encryption/decryption. This operation will stop by itself when completed. */

/* Bit 0 : Start encryption/decryption. This operation will stop by itself when completed. */
#define CCM_TASKS_CRYPT_TASKS_CRYPT_Pos        ( 0UL )                                      /*!< Position of TASKS_CRYPT field. */
#define CCM_TASKS_CRYPT_TASKS_CRYPT_Msk        ( 0x1UL << CCM_TASKS_CRYPT_TASKS_CRYPT_Pos ) /*!< Bit mask of TASKS_CRYPT field. */
#define CCM_TASKS_CRYPT_TASKS_CRYPT_Trigger    ( 1UL )                                      /*!< Trigger task */

