FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: CCM_EVENTS_ERROR */
/* Description: Deprecated register - CCM error event */

/* Bit 0 : Deprecated field -  CCM error event */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_Pos             ( 0UL )                                        /*!< Position of EVENTS_ERROR field. */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_Msk             ( 0x1UL << CCM_EVENTS_ERROR_EVENTS_ERROR_Pos ) /*!< Bit mask of EVENTS_ERROR field. */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define CCM_EVENTS_ERROR_EVENTS_ERROR_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: CCM_PUBLISH_ENDKSGEN */
/* Description: Publish configuration for event ENDKSGEN */

/* Bit 31 :   */
#define CCM_PUBLISH_ENDKSGEN_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define CCM_PUBLISH_ENDKSGEN_EN_Msk         ( 0x1UL << CCM_PUBLISH_ENDKSGEN_EN_Pos ) /*!< Bit mask of EN field. */
#define CCM_PUBLISH_ENDKSGEN_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define CCM_PUBLISH_ENDKSGEN_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDKSGEN will publish to. */
#define CCM_PUBLISH_ENDKSGEN_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define CCM_PUBLISH_ENDKSGEN_CHIDX_Msk      ( 0xFFUL << CCM_PUBLISH_ENDKSGEN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: CCM_PUBLISH_ENDCRYPT */
/* Description: Publish configuration for event ENDCRYPT */

/* Bit 31 :   */
#define CCM_PUBLISH_ENDCRYPT_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define CCM_PUBLISH_ENDCRYPT_EN_Msk         ( 0x1UL << CCM_PUBLISH_ENDCRYPT_EN_Pos ) /*!< Bit mask of EN field. */
#define CCM_PUBLISH_ENDCRYPT_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define CCM_PUBLISH_ENDCRYPT_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDCRYPT will publish to. */
#define CCM_PUBLISH_ENDCRYPT_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define CCM_PUBLISH_ENDCRYPT_CHIDX_Msk      ( 0xFFUL << CCM_PUBLISH_ENDCRYPT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: CCM_PUBLISH_ERROR */
/* Description: Deprecated register - Publish configuration for event ERROR */

/* Bit 31 :   */
#define CCM_PUBLISH_ERROR_EN_Pos         ( 31UL )                              /*!< Position of EN field. */
#define CCM_PUBLISH_ERROR_EN_Msk         ( 0x1UL << CCM_PUBLISH_ERROR_EN_Pos ) /*!< Bit mask of EN field. */
#define CCM_PUBLISH_ERROR_EN_Disabled    ( 0UL )                               /*!< Disable publishing */
#define CCM_PUBLISH_ERROR_EN_Enabled     ( 1UL )                               /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ERROR will publish to. */
#define CCM_PUBLISH_ERROR_CHIDX_Pos      ( 0UL )                                   /*!< Position of CHIDX field. */
#define CCM_PUBLISH_ERROR_CHIDX_Msk      ( 0xFFUL << CCM_PUBLISH_ERROR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: CCM_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 0 : Shortcut between event ENDKSGEN and task CRYPT */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Pos         ( 0UL )                                    /*!< Position of ENDKSGEN_CRYPT field. */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Msk         ( 0x1UL << CCM_SHORTS_ENDKSGEN_CRYPT_Pos ) /*!< Bit mask of ENDKSGEN_CRYPT field. */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Disabled    ( 0UL )                                    /*!< Disable shortcut */
#define CCM_SHORTS_ENDKSGEN_CRYPT_Enabled     ( 1UL )                                    /*!< Enable shortcut */

/* Register: CCM_INTENSET */
/* Description: Enable interrupt */

/* Bit 2 : Deprecated intsetfield -  Write '1' to enable interrupt for event ERROR */
#define CCM_INTENSET_ERROR_Pos            ( 2UL )                             /*!< Position of ERROR field. */
#define CCM_INTENSET_ERROR_Msk            ( 0x1UL << CCM_INTENSET_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define CCM_INTENSET_ERROR_Disabled       ( 0UL )                             /*!< Read: Disabled */
#define CCM_INTENSET_ERROR_Enabled        ( 1UL )                             /*!< Read: Enabled */
#define CCM_INTENSET_ERROR_Set            ( 1UL )                             /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event ENDCRYPT */
#define CCM_INTENSET_ENDCRYPT_Pos         ( 1UL )                                /*!< Position of ENDCRYPT field. */
#define CCM_INTENSET_ENDCRYPT_Msk         ( 0x1UL << CCM_INTENSET_ENDCRYPT_Pos ) /*!< Bit mask of ENDCRYPT field. */
#define CCM_INTENSET_ENDCRYPT_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENSET_ENDCRYPT_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENSET_ENDCRYPT_Set         ( 1UL )                                /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event ENDKSGEN */
#define CCM_INTENSET_ENDKSGEN_Pos         ( 0UL )                                /*!< Position of ENDKSGEN field. */
#define CCM_INTENSET_ENDKSGEN_Msk         ( 0x1UL << CCM_INTENSET_ENDKSGEN_Pos ) /*!< Bit mask of ENDKSGEN field. */
#define CCM_INTENSET_ENDKSGEN_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENSET_ENDKSGEN_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENSET_ENDKSGEN_Set         ( 1UL )                                /*!< Enable */

/* Register: CCM_INTENCLR */
/* Description: Disable interrupt */

/* Bit 2 : Deprecated intclrfield -  Write '1' to disable interrupt for event ERROR */
#define CCM_INTENCLR_ERROR_Pos            ( 2UL )                             /*!< Position of ERROR field. */
#define CCM_INTENCLR_ERROR_Msk            ( 0x1UL << CCM_INTENCLR_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define CCM_INTENCLR_ERROR_Disabled       ( 0UL )                             /*!< Read: Disabled */
#define CCM_INTENCLR_ERROR_Enabled        ( 1UL )                             /*!< Read: Enabled */
#define CCM_INTENCLR_ERROR_Clear          ( 1UL )                             /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event ENDCRYPT */
#define CCM_INTENCLR_ENDCRYPT_Pos         ( 1UL )                                /*!< Position of ENDCRYPT field. */
#define CCM_INTENCLR_ENDCRYPT_Msk         ( 0x1UL << CCM_INTENCLR_ENDCRYPT_Pos ) /*!< Bit mask of ENDCRYPT field. */
#define CCM_INTENCLR_ENDCRYPT_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENCLR_ENDCRYPT_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENCLR_ENDCRYPT_Clear       ( 1UL )                                /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event ENDKSGEN */
#define CCM_INTENCLR_ENDKSGEN_Pos         ( 0UL )                                /*!< Position of ENDKSGEN field. */
#define CCM_INTENCLR_ENDKSGEN_Msk         ( 0x1UL << CCM_INTENCLR_ENDKSGEN_Pos ) /*!< Bit mask of ENDKSGEN field. */
#define CCM_INTENCLR_ENDKSGEN_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define CCM_INTENCLR_ENDKSGEN_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define CCM_INTENCLR_ENDKSGEN_Clear       ( 1UL )                                /*!< Disable */

/* Register: CCM_MICSTATUS */
/* Description: MIC check result */

