FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 0 : The result of the MIC check performed during the previous decryption operation */
#define CCM_MICSTATUS_MICSTATUS_Pos            ( 0UL )                                  /*!< Position of MICSTATUS field. */
#define CCM_MICSTATUS_MICSTATUS_Msk            ( 0x1UL << CCM_MICSTATUS_MICSTATUS_Pos ) /*!< Bit mask of MICSTATUS field. */
#define CCM_MICSTATUS_MICSTATUS_CheckFailed    ( 0UL )                                  /*!< MIC check failed */
#define CCM_MICSTATUS_MICSTATUS_CheckPassed    ( 1UL )                                  /*!< MIC check passed */

/* Register: CCM_ENABLE */
/* Description: Enable */

/* Bits 1..0 : Enable or disable CCM */
#define CCM_ENABLE_ENABLE_Pos         ( 0UL )                            /*!< Position of ENABLE field. */
#define CCM_ENABLE_ENABLE_Msk         ( 0x3UL << CCM_ENABLE_ENABLE_Pos ) /*!< Bit mask of ENABLE field. */
#define CCM_ENABLE_ENABLE_Disabled    ( 0UL )                            /*!< Disable */
#define CCM_ENABLE_ENABLE_Enabled     ( 2UL )                            /*!< Enable */

/* Register: CCM_MODE */
/* Description: Operation mode */

/* Bit 24 : Packet length configuration */
#define CCM_MODE_LENGTH_Pos          ( 24UL )                         /*!< Position of LENGTH field. */
#define CCM_MODE_LENGTH_Msk          ( 0x1UL << CCM_MODE_LENGTH_Pos ) /*!< Bit mask of LENGTH field. */
#define CCM_MODE_LENGTH_Default      ( 0UL )                          /*!< Default length. Effective length of LENGTH field in encrypted/decrypted packet is 5 bits. A keystream for packet payloads up to 27 bytes will be generated. */
#define CCM_MODE_LENGTH_Extended     ( 1UL )                          /*!< Extended length. Effective length of LENGTH field in encrypted/decrypted packet is 8 bits. A keystream for packet payloads up to MAXPACKETSIZE bytes will be generated. */

/* Bits 17..16 : Radio data rate that the CCM shall run synchronous with */
#define CCM_MODE_DATARATE_Pos        ( 16UL )                           /*!< Position of DATARATE field. */
#define CCM_MODE_DATARATE_Msk        ( 0x3UL << CCM_MODE_DATARATE_Pos ) /*!< Bit mask of DATARATE field. */
#define CCM_MODE_DATARATE_1Mbit      ( 0UL )                            /*!< 1 Mbps */
#define CCM_MODE_DATARATE_2Mbit      ( 1UL )                            /*!< 2 Mbps */
#define CCM_MODE_DATARATE_125Kbps    ( 2UL )                            /*!< 125 kbps */
#define CCM_MODE_DATARATE_500Kbps    ( 3UL )                            /*!< 500 kbps */

/* Bit 0 : The mode of operation to be used. Settings in this register apply whenever either the KSGEN task or the CRYPT task is triggered. */
#define CCM_MODE_MODE_Pos            ( 0UL )                        /*!< Position of MODE field. */
#define CCM_MODE_MODE_Msk            ( 0x1UL << CCM_MODE_MODE_Pos ) /*!< Bit mask of MODE field. */
#define CCM_MODE_MODE_Encryption     ( 0UL )                        /*!< AES CCM packet encryption mode */
#define CCM_MODE_MODE_Decryption     ( 1UL )                        /*!< AES CCM packet decryption mode */

/* Register: CCM_CNFPTR */
/* Description: Pointer to data structure holding the AES key and the NONCE vector */

/* Bits 31..0 : Pointer to the data structure holding the AES key and the CCM NONCE vector (see table CCM data structure overview) */
#define CCM_CNFPTR_CNFPTR_Pos    ( 0UL )                                   /*!< Position of CNFPTR field. */
#define CCM_CNFPTR_CNFPTR_Msk    ( 0xFFFFFFFFUL << CCM_CNFPTR_CNFPTR_Pos ) /*!< Bit mask of CNFPTR field. */

/* Register: CCM_INPTR */
/* Description: Input pointer */

/* Bits 31..0 : Input pointer */
#define CCM_INPTR_INPTR_Pos    ( 0UL )                                 /*!< Position of INPTR field. */
#define CCM_INPTR_INPTR_Msk    ( 0xFFFFFFFFUL << CCM_INPTR_INPTR_Pos ) /*!< Bit mask of INPTR field. */

/* Register: CCM_OUTPTR */
/* Description: Output pointer */

/* Bits 31..0 : Output pointer */
#define CCM_OUTPTR_OUTPTR_Pos    ( 0UL )                                   /*!< Position of OUTPTR field. */
#define CCM_OUTPTR_OUTPTR_Msk    ( 0xFFFFFFFFUL << CCM_OUTPTR_OUTPTR_Pos ) /*!< Bit mask of OUTPTR field. */

/* Register: CCM_SCRATCHPTR */
/* Description: Pointer to data area used for temporary storage */

/* Bits 31..0 : Pointer to a scratch data area used for temporary storage during keystream generation,
 *      MIC generation and encryption/decryption. */
#define CCM_SCRATCHPTR_SCRATCHPTR_Pos    ( 0UL )                                           /*!< Position of SCRATCHPTR field. */
#define CCM_SCRATCHPTR_SCRATCHPTR_Msk    ( 0xFFFFFFFFUL << CCM_SCRATCHPTR_SCRATCHPTR_Pos ) /*!< Bit mask of SCRATCHPTR field. */

/* Register: CCM_MAXPACKETSIZE */
/* Description: Length of keystream generated when MODE.LENGTH = Extended */

/* Bits 7..0 : Length of keystream generated when MODE.LENGTH = Extended. This value must be greater than or equal to the subsequent packet payload to be encrypted/decrypted. */
#define CCM_MAXPACKETSIZE_MAXPACKETSIZE_Pos    ( 0UL )                                           /*!< Position of MAXPACKETSIZE field. */
#define CCM_MAXPACKETSIZE_MAXPACKETSIZE_Msk    ( 0xFFUL << CCM_MAXPACKETSIZE_MAXPACKETSIZE_Pos ) /*!< Bit mask of MAXPACKETSIZE field. */

/* Register: CCM_RATEOVERRIDE */
/* Description: Data rate override setting. */

/* Bits 1..0 : Data rate override setting */
#define CCM_RATEOVERRIDE_RATEOVERRIDE_Pos        ( 0UL )                                        /*!< Position of RATEOVERRIDE field. */
#define CCM_RATEOVERRIDE_RATEOVERRIDE_Msk        ( 0x3UL << CCM_RATEOVERRIDE_RATEOVERRIDE_Pos ) /*!< Bit mask of RATEOVERRIDE field. */
#define CCM_RATEOVERRIDE_RATEOVERRIDE_1Mbit      ( 0UL )                                        /*!< 1 Mbps */
#define CCM_RATEOVERRIDE_RATEOVERRIDE_2Mbit      ( 1UL )                                        /*!< 2 Mbps */
#define CCM_RATEOVERRIDE_RATEOVERRIDE_125Kbps    ( 2UL )                                        /*!< 125 kbps */
#define CCM_RATEOVERRIDE_RATEOVERRIDE_500Kbps    ( 3UL )                                        /*!< 500 kbps */

/* Register: CCM_HEADERMASK */
/* Description: Header (S0) mask. */

/* Bits 7..0 : Header (S0) mask */
#define CCM_HEADERMASK_HEADERMASK_Pos    ( 0UL )                                     /*!< Position of HEADERMASK field. */
#define CCM_HEADERMASK_HEADERMASK_Msk    ( 0xFFUL << CCM_HEADERMASK_HEADERMASK_Pos ) /*!< Bit mask of HEADERMASK field. */


