FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: CLOCK_EVENTS_HFCLKSTARTED */
/* Description: HFCLK128M/HFCLK64M source started */

/* Bit 0 : HFCLK128M/HFCLK64M source started */
#define CLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_Pos             ( 0UL )                                                        /*!< Position of EVENTS_HFCLKSTARTED field. */
#define CLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_Msk             ( 0x1UL << CLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_Pos ) /*!< Bit mask of EVENTS_HFCLKSTARTED field. */
#define CLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_NotGenerated    ( 0UL )                                                        /*!< Event not generated */
#define CLOCK_EVENTS_HFCLKSTARTED_EVENTS_HFCLKSTARTED_Generated       ( 1UL )                                                        /*!< Event generated */

/* Register: CLOCK_EVENTS_LFCLKSTARTED */
/* Description: LFCLK source started */

/* Bit 0 : LFCLK source started */
#define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos             ( 0UL )                                                        /*!< Position of EVENTS_LFCLKSTARTED field. */
#define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Msk             ( 0x1UL << CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Pos ) /*!< Bit mask of EVENTS_LFCLKSTARTED field. */
#define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_NotGenerated    ( 0UL )                                                        /*!< Event not generated */
#define CLOCK_EVENTS_LFCLKSTARTED_EVENTS_LFCLKSTARTED_Generated       ( 1UL )                                                        /*!< Event generated */

/* Register: CLOCK_EVENTS_DONE */
/* Description: Calibration of LFRC oscillator complete event */

/* Bit 0 : Calibration of LFRC oscillator complete event */
#define CLOCK_EVENTS_DONE_EVENTS_DONE_Pos             ( 0UL )                                        /*!< Position of EVENTS_DONE field. */
#define CLOCK_EVENTS_DONE_EVENTS_DONE_Msk             ( 0x1UL << CLOCK_EVENTS_DONE_EVENTS_DONE_Pos ) /*!< Bit mask of EVENTS_DONE field. */
#define CLOCK_EVENTS_DONE_EVENTS_DONE_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define CLOCK_EVENTS_DONE_EVENTS_DONE_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: CLOCK_PUBLISH_HFCLKSTARTED */
/* Description: Publish configuration for event HFCLKSTARTED */

/* Bit 31 :   */
#define CLOCK_PUBLISH_HFCLKSTARTED_EN_Pos         ( 31UL )                                       /*!< Position of EN field. */
#define CLOCK_PUBLISH_HFCLKSTARTED_EN_Msk         ( 0x1UL << CLOCK_PUBLISH_HFCLKSTARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define CLOCK_PUBLISH_HFCLKSTARTED_EN_Disabled    ( 0UL )                                        /*!< Disable publishing */
#define CLOCK_PUBLISH_HFCLKSTARTED_EN_Enabled     ( 1UL )                                        /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event HFCLKSTARTED will publish to. */
#define CLOCK_PUBLISH_HFCLKSTARTED_CHIDX_Pos      ( 0UL )                                            /*!< Position of CHIDX field. */
#define CLOCK_PUBLISH_HFCLKSTARTED_CHIDX_Msk      ( 0xFFUL << CLOCK_PUBLISH_HFCLKSTARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: CLOCK_PUBLISH_LFCLKSTARTED */
/* Description: Publish configuration for event LFCLKSTARTED */

/* Bit 31 :   */
#define CLOCK_PUBLISH_LFCLKSTARTED_EN_Pos         ( 31UL )                                       /*!< Position of EN field. */
#define CLOCK_PUBLISH_LFCLKSTARTED_EN_Msk         ( 0x1UL << CLOCK_PUBLISH_LFCLKSTARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define CLOCK_PUBLISH_LFCLKSTARTED_EN_Disabled    ( 0UL )                                        /*!< Disable publishing */
#define CLOCK_PUBLISH_LFCLKSTARTED_EN_Enabled     ( 1UL )                                        /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event LFCLKSTARTED will publish to. */
#define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Pos      ( 0UL )                                            /*!< Position of CHIDX field. */
#define CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Msk      ( 0xFFUL << CLOCK_PUBLISH_LFCLKSTARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: CLOCK_PUBLISH_DONE */
/* Description: Publish configuration for event DONE */

/* Bit 31 :   */
#define CLOCK_PUBLISH_DONE_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define CLOCK_PUBLISH_DONE_EN_Msk         ( 0x1UL << CLOCK_PUBLISH_DONE_EN_Pos ) /*!< Bit mask of EN field. */
#define CLOCK_PUBLISH_DONE_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define CLOCK_PUBLISH_DONE_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event DONE will publish to. */
#define CLOCK_PUBLISH_DONE_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define CLOCK_PUBLISH_DONE_CHIDX_Msk      ( 0xFFUL << CLOCK_PUBLISH_DONE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: CLOCK_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 7 : Enable or disable interrupt for event DONE */
#define CLOCK_INTEN_DONE_Pos                 ( 7UL )                           /*!< Position of DONE field. */
#define CLOCK_INTEN_DONE_Msk                 ( 0x1UL << CLOCK_INTEN_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTEN_DONE_Disabled            ( 0UL )                           /*!< Disable */
#define CLOCK_INTEN_DONE_Enabled             ( 1UL )                           /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event LFCLKSTARTED */
#define CLOCK_INTEN_LFCLKSTARTED_Pos         ( 1UL )                                   /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTEN_LFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTEN_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTEN_LFCLKSTARTED_Disabled    ( 0UL )                                   /*!< Disable */
#define CLOCK_INTEN_LFCLKSTARTED_Enabled     ( 1UL )                                   /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event HFCLKSTARTED */
#define CLOCK_INTEN_HFCLKSTARTED_Pos         ( 0UL )                                   /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTEN_HFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTEN_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTEN_HFCLKSTARTED_Disabled    ( 0UL )                                   /*!< Disable */
#define CLOCK_INTEN_HFCLKSTARTED_Enabled     ( 1UL )                                   /*!< Enable */

/* Register: CLOCK_INTENSET */
/* Description: Enable interrupt */

/* Bit 7 : Write '1' to enable interrupt for event DONE */
#define CLOCK_INTENSET_DONE_Pos                 ( 7UL )                              /*!< Position of DONE field. */
#define CLOCK_INTENSET_DONE_Msk                 ( 0x1UL << CLOCK_INTENSET_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTENSET_DONE_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENSET_DONE_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENSET_DONE_Set                 ( 1UL )                              /*!< Enable */

