FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 1 : Write '1' to enable interrupt for event LFCLKSTARTED */
#define CLOCK_INTENSET_LFCLKSTARTED_Pos         ( 1UL )                                      /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTENSET_LFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENSET_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTENSET_LFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENSET_LFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENSET_LFCLKSTARTED_Set         ( 1UL )                                      /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event HFCLKSTARTED */
#define CLOCK_INTENSET_HFCLKSTARTED_Pos         ( 0UL )                                      /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTENSET_HFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENSET_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTENSET_HFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENSET_HFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENSET_HFCLKSTARTED_Set         ( 1UL )                                      /*!< Enable */

/* Register: CLOCK_INTENCLR */
/* Description: Disable interrupt */

/* Bit 7 : Write '1' to disable interrupt for event DONE */
#define CLOCK_INTENCLR_DONE_Pos                 ( 7UL )                              /*!< Position of DONE field. */
#define CLOCK_INTENCLR_DONE_Msk                 ( 0x1UL << CLOCK_INTENCLR_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTENCLR_DONE_Disabled            ( 0UL )                              /*!< Read: Disabled */
#define CLOCK_INTENCLR_DONE_Enabled             ( 1UL )                              /*!< Read: Enabled */
#define CLOCK_INTENCLR_DONE_Clear               ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event LFCLKSTARTED */
#define CLOCK_INTENCLR_LFCLKSTARTED_Pos         ( 1UL )                                      /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTENCLR_LFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENCLR_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTENCLR_LFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENCLR_LFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENCLR_LFCLKSTARTED_Clear       ( 1UL )                                      /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event HFCLKSTARTED */
#define CLOCK_INTENCLR_HFCLKSTARTED_Pos         ( 0UL )                                      /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTENCLR_HFCLKSTARTED_Msk         ( 0x1UL << CLOCK_INTENCLR_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTENCLR_HFCLKSTARTED_Disabled    ( 0UL )                                      /*!< Read: Disabled */
#define CLOCK_INTENCLR_HFCLKSTARTED_Enabled     ( 1UL )                                      /*!< Read: Enabled */
#define CLOCK_INTENCLR_HFCLKSTARTED_Clear       ( 1UL )                                      /*!< Disable */

/* Register: CLOCK_INTPEND */
/* Description: Pending interrupts */

/* Bit 7 : Read pending status of interrupt for event DONE */
#define CLOCK_INTPEND_DONE_Pos                   ( 7UL )                             /*!< Position of DONE field. */
#define CLOCK_INTPEND_DONE_Msk                   ( 0x1UL << CLOCK_INTPEND_DONE_Pos ) /*!< Bit mask of DONE field. */
#define CLOCK_INTPEND_DONE_NotPending            ( 0UL )                             /*!< Read: Not pending */
#define CLOCK_INTPEND_DONE_Pending               ( 1UL )                             /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event LFCLKSTARTED */
#define CLOCK_INTPEND_LFCLKSTARTED_Pos           ( 1UL )                                     /*!< Position of LFCLKSTARTED field. */
#define CLOCK_INTPEND_LFCLKSTARTED_Msk           ( 0x1UL << CLOCK_INTPEND_LFCLKSTARTED_Pos ) /*!< Bit mask of LFCLKSTARTED field. */
#define CLOCK_INTPEND_LFCLKSTARTED_NotPending    ( 0UL )                                     /*!< Read: Not pending */
#define CLOCK_INTPEND_LFCLKSTARTED_Pending       ( 1UL )                                     /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event HFCLKSTARTED */
#define CLOCK_INTPEND_HFCLKSTARTED_Pos           ( 0UL )                                     /*!< Position of HFCLKSTARTED field. */
#define CLOCK_INTPEND_HFCLKSTARTED_Msk           ( 0x1UL << CLOCK_INTPEND_HFCLKSTARTED_Pos ) /*!< Bit mask of HFCLKSTARTED field. */
#define CLOCK_INTPEND_HFCLKSTARTED_NotPending    ( 0UL )                                     /*!< Read: Not pending */
#define CLOCK_INTPEND_HFCLKSTARTED_Pending       ( 1UL )                                     /*!< Read: Pending */

/* Register: CLOCK_HFCLKRUN */
/* Description: Status indicating that HFCLKSTART task has been triggered */

/* Bit 0 : HFCLKSTART task triggered or not */
#define CLOCK_HFCLKRUN_STATUS_Pos             ( 0UL )                                /*!< Position of STATUS field. */
#define CLOCK_HFCLKRUN_STATUS_Msk             ( 0x1UL << CLOCK_HFCLKRUN_STATUS_Pos ) /*!< Bit mask of STATUS field. */
#define CLOCK_HFCLKRUN_STATUS_NotTriggered    ( 0UL )                                /*!< Task not triggered */
#define CLOCK_HFCLKRUN_STATUS_Triggered       ( 1UL )                                /*!< Task triggered */

/* Register: CLOCK_HFCLKSTAT */
/* Description: Status indicating which HFCLK128M/HFCLK64M source is running This register value in any CLOCK instance reflects status only due to configurations/actions in that CLOCK instance. */

/* Bit 16 : HFCLK state */
#define CLOCK_HFCLKSTAT_STATE_Pos                   ( 16UL )                               /*!< Position of STATE field. */
#define CLOCK_HFCLKSTAT_STATE_Msk                   ( 0x1UL << CLOCK_HFCLKSTAT_STATE_Pos ) /*!< Bit mask of STATE field. */
#define CLOCK_HFCLKSTAT_STATE_NotRunning            ( 0UL )                                /*!< HFCLK not running */
#define CLOCK_HFCLKSTAT_STATE_Running               ( 1UL )                                /*!< HFCLK running */

/* Bit 4 : ALWAYSRUN activated */
#define CLOCK_HFCLKSTAT_ALWAYSRUNNING_Pos           ( 4UL )                                        /*!< Position of ALWAYSRUNNING field. */
#define CLOCK_HFCLKSTAT_ALWAYSRUNNING_Msk           ( 0x1UL << CLOCK_HFCLKSTAT_ALWAYSRUNNING_Pos ) /*!< Bit mask of ALWAYSRUNNING field. */
#define CLOCK_HFCLKSTAT_ALWAYSRUNNING_NotRunning    ( 0UL )                                        /*!< Automatic clock control enabled */
#define CLOCK_HFCLKSTAT_ALWAYSRUNNING_Running       ( 1UL )                                        /*!< Oscillator is always running */

/* Bit 0 : Active clock source */
#define CLOCK_HFCLKSTAT_SRC_Pos                     ( 0UL )                              /*!< Position of SRC field. */
#define CLOCK_HFCLKSTAT_SRC_Msk                     ( 0x1UL << CLOCK_HFCLKSTAT_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_HFCLKSTAT_SRC_HFINT                   ( 0UL )                              /*!< Clock source: HFINT - 128 MHz on-chip oscillator */
#define CLOCK_HFCLKSTAT_SRC_HFXO                    ( 1UL )                              /*!< Clock source: HFXO - 128 MHz clock derived from external 32 MHz crystal oscillator */

