FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: CLOCK_LFCLKRUN */
/* Description: Status indicating that LFCLKSTART task has been triggered */

/* Bit 0 : LFCLKSTART task triggered or not */
#define CLOCK_LFCLKRUN_STATUS_Pos             ( 0UL )                                /*!< Position of STATUS field. */
#define CLOCK_LFCLKRUN_STATUS_Msk             ( 0x1UL << CLOCK_LFCLKRUN_STATUS_Pos ) /*!< Bit mask of STATUS field. */
#define CLOCK_LFCLKRUN_STATUS_NotTriggered    ( 0UL )                                /*!< Task not triggered */
#define CLOCK_LFCLKRUN_STATUS_Triggered       ( 1UL )                                /*!< Task triggered */

/* Register: CLOCK_LFCLKSTAT */
/* Description: Status indicating which LFCLK source is running This register value in any CLOCK instance reflects status only due to configurations/actions in that CLOCK instance. */

/* Bit 16 : LFCLK state */
#define CLOCK_LFCLKSTAT_STATE_Pos                   ( 16UL )                               /*!< Position of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_Msk                   ( 0x1UL << CLOCK_LFCLKSTAT_STATE_Pos ) /*!< Bit mask of STATE field. */
#define CLOCK_LFCLKSTAT_STATE_NotRunning            ( 0UL )                                /*!< LFCLK not running */
#define CLOCK_LFCLKSTAT_STATE_Running               ( 1UL )                                /*!< LFCLK running */

/* Bit 4 : ALWAYSRUN activated */
#define CLOCK_LFCLKSTAT_ALWAYSRUNNING_Pos           ( 4UL )                                        /*!< Position of ALWAYSRUNNING field. */
#define CLOCK_LFCLKSTAT_ALWAYSRUNNING_Msk           ( 0x1UL << CLOCK_LFCLKSTAT_ALWAYSRUNNING_Pos ) /*!< Bit mask of ALWAYSRUNNING field. */
#define CLOCK_LFCLKSTAT_ALWAYSRUNNING_NotRunning    ( 0UL )                                        /*!< Automatic clock control enabled */
#define CLOCK_LFCLKSTAT_ALWAYSRUNNING_Running       ( 1UL )                                        /*!< Oscillator is always running */

/* Bits 1..0 : Active clock source */
#define CLOCK_LFCLKSTAT_SRC_Pos                     ( 0UL )                              /*!< Position of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_Msk                     ( 0x3UL << CLOCK_LFCLKSTAT_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSTAT_SRC_LFRC                    ( 1UL )                              /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSTAT_SRC_LFXO                    ( 2UL )                              /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSTAT_SRC_LFSYNT                  ( 3UL )                              /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_LFCLKSRCCOPY */
/* Description: Copy of LFCLKSRC register, set when LFCLKSTART task was triggered */

/* Bits 1..0 : Clock source */
#define CLOCK_LFCLKSRCCOPY_SRC_Pos       ( 0UL )                                 /*!< Position of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_Msk       ( 0x3UL << CLOCK_LFCLKSRCCOPY_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSRCCOPY_SRC_LFRC      ( 1UL )                                 /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSRCCOPY_SRC_LFXO      ( 2UL )                                 /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSRCCOPY_SRC_LFSYNT    ( 3UL )                                 /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_HFCLKSRC */
/* Description: Clock source for HFCLK128M/HFCLK64M */

/* Bit 0 : Select which HFCLK source is started by the HFCLKSTART task */
#define CLOCK_HFCLKSRC_SRC_Pos      ( 0UL )                             /*!< Position of SRC field. */
#define CLOCK_HFCLKSRC_SRC_Msk      ( 0x1UL << CLOCK_HFCLKSRC_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_HFCLKSRC_SRC_HFINT    ( 0UL )                             /*!< HFCLKSTART task starts HFINT oscillator */
#define CLOCK_HFCLKSRC_SRC_HFXO     ( 1UL )                             /*!< HFCLKSTART task starts HFXO oscillator */

/* Register: CLOCK_LFCLKSRC */
/* Description: Clock source for LFCLK */

/* Bits 1..0 : Select which LFCLK source is started by the LFCLKSTART task */
#define CLOCK_LFCLKSRC_SRC_Pos       ( 0UL )                             /*!< Position of SRC field. */
#define CLOCK_LFCLKSRC_SRC_Msk       ( 0x3UL << CLOCK_LFCLKSRC_SRC_Pos ) /*!< Bit mask of SRC field. */
#define CLOCK_LFCLKSRC_SRC_LFRC      ( 1UL )                             /*!< 32.768 kHz RC oscillator */
#define CLOCK_LFCLKSRC_SRC_LFXO      ( 2UL )                             /*!< 32.768 kHz crystal oscillator */
#define CLOCK_LFCLKSRC_SRC_LFSYNT    ( 3UL )                             /*!< 32.768 kHz synthesized from HFCLK */

/* Register: CLOCK_HFCLKCTRL */
/* Description: HFCLK128M frequency configuration */

/* Bits 1..0 : High frequency clock HCLK */
#define CLOCK_HFCLKCTRL_HCLK_Pos     ( 0UL )                               /*!< Position of HCLK field. */
#define CLOCK_HFCLKCTRL_HCLK_Msk     ( 0x3UL << CLOCK_HFCLKCTRL_HCLK_Pos ) /*!< Bit mask of HCLK field. */
#define CLOCK_HFCLKCTRL_HCLK_Div1    ( 0UL )                               /*!< Divide HFCLK by 1 */
#define CLOCK_HFCLKCTRL_HCLK_Div2    ( 1UL )                               /*!< Divide HFCLK by 2 */

/* Register: CLOCK_HFCLKALWAYSRUN */
/* Description: Automatic or manual control of HFCLK128M/HFCLK64M */

/* Bit 0 : Ensure clock is always running */
#define CLOCK_HFCLKALWAYSRUN_ALWAYSRUN_Pos          ( 0UL )                                         /*!< Position of ALWAYSRUN field. */
#define CLOCK_HFCLKALWAYSRUN_ALWAYSRUN_Msk          ( 0x1UL << CLOCK_HFCLKALWAYSRUN_ALWAYSRUN_Pos ) /*!< Bit mask of ALWAYSRUN field. */
#define CLOCK_HFCLKALWAYSRUN_ALWAYSRUN_Automatic    ( 0UL )                                         /*!< Use automatic clock control */
#define CLOCK_HFCLKALWAYSRUN_ALWAYSRUN_AlwaysRun    ( 1UL )                                         /*!< Ensure clock is always running */

/* Register: CLOCK_LFCLKALWAYSRUN */
/* Description: Automatic or manual control of LFCLK */

/* Bit 0 : Ensure clock is always running */
#define CLOCK_LFCLKALWAYSRUN_ALWAYSRUN_Pos          ( 0UL )                                         /*!< Position of ALWAYSRUN field. */
#define CLOCK_LFCLKALWAYSRUN_ALWAYSRUN_Msk          ( 0x1UL << CLOCK_LFCLKALWAYSRUN_ALWAYSRUN_Pos ) /*!< Bit mask of ALWAYSRUN field. */
#define CLOCK_LFCLKALWAYSRUN_ALWAYSRUN_Automatic    ( 0UL )                                         /*!< Use automatic clock control */
#define CLOCK_LFCLKALWAYSRUN_ALWAYSRUN_AlwaysRun    ( 1UL )                                         /*!< Ensure clock is always running */


