FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Peripheral: CTI */
/* Description: Cross-Trigger Interface control. NOTE: this is not a separate peripheral, but describes CM33 functionality. */

/* Register: CTI_CTICONTROL */
/* Description: CTI Control register */

/* Bit 0 : Enables or disables the CTI. */
#define CTI_CTICONTROL_GLBEN_Pos         ( 0UL )                               /*!< Position of GLBEN field. */
#define CTI_CTICONTROL_GLBEN_Msk         ( 0x1UL << CTI_CTICONTROL_GLBEN_Pos ) /*!< Bit mask of GLBEN field. */
#define CTI_CTICONTROL_GLBEN_Disabled    ( 0UL )                               /*!< All cross-triggering mapping logic functionality is disabled. */
#define CTI_CTICONTROL_GLBEN_Enabled     ( 1UL )                               /*!< Cross-triggering mapping logic functionality is enabled. */

/* Register: CTI_CTIINTACK */
/* Description: CTI Interrupt Acknowledge register */

/* Bit 7 : N/A */
#define CTI_CTIINTACK_UNUSED5_Pos               ( 7UL )                                /*!< Position of UNUSED5 field. */
#define CTI_CTIINTACK_UNUSED5_Msk               ( 0x1UL << CTI_CTIINTACK_UNUSED5_Pos ) /*!< Bit mask of UNUSED5 field. */
#define CTI_CTIINTACK_UNUSED5_Acknowledge       ( 1UL )                                /*!< Clears the ctitrigout. */

/* Bit 6 : N/A */
#define CTI_CTIINTACK_UNUSED4_Pos               ( 6UL )                                /*!< Position of UNUSED4 field. */
#define CTI_CTIINTACK_UNUSED4_Msk               ( 0x1UL << CTI_CTIINTACK_UNUSED4_Pos ) /*!< Bit mask of UNUSED4 field. */
#define CTI_CTIINTACK_UNUSED4_Acknowledge       ( 1UL )                                /*!< Clears the ctitrigout. */

/* Bit 5 : N/A */
#define CTI_CTIINTACK_UNUSED3_Pos               ( 5UL )                                /*!< Position of UNUSED3 field. */
#define CTI_CTIINTACK_UNUSED3_Msk               ( 0x1UL << CTI_CTIINTACK_UNUSED3_Pos ) /*!< Bit mask of UNUSED3 field. */
#define CTI_CTIINTACK_UNUSED3_Acknowledge       ( 1UL )                                /*!< Clears the ctitrigout. */

/* Bit 4 : N/A */
#define CTI_CTIINTACK_UNUSED2_Pos               ( 4UL )                                /*!< Position of UNUSED2 field. */
#define CTI_CTIINTACK_UNUSED2_Msk               ( 0x1UL << CTI_CTIINTACK_UNUSED2_Pos ) /*!< Bit mask of UNUSED2 field. */
#define CTI_CTIINTACK_UNUSED2_Acknowledge       ( 1UL )                                /*!< Clears the ctitrigout. */

/* Bit 3 : N/A */
#define CTI_CTIINTACK_UNUSED1_Pos               ( 3UL )                                /*!< Position of UNUSED1 field. */
#define CTI_CTIINTACK_UNUSED1_Msk               ( 0x1UL << CTI_CTIINTACK_UNUSED1_Pos ) /*!< Bit mask of UNUSED1 field. */
#define CTI_CTIINTACK_UNUSED1_Acknowledge       ( 1UL )                                /*!< Clears the ctitrigout. */

/* Bit 2 : N/A */
#define CTI_CTIINTACK_UNUSED0_Pos               ( 2UL )                                /*!< Position of UNUSED0 field. */
#define CTI_CTIINTACK_UNUSED0_Msk               ( 0x1UL << CTI_CTIINTACK_UNUSED0_Pos ) /*!< Bit mask of UNUSED0 field. */
#define CTI_CTIINTACK_UNUSED0_Acknowledge       ( 1UL )                                /*!< Clears the ctitrigout. */

/* Bit 1 : Processor Restart */
#define CTI_CTIINTACK_CPURESTART_Pos            ( 1UL )                                   /*!< Position of CPURESTART field. */
#define CTI_CTIINTACK_CPURESTART_Msk            ( 0x1UL << CTI_CTIINTACK_CPURESTART_Pos ) /*!< Bit mask of CPURESTART field. */
#define CTI_CTIINTACK_CPURESTART_Acknowledge    ( 1UL )                                   /*!< Clears the ctitrigout. */

/* Bit 0 : Processor debug request */
#define CTI_CTIINTACK_DEBUGREQ_Pos              ( 0UL )                                 /*!< Position of DEBUGREQ field. */
#define CTI_CTIINTACK_DEBUGREQ_Msk              ( 0x1UL << CTI_CTIINTACK_DEBUGREQ_Pos ) /*!< Bit mask of DEBUGREQ field. */
#define CTI_CTIINTACK_DEBUGREQ_Acknowledge      ( 1UL )                                 /*!< Clears the ctitrigout. */

/* Register: CTI_CTIAPPSET */
/* Description: CTI Application Trigger Set register */

/* Bit 3 : Application trigger event for channel 3. */
#define CTI_CTIAPPSET_APPSET_3_Pos         ( 3UL )                                 /*!< Position of APPSET_3 field. */
#define CTI_CTIAPPSET_APPSET_3_Msk         ( 0x1UL << CTI_CTIAPPSET_APPSET_3_Pos ) /*!< Bit mask of APPSET_3 field. */
#define CTI_CTIAPPSET_APPSET_3_Inactive    ( 0UL )                                 /*!< Application trigger 3 is inactive. */
#define CTI_CTIAPPSET_APPSET_3_Active      ( 1UL )                                 /*!< Application trigger 3 is active. */
#define CTI_CTIAPPSET_APPSET_3_Activate    ( 1UL )                                 /*!< Generate channel event for channel 3. */

/* Bit 2 : Application trigger event for channel 2. */
#define CTI_CTIAPPSET_APPSET_2_Pos         ( 2UL )                                 /*!< Position of APPSET_2 field. */
#define CTI_CTIAPPSET_APPSET_2_Msk         ( 0x1UL << CTI_CTIAPPSET_APPSET_2_Pos ) /*!< Bit mask of APPSET_2 field. */
#define CTI_CTIAPPSET_APPSET_2_Inactive    ( 0UL )                                 /*!< Application trigger 2 is inactive. */
#define CTI_CTIAPPSET_APPSET_2_Active      ( 1UL )                                 /*!< Application trigger 2 is active. */
#define CTI_CTIAPPSET_APPSET_2_Activate    ( 1UL )                                 /*!< Generate channel event for channel 2. */

/* Bit 1 : Application trigger event for channel 1. */
#define CTI_CTIAPPSET_APPSET_1_Pos         ( 1UL )                                 /*!< Position of APPSET_1 field. */
#define CTI_CTIAPPSET_APPSET_1_Msk         ( 0x1UL << CTI_CTIAPPSET_APPSET_1_Pos ) /*!< Bit mask of APPSET_1 field. */
#define CTI_CTIAPPSET_APPSET_1_Inactive    ( 0UL )                                 /*!< Application trigger 1 is inactive. */
#define CTI_CTIAPPSET_APPSET_1_Active      ( 1UL )                                 /*!< Application trigger 1 is active. */
#define CTI_CTIAPPSET_APPSET_1_Activate    ( 1UL )                                 /*!< Generate channel event for channel 1. */

/* Bit 0 : Application trigger event for channel 0. */
#define CTI_CTIAPPSET_APPSET_0_Pos         ( 0UL )                                 /*!< Position of APPSET_0 field. */
#define CTI_CTIAPPSET_APPSET_0_Msk         ( 0x1UL << CTI_CTIAPPSET_APPSET_0_Pos ) /*!< Bit mask of APPSET_0 field. */
#define CTI_CTIAPPSET_APPSET_0_Inactive    ( 0UL )                                 /*!< Application trigger 0 is inactive. */
#define CTI_CTIAPPSET_APPSET_0_Active      ( 1UL )                                 /*!< Application trigger 0 is active. */
#define CTI_CTIAPPSET_APPSET_0_Activate    ( 1UL )                                 /*!< Generate channel event for channel 0. */

/* Register: CTI_CTIAPPCLEAR */
/* Description: CTI Application Trigger Clear register */

