FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 7 : N/A */
#define CTI_CTITRIGINSTATUS_UNUSED3_Pos             ( 7UL )                                      /*!< Position of UNUSED3 field. */
#define CTI_CTITRIGINSTATUS_UNUSED3_Msk             ( 0x1UL << CTI_CTITRIGINSTATUS_UNUSED3_Pos ) /*!< Bit mask of UNUSED3 field. */
#define CTI_CTITRIGINSTATUS_UNUSED3_Inactive        ( 0UL )                                      /*!< Ctitrigin 7 is inactive. */
#define CTI_CTITRIGINSTATUS_UNUSED3_Active          ( 1UL )                                      /*!< Ctitrigin 7 is active. */

/* Bit 6 : N/A */
#define CTI_CTITRIGINSTATUS_UNUSED2_Pos             ( 6UL )                                      /*!< Position of UNUSED2 field. */
#define CTI_CTITRIGINSTATUS_UNUSED2_Msk             ( 0x1UL << CTI_CTITRIGINSTATUS_UNUSED2_Pos ) /*!< Bit mask of UNUSED2 field. */
#define CTI_CTITRIGINSTATUS_UNUSED2_Inactive        ( 0UL )                                      /*!< Ctitrigin 6 is inactive. */
#define CTI_CTITRIGINSTATUS_UNUSED2_Active          ( 1UL )                                      /*!< Ctitrigin 6 is active. */

/* Bit 5 : N/A */
#define CTI_CTITRIGINSTATUS_UNUSED1_Pos             ( 5UL )                                      /*!< Position of UNUSED1 field. */
#define CTI_CTITRIGINSTATUS_UNUSED1_Msk             ( 0x1UL << CTI_CTITRIGINSTATUS_UNUSED1_Pos ) /*!< Bit mask of UNUSED1 field. */
#define CTI_CTITRIGINSTATUS_UNUSED1_Inactive        ( 0UL )                                      /*!< Ctitrigin 5 is inactive. */
#define CTI_CTITRIGINSTATUS_UNUSED1_Active          ( 1UL )                                      /*!< Ctitrigin 5 is active. */

/* Bit 4 : N/A */
#define CTI_CTITRIGINSTATUS_UNUSED0_Pos             ( 4UL )                                      /*!< Position of UNUSED0 field. */
#define CTI_CTITRIGINSTATUS_UNUSED0_Msk             ( 0x1UL << CTI_CTITRIGINSTATUS_UNUSED0_Pos ) /*!< Bit mask of UNUSED0 field. */
#define CTI_CTITRIGINSTATUS_UNUSED0_Inactive        ( 0UL )                                      /*!< Ctitrigin 4 is inactive. */
#define CTI_CTITRIGINSTATUS_UNUSED0_Active          ( 1UL )                                      /*!< Ctitrigin 4 is active. */

/* Bit 3 : DWT Comparator Output 2 */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Pos         ( 3UL )                                          /*!< Position of DWTCOMPOUT2 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Msk         ( 0x1UL << CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Pos ) /*!< Bit mask of DWTCOMPOUT2 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Inactive    ( 0UL )                                          /*!< Ctitrigin 3 is inactive. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT2_Active      ( 1UL )                                          /*!< Ctitrigin 3 is active. */

/* Bit 2 : DWT Comparator Output 1 */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Pos         ( 2UL )                                          /*!< Position of DWTCOMPOUT1 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Msk         ( 0x1UL << CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Pos ) /*!< Bit mask of DWTCOMPOUT1 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Inactive    ( 0UL )                                          /*!< Ctitrigin 2 is inactive. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT1_Active      ( 1UL )                                          /*!< Ctitrigin 2 is active. */

/* Bit 1 : DWT Comparator Output 0 */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Pos         ( 1UL )                                          /*!< Position of DWTCOMPOUT0 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Msk         ( 0x1UL << CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Pos ) /*!< Bit mask of DWTCOMPOUT0 field. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Inactive    ( 0UL )                                          /*!< Ctitrigin 1 is inactive. */
#define CTI_CTITRIGINSTATUS_DWTCOMPOUT0_Active      ( 1UL )                                          /*!< Ctitrigin 1 is active. */

/* Bit 0 : Processor Halted */
#define CTI_CTITRIGINSTATUS_CPUHALTED_Pos           ( 0UL )                                        /*!< Position of CPUHALTED field. */
#define CTI_CTITRIGINSTATUS_CPUHALTED_Msk           ( 0x1UL << CTI_CTITRIGINSTATUS_CPUHALTED_Pos ) /*!< Bit mask of CPUHALTED field. */
#define CTI_CTITRIGINSTATUS_CPUHALTED_Inactive      ( 0UL )                                        /*!< Ctitrigin 0 is inactive. */
#define CTI_CTITRIGINSTATUS_CPUHALTED_Active        ( 1UL )                                        /*!< Ctitrigin 0 is active. */

/* Register: CTI_CTITRIGOUTSTATUS */
/* Description: CTI Trigger Out Status register */

/* Bit 7 : N/A */
#define CTI_CTITRIGOUTSTATUS_UNUSED5_Pos            ( 7UL )                                       /*!< Position of UNUSED5 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED5_Msk            ( 0x1UL << CTI_CTITRIGOUTSTATUS_UNUSED5_Pos ) /*!< Bit mask of UNUSED5 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED5_Inactive       ( 0UL )                                       /*!< Ctitrigout 7 is inactive. */
#define CTI_CTITRIGOUTSTATUS_UNUSED5_Active         ( 1UL )                                       /*!< Ctitrigout 7 is active. */

/* Bit 6 : N/A */
#define CTI_CTITRIGOUTSTATUS_UNUSED4_Pos            ( 6UL )                                       /*!< Position of UNUSED4 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED4_Msk            ( 0x1UL << CTI_CTITRIGOUTSTATUS_UNUSED4_Pos ) /*!< Bit mask of UNUSED4 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED4_Inactive       ( 0UL )                                       /*!< Ctitrigout 6 is inactive. */
#define CTI_CTITRIGOUTSTATUS_UNUSED4_Active         ( 1UL )                                       /*!< Ctitrigout 6 is active. */

/* Bit 5 : N/A */
#define CTI_CTITRIGOUTSTATUS_UNUSED3_Pos            ( 5UL )                                       /*!< Position of UNUSED3 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED3_Msk            ( 0x1UL << CTI_CTITRIGOUTSTATUS_UNUSED3_Pos ) /*!< Bit mask of UNUSED3 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED3_Inactive       ( 0UL )                                       /*!< Ctitrigout 5 is inactive. */
#define CTI_CTITRIGOUTSTATUS_UNUSED3_Active         ( 1UL )                                       /*!< Ctitrigout 5 is active. */

/* Bit 4 : N/A */
#define CTI_CTITRIGOUTSTATUS_UNUSED2_Pos            ( 4UL )                                       /*!< Position of UNUSED2 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED2_Msk            ( 0x1UL << CTI_CTITRIGOUTSTATUS_UNUSED2_Pos ) /*!< Bit mask of UNUSED2 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED2_Inactive       ( 0UL )                                       /*!< Ctitrigout 4 is inactive. */
#define CTI_CTITRIGOUTSTATUS_UNUSED2_Active         ( 1UL )                                       /*!< Ctitrigout 4 is active. */

/* Bit 3 : N/A */
#define CTI_CTITRIGOUTSTATUS_UNUSED1_Pos            ( 3UL )                                       /*!< Position of UNUSED1 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED1_Msk            ( 0x1UL << CTI_CTITRIGOUTSTATUS_UNUSED1_Pos ) /*!< Bit mask of UNUSED1 field. */
#define CTI_CTITRIGOUTSTATUS_UNUSED1_Inactive       ( 0UL )                                       /*!< Ctitrigout 3 is inactive. */
#define CTI_CTITRIGOUTSTATUS_UNUSED1_Active         ( 1UL )                                       /*!< Ctitrigout 3 is active. */

