FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: CTI_DEVARCH */
/* Description: Device Architecture register */

/* Bit 0 : Contains the CTI device architecture. */
#define CTI_DEVARCH_Architecture_Pos    ( 0UL )                                   /*!< Position of Architecture field. */
#define CTI_DEVARCH_Architecture_Msk    ( 0x1UL << CTI_DEVARCH_Architecture_Pos ) /*!< Bit mask of Architecture field. */

/* Register: CTI_DEVID */
/* Description: Device Configuration register */

/* Bits 19..16 : Number of ECT channels available. */
#define CTI_DEVID_NUMCH_Pos        ( 16UL )                         /*!< Position of NUMCH field. */
#define CTI_DEVID_NUMCH_Msk        ( 0xFUL << CTI_DEVID_NUMCH_Pos ) /*!< Bit mask of NUMCH field. */

/* Bits 15..8 : Number of ECT triggers available. */
#define CTI_DEVID_NUMTRIG_Pos      ( 8UL )                             /*!< Position of NUMTRIG field. */
#define CTI_DEVID_NUMTRIG_Msk      ( 0xFFUL << CTI_DEVID_NUMTRIG_Pos ) /*!< Bit mask of NUMTRIG field. */

/* Bits 4..0 : Indicates the number of multiplexers available on Trigger Inputs and Trigger Outputs that are using asicctl.
 *                  The default value of 0b00000 indicates that no multiplexing is present. */
#define CTI_DEVID_EXTMUXNUM_Pos    ( 0UL )                               /*!< Position of EXTMUXNUM field. */
#define CTI_DEVID_EXTMUXNUM_Msk    ( 0x1FUL << CTI_DEVID_EXTMUXNUM_Pos ) /*!< Bit mask of EXTMUXNUM field. */

/* Register: CTI_DEVTYPE */
/* Description: Device Type Identifier register */

/* Bits 7..4 : Sub-classification of the type of the debug component as specified in the Arm Architecture Specification within
 *                  the major classification as specified in the MAJOR field. */
#define CTI_DEVTYPE_SUB_Pos             ( 4UL )                          /*!< Position of SUB field. */
#define CTI_DEVTYPE_SUB_Msk             ( 0xFUL << CTI_DEVTYPE_SUB_Pos ) /*!< Bit mask of SUB field. */
#define CTI_DEVTYPE_SUB_Crosstrigger    ( 1UL )                          /*!< Indicates that this component is a sub-triggering component. */

/* Bits 3..0 : Major classification of the type of the debug component as specified in the Arm Architecture Specification for this
 *                  debug and trace component. */
#define CTI_DEVTYPE_MAJOR_Pos           ( 0UL )                            /*!< Position of MAJOR field. */
#define CTI_DEVTYPE_MAJOR_Msk           ( 0xFUL << CTI_DEVTYPE_MAJOR_Pos ) /*!< Bit mask of MAJOR field. */
#define CTI_DEVTYPE_MAJOR_Controller    ( 4UL )                            /*!< Indicates that this component allows a debugger to control other components in an Arm CoreSight SoC-400 system. */

/* Register: CTI_PIDR4 */
/* Description: Peripheral ID4 Register */

/* Bits 7..4 : Always 0b0000. Indicates that the device only occupies 4KB of memory. */
#define CTI_PIDR4_SIZE_Pos      ( 4UL )                         /*!< Position of SIZE field. */
#define CTI_PIDR4_SIZE_Msk      ( 0xFUL << CTI_PIDR4_SIZE_Pos ) /*!< Bit mask of SIZE field. */

/* Bits 3..0 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
#define CTI_PIDR4_DES_2_Pos     ( 0UL )                          /*!< Position of DES_2 field. */
#define CTI_PIDR4_DES_2_Msk     ( 0xFUL << CTI_PIDR4_DES_2_Pos ) /*!< Bit mask of DES_2 field. */
#define CTI_PIDR4_DES_2_Code    ( 4UL )                          /*!< JEDEC continuation code. */

/* Register: CTI_PIDR0 */
/* Description: Peripheral ID0 Register */

/* Bits 7..0 : Bits[7:0] of the 12-bit part number of the component. The designer of the component assigns this part number. */
#define CTI_PIDR0_PART_0_Pos            ( 0UL )                            /*!< Position of PART_0 field. */
#define CTI_PIDR0_PART_0_Msk            ( 0xFFUL << CTI_PIDR0_PART_0_Pos ) /*!< Bit mask of PART_0 field. */
#define CTI_PIDR0_PART_0_PartnumberL    ( 0x21UL )                         /*!< Indicates bits[7:0] of the part number of the component. */

/* Register: CTI_PIDR1 */
/* Description: Peripheral ID1 Register */

/* Bits 7..4 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
#define CTI_PIDR1_DES_0_Pos             ( 4UL )                          /*!< Position of DES_0 field. */
#define CTI_PIDR1_DES_0_Msk             ( 0xFUL << CTI_PIDR1_DES_0_Pos ) /*!< Bit mask of DES_0 field. */
#define CTI_PIDR1_DES_0_Arm             ( 11UL )                         /*!< Arm. Bits[3:0] of the JEDEC JEP106 Identity Code */

/* Bits 3..0 : Bits[11:8] of the 12-bit part number of the component. The designer of the component assigns this part number. */
#define CTI_PIDR1_PART_1_Pos            ( 0UL )                           /*!< Position of PART_1 field. */
#define CTI_PIDR1_PART_1_Msk            ( 0xFUL << CTI_PIDR1_PART_1_Pos ) /*!< Bit mask of PART_1 field. */
#define CTI_PIDR1_PART_1_PartnumberH    ( 13UL )                          /*!< Indicates bits[11:8] of the part number of the component. */

/* Register: CTI_PIDR2 */
/* Description: Peripheral ID2 Register */

/* Bits 7..4 : Peripheral revision */
#define CTI_PIDR2_REVISION_Pos       ( 4UL )                             /*!< Position of REVISION field. */
#define CTI_PIDR2_REVISION_Msk       ( 0xFUL << CTI_PIDR2_REVISION_Pos ) /*!< Bit mask of REVISION field. */
#define CTI_PIDR2_REVISION_Rev0p0    ( 0UL )                             /*!< This device is at r0p0 */

/* Bit 3 : Always 1. Indicates that the JEDEC-assigned designer ID is used. */
#define CTI_PIDR2_JEDEC_Pos          ( 3UL )                          /*!< Position of JEDEC field. */
#define CTI_PIDR2_JEDEC_Msk          ( 0x1UL << CTI_PIDR2_JEDEC_Pos ) /*!< Bit mask of JEDEC field. */

/* Bits 2..0 : Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component. */
#define CTI_PIDR2_DES_1_Pos          ( 0UL )                          /*!< Position of DES_1 field. */
#define CTI_PIDR2_DES_1_Msk          ( 0x7UL << CTI_PIDR2_DES_1_Pos ) /*!< Bit mask of DES_1 field. */
#define CTI_PIDR2_DES_1_Arm          ( 3UL )                          /*!< Arm. Bits[6:4] of the JEDEC JEP106 Identity Code */

/* Register: CTI_PIDR3 */
/* Description: Peripheral ID3 Register */

/* Bits 7..4 : Indicates minor errata fixes specific to the revision of the component being used, for example metal fixes after
 *                  implementation. In most cases, this field is 0b0000. Arm recommends that the component designers ensure that a
 *                  metal fix can change this field if required, for example, by driving it from registers that reset to 0b0000. */
#define CTI_PIDR3_REVAND_Pos         ( 4UL )                           /*!< Position of REVAND field. */
#define CTI_PIDR3_REVAND_Msk         ( 0xFUL << CTI_PIDR3_REVAND_Pos ) /*!< Bit mask of REVAND field. */
#define CTI_PIDR3_REVAND_NoErrata    ( 0UL )                           /*!< Indicates that there are no errata fixes to this component. */

/* Bits 3..0 : Customer Modified. Indicates whether the customer has modified the behavior of the component. In most cases,
 *                  this field is 0b0000. Customers change this value when they make authorized modifications to this component. */
#define CTI_PIDR3_CMOD_Pos           ( 0UL )                         /*!< Position of CMOD field. */
#define CTI_PIDR3_CMOD_Msk           ( 0xFUL << CTI_PIDR3_CMOD_Pos ) /*!< Bit mask of CMOD field. */
#define CTI_PIDR3_CMOD_Unmodified    ( 0UL )                         /*!< Indicates that the customer has not modified this component. */

