FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 31..0 : If the value of the KEY field is non-zero, and the KEY fields match on both the
 *      CPU and debugger sides, disable APPROTECT and enable debug access to non-secure mode until
 *      the next pin reset, brown-out reset, power-on reset, or watchog timer reset. After reset the debugger side register has a fixed KEY value. To enable debug access, both CTRL-AP and UICR.APPROTECT protection needs to be disabled. */
#define CTRLAPPERI_APPROTECT_DISABLE_KEY_Pos    ( 0UL )                                                  /*!< Position of KEY field. */
#define CTRLAPPERI_APPROTECT_DISABLE_KEY_Msk    ( 0xFFFFFFFFUL << CTRLAPPERI_APPROTECT_DISABLE_KEY_Pos ) /*!< Bit mask of KEY field. */

/* Register: CTRLAPPERI_STATUS */
/* Description: Status bits for CTRL-AP peripheral. */

/* Bit 2 : Status bit for device debug interface mode */
#define CTRLAPPERI_STATUS_DBGIFACEMODE_Pos          ( 2UL )                                         /*!< Position of DBGIFACEMODE field. */
#define CTRLAPPERI_STATUS_DBGIFACEMODE_Msk          ( 0x1UL << CTRLAPPERI_STATUS_DBGIFACEMODE_Pos ) /*!< Bit mask of DBGIFACEMODE field. */
#define CTRLAPPERI_STATUS_DBGIFACEMODE_Disabled     ( 0UL )                                         /*!< No debugger attached */
#define CTRLAPPERI_STATUS_DBGIFACEMODE_Enabled      ( 1UL )                                         /*!< Debugger is attached and device is in debug interface mode */

/* Bit 0 : Status bit for UICR part of access port protection at last reset. */
#define CTRLAPPERI_STATUS_UICRAPPROTECT_Pos         ( 0UL )                                          /*!< Position of UICRAPPROTECT field. */
#define CTRLAPPERI_STATUS_UICRAPPROTECT_Msk         ( 0x1UL << CTRLAPPERI_STATUS_UICRAPPROTECT_Pos ) /*!< Bit mask of UICRAPPROTECT field. */
#define CTRLAPPERI_STATUS_UICRAPPROTECT_Enabled     ( 0UL )                                          /*!< APPROTECT was enabled in UICR */
#define CTRLAPPERI_STATUS_UICRAPPROTECT_Disabled    ( 1UL )                                          /*!< APPROTECT wasdisabled in UICR */


/* Peripheral: DCNF */
/* Description: Domain configuration management */

/* Register: DCNF_CPUID */
/* Description: CPU ID of this subsystem */

/* Bits 7..0 : CPU ID */
#define DCNF_CPUID_CPUID_Pos    ( 0UL )                            /*!< Position of CPUID field. */
#define DCNF_CPUID_CPUID_Msk    ( 0xFFUL << DCNF_CPUID_CPUID_Pos ) /*!< Bit mask of CPUID field. */


/* Peripheral: DPPIC */
/* Description: Distributed programmable peripheral interconnect controller */

/* Register: DPPIC_TASKS_CHG_EN */
/* Description: Description cluster: Enable channel group n */

/* Bit 0 : Enable channel group n */
#define DPPIC_TASKS_CHG_EN_EN_Pos        ( 0UL )                                /*!< Position of EN field. */
#define DPPIC_TASKS_CHG_EN_EN_Msk        ( 0x1UL << DPPIC_TASKS_CHG_EN_EN_Pos ) /*!< Bit mask of EN field. */
#define DPPIC_TASKS_CHG_EN_EN_Trigger    ( 1UL )                                /*!< Trigger task */

/* Register: DPPIC_TASKS_CHG_DIS */
/* Description: Description cluster: Disable channel group n */

/* Bit 0 : Disable channel group n */
#define DPPIC_TASKS_CHG_DIS_DIS_Pos        ( 0UL )                                  /*!< Position of DIS field. */
#define DPPIC_TASKS_CHG_DIS_DIS_Msk        ( 0x1UL << DPPIC_TASKS_CHG_DIS_DIS_Pos ) /*!< Bit mask of DIS field. */
#define DPPIC_TASKS_CHG_DIS_DIS_Trigger    ( 1UL )                                  /*!< Trigger task */

/* Register: DPPIC_SUBSCRIBE_CHG_EN */
/* Description: Description cluster: Subscribe configuration for task CHG[n].EN */

/* Bit 31 :   */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Msk         ( 0x1UL << DPPIC_SUBSCRIBE_CHG_EN_EN_Pos ) /*!< Bit mask of EN field. */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define DPPIC_SUBSCRIBE_CHG_EN_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CHG[n].EN will subscribe to */
#define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Msk      ( 0xFFUL << DPPIC_SUBSCRIBE_CHG_EN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: DPPIC_SUBSCRIBE_CHG_DIS */
/* Description: Description cluster: Subscribe configuration for task CHG[n].DIS */

/* Bit 31 :   */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Msk         ( 0x1UL << DPPIC_SUBSCRIBE_CHG_DIS_EN_Pos ) /*!< Bit mask of EN field. */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define DPPIC_SUBSCRIBE_CHG_DIS_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CHG[n].DIS will subscribe to */
#define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Msk      ( 0xFFUL << DPPIC_SUBSCRIBE_CHG_DIS_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: DPPIC_CHEN */
/* Description: Channel enable register */

/* Bit 31 : Enable or disable channel 31 */
#define DPPIC_CHEN_CH31_Pos         ( 31UL )                         /*!< Position of CH31 field. */
#define DPPIC_CHEN_CH31_Msk         ( 0x1UL << DPPIC_CHEN_CH31_Pos ) /*!< Bit mask of CH31 field. */
#define DPPIC_CHEN_CH31_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH31_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 30 : Enable or disable channel 30 */
#define DPPIC_CHEN_CH30_Pos         ( 30UL )                         /*!< Position of CH30 field. */
#define DPPIC_CHEN_CH30_Msk         ( 0x1UL << DPPIC_CHEN_CH30_Pos ) /*!< Bit mask of CH30 field. */
#define DPPIC_CHEN_CH30_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH30_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 29 : Enable or disable channel 29 */
#define DPPIC_CHEN_CH29_Pos         ( 29UL )                         /*!< Position of CH29 field. */
#define DPPIC_CHEN_CH29_Msk         ( 0x1UL << DPPIC_CHEN_CH29_Pos ) /*!< Bit mask of CH29 field. */
#define DPPIC_CHEN_CH29_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH29_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 28 : Enable or disable channel 28 */
#define DPPIC_CHEN_CH28_Pos         ( 28UL )                         /*!< Position of CH28 field. */
#define DPPIC_CHEN_CH28_Msk         ( 0x1UL << DPPIC_CHEN_CH28_Pos ) /*!< Bit mask of CH28 field. */
#define DPPIC_CHEN_CH28_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH28_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 27 : Enable or disable channel 27 */
#define DPPIC_CHEN_CH27_Pos         ( 27UL )                         /*!< Position of CH27 field. */
#define DPPIC_CHEN_CH27_Msk         ( 0x1UL << DPPIC_CHEN_CH27_Pos ) /*!< Bit mask of CH27 field. */
#define DPPIC_CHEN_CH27_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH27_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 26 : Enable or disable channel 26 */
#define DPPIC_CHEN_CH26_Pos         ( 26UL )                         /*!< Position of CH26 field. */
#define DPPIC_CHEN_CH26_Msk         ( 0x1UL << DPPIC_CHEN_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define DPPIC_CHEN_CH26_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH26_Enabled     ( 1UL )                          /*!< Enable channel */

/* Bit 25 : Enable or disable channel 25 */
#define DPPIC_CHEN_CH25_Pos         ( 25UL )                         /*!< Position of CH25 field. */
#define DPPIC_CHEN_CH25_Msk         ( 0x1UL << DPPIC_CHEN_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define DPPIC_CHEN_CH25_Disabled    ( 0UL )                          /*!< Disable channel */
#define DPPIC_CHEN_CH25_Enabled     ( 1UL )                          /*!< Enable channel */

