FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 6 : Enable or disable channel 6 */
#define DPPIC_CHEN_CH6_Pos          ( 6UL )                         /*!< Position of CH6 field. */
#define DPPIC_CHEN_CH6_Msk          ( 0x1UL << DPPIC_CHEN_CH6_Pos ) /*!< Bit mask of CH6 field. */
#define DPPIC_CHEN_CH6_Disabled     ( 0UL )                         /*!< Disable channel */
#define DPPIC_CHEN_CH6_Enabled      ( 1UL )                         /*!< Enable channel */

/* Bit 5 : Enable or disable channel 5 */
#define DPPIC_CHEN_CH5_Pos          ( 5UL )                         /*!< Position of CH5 field. */
#define DPPIC_CHEN_CH5_Msk          ( 0x1UL << DPPIC_CHEN_CH5_Pos ) /*!< Bit mask of CH5 field. */
#define DPPIC_CHEN_CH5_Disabled     ( 0UL )                         /*!< Disable channel */
#define DPPIC_CHEN_CH5_Enabled      ( 1UL )                         /*!< Enable channel */

/* Bit 4 : Enable or disable channel 4 */
#define DPPIC_CHEN_CH4_Pos          ( 4UL )                         /*!< Position of CH4 field. */
#define DPPIC_CHEN_CH4_Msk          ( 0x1UL << DPPIC_CHEN_CH4_Pos ) /*!< Bit mask of CH4 field. */
#define DPPIC_CHEN_CH4_Disabled     ( 0UL )                         /*!< Disable channel */
#define DPPIC_CHEN_CH4_Enabled      ( 1UL )                         /*!< Enable channel */

/* Bit 3 : Enable or disable channel 3 */
#define DPPIC_CHEN_CH3_Pos          ( 3UL )                         /*!< Position of CH3 field. */
#define DPPIC_CHEN_CH3_Msk          ( 0x1UL << DPPIC_CHEN_CH3_Pos ) /*!< Bit mask of CH3 field. */
#define DPPIC_CHEN_CH3_Disabled     ( 0UL )                         /*!< Disable channel */
#define DPPIC_CHEN_CH3_Enabled      ( 1UL )                         /*!< Enable channel */

/* Bit 2 : Enable or disable channel 2 */
#define DPPIC_CHEN_CH2_Pos          ( 2UL )                         /*!< Position of CH2 field. */
#define DPPIC_CHEN_CH2_Msk          ( 0x1UL << DPPIC_CHEN_CH2_Pos ) /*!< Bit mask of CH2 field. */
#define DPPIC_CHEN_CH2_Disabled     ( 0UL )                         /*!< Disable channel */
#define DPPIC_CHEN_CH2_Enabled      ( 1UL )                         /*!< Enable channel */

/* Bit 1 : Enable or disable channel 1 */
#define DPPIC_CHEN_CH1_Pos          ( 1UL )                         /*!< Position of CH1 field. */
#define DPPIC_CHEN_CH1_Msk          ( 0x1UL << DPPIC_CHEN_CH1_Pos ) /*!< Bit mask of CH1 field. */
#define DPPIC_CHEN_CH1_Disabled     ( 0UL )                         /*!< Disable channel */
#define DPPIC_CHEN_CH1_Enabled      ( 1UL )                         /*!< Enable channel */

/* Bit 0 : Enable or disable channel 0 */
#define DPPIC_CHEN_CH0_Pos          ( 0UL )                         /*!< Position of CH0 field. */
#define DPPIC_CHEN_CH0_Msk          ( 0x1UL << DPPIC_CHEN_CH0_Pos ) /*!< Bit mask of CH0 field. */
#define DPPIC_CHEN_CH0_Disabled     ( 0UL )                         /*!< Disable channel */
#define DPPIC_CHEN_CH0_Enabled      ( 1UL )                         /*!< Enable channel */

/* Register: DPPIC_CHENSET */
/* Description: Channel enable set register */

/* Bit 31 : Channel 31 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH31_Pos         ( 31UL )                            /*!< Position of CH31 field. */
#define DPPIC_CHENSET_CH31_Msk         ( 0x1UL << DPPIC_CHENSET_CH31_Pos ) /*!< Bit mask of CH31 field. */
#define DPPIC_CHENSET_CH31_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH31_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH31_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 30 : Channel 30 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH30_Pos         ( 30UL )                            /*!< Position of CH30 field. */
#define DPPIC_CHENSET_CH30_Msk         ( 0x1UL << DPPIC_CHENSET_CH30_Pos ) /*!< Bit mask of CH30 field. */
#define DPPIC_CHENSET_CH30_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH30_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH30_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 29 : Channel 29 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH29_Pos         ( 29UL )                            /*!< Position of CH29 field. */
#define DPPIC_CHENSET_CH29_Msk         ( 0x1UL << DPPIC_CHENSET_CH29_Pos ) /*!< Bit mask of CH29 field. */
#define DPPIC_CHENSET_CH29_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH29_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH29_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 28 : Channel 28 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH28_Pos         ( 28UL )                            /*!< Position of CH28 field. */
#define DPPIC_CHENSET_CH28_Msk         ( 0x1UL << DPPIC_CHENSET_CH28_Pos ) /*!< Bit mask of CH28 field. */
#define DPPIC_CHENSET_CH28_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH28_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH28_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 27 : Channel 27 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH27_Pos         ( 27UL )                            /*!< Position of CH27 field. */
#define DPPIC_CHENSET_CH27_Msk         ( 0x1UL << DPPIC_CHENSET_CH27_Pos ) /*!< Bit mask of CH27 field. */
#define DPPIC_CHENSET_CH27_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH27_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH27_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 26 : Channel 26 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH26_Pos         ( 26UL )                            /*!< Position of CH26 field. */
#define DPPIC_CHENSET_CH26_Msk         ( 0x1UL << DPPIC_CHENSET_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define DPPIC_CHENSET_CH26_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH26_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH26_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 25 : Channel 25 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH25_Pos         ( 25UL )                            /*!< Position of CH25 field. */
#define DPPIC_CHENSET_CH25_Msk         ( 0x1UL << DPPIC_CHENSET_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define DPPIC_CHENSET_CH25_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH25_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH25_Set         ( 1UL )                             /*!< Write: Enable channel */

