FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 10 : Channel 10 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH10_Pos         ( 10UL )                            /*!< Position of CH10 field. */
#define DPPIC_CHENSET_CH10_Msk         ( 0x1UL << DPPIC_CHENSET_CH10_Pos ) /*!< Bit mask of CH10 field. */
#define DPPIC_CHENSET_CH10_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH10_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH10_Set         ( 1UL )                             /*!< Write: Enable channel */

/* Bit 9 : Channel 9 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH9_Pos          ( 9UL )                            /*!< Position of CH9 field. */
#define DPPIC_CHENSET_CH9_Msk          ( 0x1UL << DPPIC_CHENSET_CH9_Pos ) /*!< Bit mask of CH9 field. */
#define DPPIC_CHENSET_CH9_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH9_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH9_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Bit 8 : Channel 8 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH8_Pos          ( 8UL )                            /*!< Position of CH8 field. */
#define DPPIC_CHENSET_CH8_Msk          ( 0x1UL << DPPIC_CHENSET_CH8_Pos ) /*!< Bit mask of CH8 field. */
#define DPPIC_CHENSET_CH8_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH8_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH8_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Bit 7 : Channel 7 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH7_Pos          ( 7UL )                            /*!< Position of CH7 field. */
#define DPPIC_CHENSET_CH7_Msk          ( 0x1UL << DPPIC_CHENSET_CH7_Pos ) /*!< Bit mask of CH7 field. */
#define DPPIC_CHENSET_CH7_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH7_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH7_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Bit 6 : Channel 6 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH6_Pos          ( 6UL )                            /*!< Position of CH6 field. */
#define DPPIC_CHENSET_CH6_Msk          ( 0x1UL << DPPIC_CHENSET_CH6_Pos ) /*!< Bit mask of CH6 field. */
#define DPPIC_CHENSET_CH6_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH6_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH6_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Bit 5 : Channel 5 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH5_Pos          ( 5UL )                            /*!< Position of CH5 field. */
#define DPPIC_CHENSET_CH5_Msk          ( 0x1UL << DPPIC_CHENSET_CH5_Pos ) /*!< Bit mask of CH5 field. */
#define DPPIC_CHENSET_CH5_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH5_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH5_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Bit 4 : Channel 4 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH4_Pos          ( 4UL )                            /*!< Position of CH4 field. */
#define DPPIC_CHENSET_CH4_Msk          ( 0x1UL << DPPIC_CHENSET_CH4_Pos ) /*!< Bit mask of CH4 field. */
#define DPPIC_CHENSET_CH4_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH4_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH4_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Bit 3 : Channel 3 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH3_Pos          ( 3UL )                            /*!< Position of CH3 field. */
#define DPPIC_CHENSET_CH3_Msk          ( 0x1UL << DPPIC_CHENSET_CH3_Pos ) /*!< Bit mask of CH3 field. */
#define DPPIC_CHENSET_CH3_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH3_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH3_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Bit 2 : Channel 2 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH2_Pos          ( 2UL )                            /*!< Position of CH2 field. */
#define DPPIC_CHENSET_CH2_Msk          ( 0x1UL << DPPIC_CHENSET_CH2_Pos ) /*!< Bit mask of CH2 field. */
#define DPPIC_CHENSET_CH2_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH2_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH2_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Bit 1 : Channel 1 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH1_Pos          ( 1UL )                            /*!< Position of CH1 field. */
#define DPPIC_CHENSET_CH1_Msk          ( 0x1UL << DPPIC_CHENSET_CH1_Pos ) /*!< Bit mask of CH1 field. */
#define DPPIC_CHENSET_CH1_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH1_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH1_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Bit 0 : Channel 0 enable set register. Writing 0 has no effect. */
#define DPPIC_CHENSET_CH0_Pos          ( 0UL )                            /*!< Position of CH0 field. */
#define DPPIC_CHENSET_CH0_Msk          ( 0x1UL << DPPIC_CHENSET_CH0_Pos ) /*!< Bit mask of CH0 field. */
#define DPPIC_CHENSET_CH0_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENSET_CH0_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENSET_CH0_Set          ( 1UL )                            /*!< Write: Enable channel */

/* Register: DPPIC_CHENCLR */
/* Description: Channel enable clear register */

/* Bit 31 : Channel 31 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH31_Pos         ( 31UL )                            /*!< Position of CH31 field. */
#define DPPIC_CHENCLR_CH31_Msk         ( 0x1UL << DPPIC_CHENCLR_CH31_Pos ) /*!< Bit mask of CH31 field. */
#define DPPIC_CHENCLR_CH31_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH31_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH31_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 30 : Channel 30 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH30_Pos         ( 30UL )                            /*!< Position of CH30 field. */
#define DPPIC_CHENCLR_CH30_Msk         ( 0x1UL << DPPIC_CHENCLR_CH30_Pos ) /*!< Bit mask of CH30 field. */
#define DPPIC_CHENCLR_CH30_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH30_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH30_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 29 : Channel 29 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH29_Pos         ( 29UL )                            /*!< Position of CH29 field. */
#define DPPIC_CHENCLR_CH29_Msk         ( 0x1UL << DPPIC_CHENCLR_CH29_Pos ) /*!< Bit mask of CH29 field. */
#define DPPIC_CHENCLR_CH29_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH29_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH29_Clear       ( 1UL )                             /*!< Write: Disable channel */

