FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 28 : Channel 28 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH28_Pos         ( 28UL )                            /*!< Position of CH28 field. */
#define DPPIC_CHENCLR_CH28_Msk         ( 0x1UL << DPPIC_CHENCLR_CH28_Pos ) /*!< Bit mask of CH28 field. */
#define DPPIC_CHENCLR_CH28_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH28_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH28_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 27 : Channel 27 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH27_Pos         ( 27UL )                            /*!< Position of CH27 field. */
#define DPPIC_CHENCLR_CH27_Msk         ( 0x1UL << DPPIC_CHENCLR_CH27_Pos ) /*!< Bit mask of CH27 field. */
#define DPPIC_CHENCLR_CH27_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH27_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH27_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 26 : Channel 26 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH26_Pos         ( 26UL )                            /*!< Position of CH26 field. */
#define DPPIC_CHENCLR_CH26_Msk         ( 0x1UL << DPPIC_CHENCLR_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define DPPIC_CHENCLR_CH26_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH26_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH26_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 25 : Channel 25 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH25_Pos         ( 25UL )                            /*!< Position of CH25 field. */
#define DPPIC_CHENCLR_CH25_Msk         ( 0x1UL << DPPIC_CHENCLR_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define DPPIC_CHENCLR_CH25_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH25_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH25_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 24 : Channel 24 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH24_Pos         ( 24UL )                            /*!< Position of CH24 field. */
#define DPPIC_CHENCLR_CH24_Msk         ( 0x1UL << DPPIC_CHENCLR_CH24_Pos ) /*!< Bit mask of CH24 field. */
#define DPPIC_CHENCLR_CH24_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH24_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH24_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 23 : Channel 23 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH23_Pos         ( 23UL )                            /*!< Position of CH23 field. */
#define DPPIC_CHENCLR_CH23_Msk         ( 0x1UL << DPPIC_CHENCLR_CH23_Pos ) /*!< Bit mask of CH23 field. */
#define DPPIC_CHENCLR_CH23_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH23_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH23_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 22 : Channel 22 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH22_Pos         ( 22UL )                            /*!< Position of CH22 field. */
#define DPPIC_CHENCLR_CH22_Msk         ( 0x1UL << DPPIC_CHENCLR_CH22_Pos ) /*!< Bit mask of CH22 field. */
#define DPPIC_CHENCLR_CH22_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH22_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH22_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 21 : Channel 21 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH21_Pos         ( 21UL )                            /*!< Position of CH21 field. */
#define DPPIC_CHENCLR_CH21_Msk         ( 0x1UL << DPPIC_CHENCLR_CH21_Pos ) /*!< Bit mask of CH21 field. */
#define DPPIC_CHENCLR_CH21_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH21_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH21_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 20 : Channel 20 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH20_Pos         ( 20UL )                            /*!< Position of CH20 field. */
#define DPPIC_CHENCLR_CH20_Msk         ( 0x1UL << DPPIC_CHENCLR_CH20_Pos ) /*!< Bit mask of CH20 field. */
#define DPPIC_CHENCLR_CH20_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH20_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH20_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 19 : Channel 19 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH19_Pos         ( 19UL )                            /*!< Position of CH19 field. */
#define DPPIC_CHENCLR_CH19_Msk         ( 0x1UL << DPPIC_CHENCLR_CH19_Pos ) /*!< Bit mask of CH19 field. */
#define DPPIC_CHENCLR_CH19_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH19_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH19_Clear       ( 1UL )                             /*!< Write: Disable channel */

/* Bit 18 : Channel 18 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH18_Pos         ( 18UL )                            /*!< Position of CH18 field. */
#define DPPIC_CHENCLR_CH18_Msk         ( 0x1UL << DPPIC_CHENCLR_CH18_Pos ) /*!< Bit mask of CH18 field. */
#define DPPIC_CHENCLR_CH18_Disabled    ( 0UL )                             /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH18_Enabled     ( 1UL )                             /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH18_Clear       ( 1UL )                             /*!< Write: Disable channel */

