FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 2 : Channel 2 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH2_Pos          ( 2UL )                            /*!< Position of CH2 field. */
#define DPPIC_CHENCLR_CH2_Msk          ( 0x1UL << DPPIC_CHENCLR_CH2_Pos ) /*!< Bit mask of CH2 field. */
#define DPPIC_CHENCLR_CH2_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH2_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH2_Clear        ( 1UL )                            /*!< Write: Disable channel */

/* Bit 1 : Channel 1 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH1_Pos          ( 1UL )                            /*!< Position of CH1 field. */
#define DPPIC_CHENCLR_CH1_Msk          ( 0x1UL << DPPIC_CHENCLR_CH1_Pos ) /*!< Bit mask of CH1 field. */
#define DPPIC_CHENCLR_CH1_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH1_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH1_Clear        ( 1UL )                            /*!< Write: Disable channel */

/* Bit 0 : Channel 0 enable clear register.  Writing 0 has no effect. */
#define DPPIC_CHENCLR_CH0_Pos          ( 0UL )                            /*!< Position of CH0 field. */
#define DPPIC_CHENCLR_CH0_Msk          ( 0x1UL << DPPIC_CHENCLR_CH0_Pos ) /*!< Bit mask of CH0 field. */
#define DPPIC_CHENCLR_CH0_Disabled     ( 0UL )                            /*!< Read: Channel disabled */
#define DPPIC_CHENCLR_CH0_Enabled      ( 1UL )                            /*!< Read: Channel enabled */
#define DPPIC_CHENCLR_CH0_Clear        ( 1UL )                            /*!< Write: Disable channel */

/* Register: DPPIC_CHG */
/* Description: Description collection: Channel group n Note: Writes to this register are ignored if either SUBSCRIBE_CHG[n].EN or SUBSCRIBE_CHG[n].DIS is enabled */

/* Bit 31 : Include or exclude channel 31 */
#define DPPIC_CHG_CH31_Pos         ( 31UL )                        /*!< Position of CH31 field. */
#define DPPIC_CHG_CH31_Msk         ( 0x1UL << DPPIC_CHG_CH31_Pos ) /*!< Bit mask of CH31 field. */
#define DPPIC_CHG_CH31_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH31_Included    ( 1UL )                         /*!< Include */

/* Bit 30 : Include or exclude channel 30 */
#define DPPIC_CHG_CH30_Pos         ( 30UL )                        /*!< Position of CH30 field. */
#define DPPIC_CHG_CH30_Msk         ( 0x1UL << DPPIC_CHG_CH30_Pos ) /*!< Bit mask of CH30 field. */
#define DPPIC_CHG_CH30_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH30_Included    ( 1UL )                         /*!< Include */

/* Bit 29 : Include or exclude channel 29 */
#define DPPIC_CHG_CH29_Pos         ( 29UL )                        /*!< Position of CH29 field. */
#define DPPIC_CHG_CH29_Msk         ( 0x1UL << DPPIC_CHG_CH29_Pos ) /*!< Bit mask of CH29 field. */
#define DPPIC_CHG_CH29_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH29_Included    ( 1UL )                         /*!< Include */

/* Bit 28 : Include or exclude channel 28 */
#define DPPIC_CHG_CH28_Pos         ( 28UL )                        /*!< Position of CH28 field. */
#define DPPIC_CHG_CH28_Msk         ( 0x1UL << DPPIC_CHG_CH28_Pos ) /*!< Bit mask of CH28 field. */
#define DPPIC_CHG_CH28_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH28_Included    ( 1UL )                         /*!< Include */

/* Bit 27 : Include or exclude channel 27 */
#define DPPIC_CHG_CH27_Pos         ( 27UL )                        /*!< Position of CH27 field. */
#define DPPIC_CHG_CH27_Msk         ( 0x1UL << DPPIC_CHG_CH27_Pos ) /*!< Bit mask of CH27 field. */
#define DPPIC_CHG_CH27_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH27_Included    ( 1UL )                         /*!< Include */

/* Bit 26 : Include or exclude channel 26 */
#define DPPIC_CHG_CH26_Pos         ( 26UL )                        /*!< Position of CH26 field. */
#define DPPIC_CHG_CH26_Msk         ( 0x1UL << DPPIC_CHG_CH26_Pos ) /*!< Bit mask of CH26 field. */
#define DPPIC_CHG_CH26_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH26_Included    ( 1UL )                         /*!< Include */

/* Bit 25 : Include or exclude channel 25 */
#define DPPIC_CHG_CH25_Pos         ( 25UL )                        /*!< Position of CH25 field. */
#define DPPIC_CHG_CH25_Msk         ( 0x1UL << DPPIC_CHG_CH25_Pos ) /*!< Bit mask of CH25 field. */
#define DPPIC_CHG_CH25_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH25_Included    ( 1UL )                         /*!< Include */

/* Bit 24 : Include or exclude channel 24 */
#define DPPIC_CHG_CH24_Pos         ( 24UL )                        /*!< Position of CH24 field. */
#define DPPIC_CHG_CH24_Msk         ( 0x1UL << DPPIC_CHG_CH24_Pos ) /*!< Bit mask of CH24 field. */
#define DPPIC_CHG_CH24_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH24_Included    ( 1UL )                         /*!< Include */

/* Bit 23 : Include or exclude channel 23 */
#define DPPIC_CHG_CH23_Pos         ( 23UL )                        /*!< Position of CH23 field. */
#define DPPIC_CHG_CH23_Msk         ( 0x1UL << DPPIC_CHG_CH23_Pos ) /*!< Bit mask of CH23 field. */
#define DPPIC_CHG_CH23_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH23_Included    ( 1UL )                         /*!< Include */

/* Bit 22 : Include or exclude channel 22 */
#define DPPIC_CHG_CH22_Pos         ( 22UL )                        /*!< Position of CH22 field. */
#define DPPIC_CHG_CH22_Msk         ( 0x1UL << DPPIC_CHG_CH22_Pos ) /*!< Bit mask of CH22 field. */
#define DPPIC_CHG_CH22_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH22_Included    ( 1UL )                         /*!< Include */

/* Bit 21 : Include or exclude channel 21 */
#define DPPIC_CHG_CH21_Pos         ( 21UL )                        /*!< Position of CH21 field. */
#define DPPIC_CHG_CH21_Msk         ( 0x1UL << DPPIC_CHG_CH21_Pos ) /*!< Bit mask of CH21 field. */
#define DPPIC_CHG_CH21_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH21_Included    ( 1UL )                         /*!< Include */

/* Bit 20 : Include or exclude channel 20 */
#define DPPIC_CHG_CH20_Pos         ( 20UL )                        /*!< Position of CH20 field. */
#define DPPIC_CHG_CH20_Msk         ( 0x1UL << DPPIC_CHG_CH20_Pos ) /*!< Bit mask of CH20 field. */
#define DPPIC_CHG_CH20_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH20_Included    ( 1UL )                         /*!< Include */

