FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 19 : Include or exclude channel 19 */
#define DPPIC_CHG_CH19_Pos         ( 19UL )                        /*!< Position of CH19 field. */
#define DPPIC_CHG_CH19_Msk         ( 0x1UL << DPPIC_CHG_CH19_Pos ) /*!< Bit mask of CH19 field. */
#define DPPIC_CHG_CH19_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH19_Included    ( 1UL )                         /*!< Include */

/* Bit 18 : Include or exclude channel 18 */
#define DPPIC_CHG_CH18_Pos         ( 18UL )                        /*!< Position of CH18 field. */
#define DPPIC_CHG_CH18_Msk         ( 0x1UL << DPPIC_CHG_CH18_Pos ) /*!< Bit mask of CH18 field. */
#define DPPIC_CHG_CH18_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH18_Included    ( 1UL )                         /*!< Include */

/* Bit 17 : Include or exclude channel 17 */
#define DPPIC_CHG_CH17_Pos         ( 17UL )                        /*!< Position of CH17 field. */
#define DPPIC_CHG_CH17_Msk         ( 0x1UL << DPPIC_CHG_CH17_Pos ) /*!< Bit mask of CH17 field. */
#define DPPIC_CHG_CH17_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH17_Included    ( 1UL )                         /*!< Include */

/* Bit 16 : Include or exclude channel 16 */
#define DPPIC_CHG_CH16_Pos         ( 16UL )                        /*!< Position of CH16 field. */
#define DPPIC_CHG_CH16_Msk         ( 0x1UL << DPPIC_CHG_CH16_Pos ) /*!< Bit mask of CH16 field. */
#define DPPIC_CHG_CH16_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH16_Included    ( 1UL )                         /*!< Include */

/* Bit 15 : Include or exclude channel 15 */
#define DPPIC_CHG_CH15_Pos         ( 15UL )                        /*!< Position of CH15 field. */
#define DPPIC_CHG_CH15_Msk         ( 0x1UL << DPPIC_CHG_CH15_Pos ) /*!< Bit mask of CH15 field. */
#define DPPIC_CHG_CH15_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH15_Included    ( 1UL )                         /*!< Include */

/* Bit 14 : Include or exclude channel 14 */
#define DPPIC_CHG_CH14_Pos         ( 14UL )                        /*!< Position of CH14 field. */
#define DPPIC_CHG_CH14_Msk         ( 0x1UL << DPPIC_CHG_CH14_Pos ) /*!< Bit mask of CH14 field. */
#define DPPIC_CHG_CH14_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH14_Included    ( 1UL )                         /*!< Include */

/* Bit 13 : Include or exclude channel 13 */
#define DPPIC_CHG_CH13_Pos         ( 13UL )                        /*!< Position of CH13 field. */
#define DPPIC_CHG_CH13_Msk         ( 0x1UL << DPPIC_CHG_CH13_Pos ) /*!< Bit mask of CH13 field. */
#define DPPIC_CHG_CH13_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH13_Included    ( 1UL )                         /*!< Include */

/* Bit 12 : Include or exclude channel 12 */
#define DPPIC_CHG_CH12_Pos         ( 12UL )                        /*!< Position of CH12 field. */
#define DPPIC_CHG_CH12_Msk         ( 0x1UL << DPPIC_CHG_CH12_Pos ) /*!< Bit mask of CH12 field. */
#define DPPIC_CHG_CH12_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH12_Included    ( 1UL )                         /*!< Include */

/* Bit 11 : Include or exclude channel 11 */
#define DPPIC_CHG_CH11_Pos         ( 11UL )                        /*!< Position of CH11 field. */
#define DPPIC_CHG_CH11_Msk         ( 0x1UL << DPPIC_CHG_CH11_Pos ) /*!< Bit mask of CH11 field. */
#define DPPIC_CHG_CH11_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH11_Included    ( 1UL )                         /*!< Include */

/* Bit 10 : Include or exclude channel 10 */
#define DPPIC_CHG_CH10_Pos         ( 10UL )                        /*!< Position of CH10 field. */
#define DPPIC_CHG_CH10_Msk         ( 0x1UL << DPPIC_CHG_CH10_Pos ) /*!< Bit mask of CH10 field. */
#define DPPIC_CHG_CH10_Excluded    ( 0UL )                         /*!< Exclude */
#define DPPIC_CHG_CH10_Included    ( 1UL )                         /*!< Include */

/* Bit 9 : Include or exclude channel 9 */
#define DPPIC_CHG_CH9_Pos          ( 9UL )                        /*!< Position of CH9 field. */
#define DPPIC_CHG_CH9_Msk          ( 0x1UL << DPPIC_CHG_CH9_Pos ) /*!< Bit mask of CH9 field. */
#define DPPIC_CHG_CH9_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH9_Included     ( 1UL )                        /*!< Include */

/* Bit 8 : Include or exclude channel 8 */
#define DPPIC_CHG_CH8_Pos          ( 8UL )                        /*!< Position of CH8 field. */
#define DPPIC_CHG_CH8_Msk          ( 0x1UL << DPPIC_CHG_CH8_Pos ) /*!< Bit mask of CH8 field. */
#define DPPIC_CHG_CH8_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH8_Included     ( 1UL )                        /*!< Include */

/* Bit 7 : Include or exclude channel 7 */
#define DPPIC_CHG_CH7_Pos          ( 7UL )                        /*!< Position of CH7 field. */
#define DPPIC_CHG_CH7_Msk          ( 0x1UL << DPPIC_CHG_CH7_Pos ) /*!< Bit mask of CH7 field. */
#define DPPIC_CHG_CH7_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH7_Included     ( 1UL )                        /*!< Include */

/* Bit 6 : Include or exclude channel 6 */
#define DPPIC_CHG_CH6_Pos          ( 6UL )                        /*!< Position of CH6 field. */
#define DPPIC_CHG_CH6_Msk          ( 0x1UL << DPPIC_CHG_CH6_Pos ) /*!< Bit mask of CH6 field. */
#define DPPIC_CHG_CH6_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH6_Included     ( 1UL )                        /*!< Include */

/* Bit 5 : Include or exclude channel 5 */
#define DPPIC_CHG_CH5_Pos          ( 5UL )                        /*!< Position of CH5 field. */
#define DPPIC_CHG_CH5_Msk          ( 0x1UL << DPPIC_CHG_CH5_Pos ) /*!< Bit mask of CH5 field. */
#define DPPIC_CHG_CH5_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH5_Included     ( 1UL )                        /*!< Include */

/* Bit 4 : Include or exclude channel 4 */
#define DPPIC_CHG_CH4_Pos          ( 4UL )                        /*!< Position of CH4 field. */
#define DPPIC_CHG_CH4_Msk          ( 0x1UL << DPPIC_CHG_CH4_Pos ) /*!< Bit mask of CH4 field. */
#define DPPIC_CHG_CH4_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH4_Included     ( 1UL )                        /*!< Include */

/* Bit 3 : Include or exclude channel 3 */
#define DPPIC_CHG_CH3_Pos          ( 3UL )                        /*!< Position of CH3 field. */
#define DPPIC_CHG_CH3_Msk          ( 0x1UL << DPPIC_CHG_CH3_Pos ) /*!< Bit mask of CH3 field. */
#define DPPIC_CHG_CH3_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH3_Included     ( 1UL )                        /*!< Include */

