FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 2 : Include or exclude channel 2 */
#define DPPIC_CHG_CH2_Pos          ( 2UL )                        /*!< Position of CH2 field. */
#define DPPIC_CHG_CH2_Msk          ( 0x1UL << DPPIC_CHG_CH2_Pos ) /*!< Bit mask of CH2 field. */
#define DPPIC_CHG_CH2_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH2_Included     ( 1UL )                        /*!< Include */

/* Bit 1 : Include or exclude channel 1 */
#define DPPIC_CHG_CH1_Pos          ( 1UL )                        /*!< Position of CH1 field. */
#define DPPIC_CHG_CH1_Msk          ( 0x1UL << DPPIC_CHG_CH1_Pos ) /*!< Bit mask of CH1 field. */
#define DPPIC_CHG_CH1_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH1_Included     ( 1UL )                        /*!< Include */

/* Bit 0 : Include or exclude channel 0 */
#define DPPIC_CHG_CH0_Pos          ( 0UL )                        /*!< Position of CH0 field. */
#define DPPIC_CHG_CH0_Msk          ( 0x1UL << DPPIC_CHG_CH0_Pos ) /*!< Bit mask of CH0 field. */
#define DPPIC_CHG_CH0_Excluded     ( 0UL )                        /*!< Exclude */
#define DPPIC_CHG_CH0_Included     ( 1UL )                        /*!< Include */


/* Peripheral: ECB */
/* Description: AES ECB Mode Encryption */

/* Register: ECB_TASKS_STARTECB */
/* Description: Start ECB block encrypt */

/* Bit 0 : Start ECB block encrypt */
#define ECB_TASKS_STARTECB_TASKS_STARTECB_Pos        ( 0UL )                                            /*!< Position of TASKS_STARTECB field. */
#define ECB_TASKS_STARTECB_TASKS_STARTECB_Msk        ( 0x1UL << ECB_TASKS_STARTECB_TASKS_STARTECB_Pos ) /*!< Bit mask of TASKS_STARTECB field. */
#define ECB_TASKS_STARTECB_TASKS_STARTECB_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: ECB_TASKS_STOPECB */
/* Description: Abort a possible executing ECB operation */

/* Bit 0 : Abort a possible executing ECB operation */
#define ECB_TASKS_STOPECB_TASKS_STOPECB_Pos        ( 0UL )                                          /*!< Position of TASKS_STOPECB field. */
#define ECB_TASKS_STOPECB_TASKS_STOPECB_Msk        ( 0x1UL << ECB_TASKS_STOPECB_TASKS_STOPECB_Pos ) /*!< Bit mask of TASKS_STOPECB field. */
#define ECB_TASKS_STOPECB_TASKS_STOPECB_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: ECB_SUBSCRIBE_STARTECB */
/* Description: Subscribe configuration for task STARTECB */

/* Bit 31 :   */
#define ECB_SUBSCRIBE_STARTECB_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define ECB_SUBSCRIBE_STARTECB_EN_Msk         ( 0x1UL << ECB_SUBSCRIBE_STARTECB_EN_Pos ) /*!< Bit mask of EN field. */
#define ECB_SUBSCRIBE_STARTECB_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define ECB_SUBSCRIBE_STARTECB_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STARTECB will subscribe to */
#define ECB_SUBSCRIBE_STARTECB_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define ECB_SUBSCRIBE_STARTECB_CHIDX_Msk      ( 0xFFUL << ECB_SUBSCRIBE_STARTECB_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: ECB_SUBSCRIBE_STOPECB */
/* Description: Subscribe configuration for task STOPECB */

/* Bit 31 :   */
#define ECB_SUBSCRIBE_STOPECB_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define ECB_SUBSCRIBE_STOPECB_EN_Msk         ( 0x1UL << ECB_SUBSCRIBE_STOPECB_EN_Pos ) /*!< Bit mask of EN field. */
#define ECB_SUBSCRIBE_STOPECB_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define ECB_SUBSCRIBE_STOPECB_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOPECB will subscribe to */
#define ECB_SUBSCRIBE_STOPECB_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define ECB_SUBSCRIBE_STOPECB_CHIDX_Msk      ( 0xFFUL << ECB_SUBSCRIBE_STOPECB_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: ECB_EVENTS_ENDECB */
/* Description: ECB block encrypt complete */

/* Bit 0 : ECB block encrypt complete */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Pos             ( 0UL )                                          /*!< Position of EVENTS_ENDECB field. */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Msk             ( 0x1UL << ECB_EVENTS_ENDECB_EVENTS_ENDECB_Pos ) /*!< Bit mask of EVENTS_ENDECB field. */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define ECB_EVENTS_ENDECB_EVENTS_ENDECB_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: ECB_EVENTS_ERRORECB */
/* Description: ECB block encrypt aborted because of a STOPECB task or due to an error */

/* Bit 0 : ECB block encrypt aborted because of a STOPECB task or due to an error */
#define ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_Pos             ( 0UL )                                              /*!< Position of EVENTS_ERRORECB field. */
#define ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_Msk             ( 0x1UL << ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_Pos ) /*!< Bit mask of EVENTS_ERRORECB field. */
#define ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define ECB_EVENTS_ERRORECB_EVENTS_ERRORECB_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: ECB_PUBLISH_ENDECB */
/* Description: Publish configuration for event ENDECB */

/* Bit 31 :   */
#define ECB_PUBLISH_ENDECB_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define ECB_PUBLISH_ENDECB_EN_Msk         ( 0x1UL << ECB_PUBLISH_ENDECB_EN_Pos ) /*!< Bit mask of EN field. */
#define ECB_PUBLISH_ENDECB_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define ECB_PUBLISH_ENDECB_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDECB will publish to. */
#define ECB_PUBLISH_ENDECB_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define ECB_PUBLISH_ENDECB_CHIDX_Msk      ( 0xFFUL << ECB_PUBLISH_ENDECB_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: ECB_PUBLISH_ERRORECB */
/* Description: Publish configuration for event ERRORECB */

/* Bit 31 :   */
#define ECB_PUBLISH_ERRORECB_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define ECB_PUBLISH_ERRORECB_EN_Msk         ( 0x1UL << ECB_PUBLISH_ERRORECB_EN_Pos ) /*!< Bit mask of EN field. */
#define ECB_PUBLISH_ERRORECB_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define ECB_PUBLISH_ERRORECB_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ERRORECB will publish to. */
#define ECB_PUBLISH_ERRORECB_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define ECB_PUBLISH_ERRORECB_CHIDX_Msk      ( 0xFFUL << ECB_PUBLISH_ERRORECB_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

