FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: ECB_INTENSET */
/* Description: Enable interrupt */

/* Bit 1 : Write '1' to enable interrupt for event ERRORECB */
#define ECB_INTENSET_ERRORECB_Pos         ( 1UL )                                /*!< Position of ERRORECB field. */
#define ECB_INTENSET_ERRORECB_Msk         ( 0x1UL << ECB_INTENSET_ERRORECB_Pos ) /*!< Bit mask of ERRORECB field. */
#define ECB_INTENSET_ERRORECB_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define ECB_INTENSET_ERRORECB_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define ECB_INTENSET_ERRORECB_Set         ( 1UL )                                /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event ENDECB */
#define ECB_INTENSET_ENDECB_Pos           ( 0UL )                              /*!< Position of ENDECB field. */
#define ECB_INTENSET_ENDECB_Msk           ( 0x1UL << ECB_INTENSET_ENDECB_Pos ) /*!< Bit mask of ENDECB field. */
#define ECB_INTENSET_ENDECB_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define ECB_INTENSET_ENDECB_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define ECB_INTENSET_ENDECB_Set           ( 1UL )                              /*!< Enable */

/* Register: ECB_INTENCLR */
/* Description: Disable interrupt */

/* Bit 1 : Write '1' to disable interrupt for event ERRORECB */
#define ECB_INTENCLR_ERRORECB_Pos         ( 1UL )                                /*!< Position of ERRORECB field. */
#define ECB_INTENCLR_ERRORECB_Msk         ( 0x1UL << ECB_INTENCLR_ERRORECB_Pos ) /*!< Bit mask of ERRORECB field. */
#define ECB_INTENCLR_ERRORECB_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define ECB_INTENCLR_ERRORECB_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define ECB_INTENCLR_ERRORECB_Clear       ( 1UL )                                /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event ENDECB */
#define ECB_INTENCLR_ENDECB_Pos           ( 0UL )                              /*!< Position of ENDECB field. */
#define ECB_INTENCLR_ENDECB_Msk           ( 0x1UL << ECB_INTENCLR_ENDECB_Pos ) /*!< Bit mask of ENDECB field. */
#define ECB_INTENCLR_ENDECB_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define ECB_INTENCLR_ENDECB_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define ECB_INTENCLR_ENDECB_Clear         ( 1UL )                              /*!< Disable */

/* Register: ECB_ECBDATAPTR */
/* Description: ECB block encrypt memory pointers */

/* Bits 31..0 : Pointer to the ECB data structure (see Table 1 ECB data structure overview) */
#define ECB_ECBDATAPTR_ECBDATAPTR_Pos    ( 0UL )                                           /*!< Position of ECBDATAPTR field. */
#define ECB_ECBDATAPTR_ECBDATAPTR_Msk    ( 0xFFFFFFFFUL << ECB_ECBDATAPTR_ECBDATAPTR_Pos ) /*!< Bit mask of ECBDATAPTR field. */


/* Peripheral: EGU */
/* Description: Event generator unit */

/* Register: EGU_TASKS_TRIGGER */
/* Description: Description collection: Trigger n for triggering the corresponding TRIGGERED[n] event */

/* Bit 0 : Trigger n for triggering the corresponding TRIGGERED[n] event */
#define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Pos        ( 0UL )                                          /*!< Position of TASKS_TRIGGER field. */
#define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Msk        ( 0x1UL << EGU_TASKS_TRIGGER_TASKS_TRIGGER_Pos ) /*!< Bit mask of TASKS_TRIGGER field. */
#define EGU_TASKS_TRIGGER_TASKS_TRIGGER_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: EGU_SUBSCRIBE_TRIGGER */
/* Description: Description collection: Subscribe configuration for task TRIGGER[n] */

/* Bit 31 :   */
#define EGU_SUBSCRIBE_TRIGGER_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define EGU_SUBSCRIBE_TRIGGER_EN_Msk         ( 0x1UL << EGU_SUBSCRIBE_TRIGGER_EN_Pos ) /*!< Bit mask of EN field. */
#define EGU_SUBSCRIBE_TRIGGER_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define EGU_SUBSCRIBE_TRIGGER_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task TRIGGER[n] will subscribe to */
#define EGU_SUBSCRIBE_TRIGGER_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define EGU_SUBSCRIBE_TRIGGER_CHIDX_Msk      ( 0xFFUL << EGU_SUBSCRIBE_TRIGGER_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: EGU_EVENTS_TRIGGERED */
/* Description: Description collection: Event number n generated by triggering the corresponding TRIGGER[n] task */

/* Bit 0 : Event number n generated by triggering the corresponding TRIGGER[n] task */
#define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos             ( 0UL )                                                /*!< Position of EVENTS_TRIGGERED field. */
#define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Msk             ( 0x1UL << EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos ) /*!< Bit mask of EVENTS_TRIGGERED field. */
#define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_NotGenerated    ( 0UL )                                                /*!< Event not generated */
#define EGU_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Generated       ( 1UL )                                                /*!< Event generated */

/* Register: EGU_PUBLISH_TRIGGERED */
/* Description: Description collection: Publish configuration for event TRIGGERED[n] */

/* Bit 31 :   */
#define EGU_PUBLISH_TRIGGERED_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define EGU_PUBLISH_TRIGGERED_EN_Msk         ( 0x1UL << EGU_PUBLISH_TRIGGERED_EN_Pos ) /*!< Bit mask of EN field. */
#define EGU_PUBLISH_TRIGGERED_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define EGU_PUBLISH_TRIGGERED_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

