FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 3 : Enable or disable interrupt for event TRIGGERED[3] */
#define EGU_INTEN_TRIGGERED3_Pos          ( 3UL )                               /*!< Position of TRIGGERED3 field. */
#define EGU_INTEN_TRIGGERED3_Msk          ( 0x1UL << EGU_INTEN_TRIGGERED3_Pos ) /*!< Bit mask of TRIGGERED3 field. */
#define EGU_INTEN_TRIGGERED3_Disabled     ( 0UL )                               /*!< Disable */
#define EGU_INTEN_TRIGGERED3_Enabled      ( 1UL )                               /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event TRIGGERED[2] */
#define EGU_INTEN_TRIGGERED2_Pos          ( 2UL )                               /*!< Position of TRIGGERED2 field. */
#define EGU_INTEN_TRIGGERED2_Msk          ( 0x1UL << EGU_INTEN_TRIGGERED2_Pos ) /*!< Bit mask of TRIGGERED2 field. */
#define EGU_INTEN_TRIGGERED2_Disabled     ( 0UL )                               /*!< Disable */
#define EGU_INTEN_TRIGGERED2_Enabled      ( 1UL )                               /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event TRIGGERED[1] */
#define EGU_INTEN_TRIGGERED1_Pos          ( 1UL )                               /*!< Position of TRIGGERED1 field. */
#define EGU_INTEN_TRIGGERED1_Msk          ( 0x1UL << EGU_INTEN_TRIGGERED1_Pos ) /*!< Bit mask of TRIGGERED1 field. */
#define EGU_INTEN_TRIGGERED1_Disabled     ( 0UL )                               /*!< Disable */
#define EGU_INTEN_TRIGGERED1_Enabled      ( 1UL )                               /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event TRIGGERED[0] */
#define EGU_INTEN_TRIGGERED0_Pos          ( 0UL )                               /*!< Position of TRIGGERED0 field. */
#define EGU_INTEN_TRIGGERED0_Msk          ( 0x1UL << EGU_INTEN_TRIGGERED0_Pos ) /*!< Bit mask of TRIGGERED0 field. */
#define EGU_INTEN_TRIGGERED0_Disabled     ( 0UL )                               /*!< Disable */
#define EGU_INTEN_TRIGGERED0_Enabled      ( 1UL )                               /*!< Enable */

/* Register: EGU_INTENSET */
/* Description: Enable interrupt */

/* Bit 15 : Write '1' to enable interrupt for event TRIGGERED[15] */
#define EGU_INTENSET_TRIGGERED15_Pos         ( 15UL )                                  /*!< Position of TRIGGERED15 field. */
#define EGU_INTENSET_TRIGGERED15_Msk         ( 0x1UL << EGU_INTENSET_TRIGGERED15_Pos ) /*!< Bit mask of TRIGGERED15 field. */
#define EGU_INTENSET_TRIGGERED15_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED15_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED15_Set         ( 1UL )                                   /*!< Enable */

/* Bit 14 : Write '1' to enable interrupt for event TRIGGERED[14] */
#define EGU_INTENSET_TRIGGERED14_Pos         ( 14UL )                                  /*!< Position of TRIGGERED14 field. */
#define EGU_INTENSET_TRIGGERED14_Msk         ( 0x1UL << EGU_INTENSET_TRIGGERED14_Pos ) /*!< Bit mask of TRIGGERED14 field. */
#define EGU_INTENSET_TRIGGERED14_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED14_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED14_Set         ( 1UL )                                   /*!< Enable */

/* Bit 13 : Write '1' to enable interrupt for event TRIGGERED[13] */
#define EGU_INTENSET_TRIGGERED13_Pos         ( 13UL )                                  /*!< Position of TRIGGERED13 field. */
#define EGU_INTENSET_TRIGGERED13_Msk         ( 0x1UL << EGU_INTENSET_TRIGGERED13_Pos ) /*!< Bit mask of TRIGGERED13 field. */
#define EGU_INTENSET_TRIGGERED13_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED13_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED13_Set         ( 1UL )                                   /*!< Enable */

/* Bit 12 : Write '1' to enable interrupt for event TRIGGERED[12] */
#define EGU_INTENSET_TRIGGERED12_Pos         ( 12UL )                                  /*!< Position of TRIGGERED12 field. */
#define EGU_INTENSET_TRIGGERED12_Msk         ( 0x1UL << EGU_INTENSET_TRIGGERED12_Pos ) /*!< Bit mask of TRIGGERED12 field. */
#define EGU_INTENSET_TRIGGERED12_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED12_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED12_Set         ( 1UL )                                   /*!< Enable */

/* Bit 11 : Write '1' to enable interrupt for event TRIGGERED[11] */
#define EGU_INTENSET_TRIGGERED11_Pos         ( 11UL )                                  /*!< Position of TRIGGERED11 field. */
#define EGU_INTENSET_TRIGGERED11_Msk         ( 0x1UL << EGU_INTENSET_TRIGGERED11_Pos ) /*!< Bit mask of TRIGGERED11 field. */
#define EGU_INTENSET_TRIGGERED11_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED11_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED11_Set         ( 1UL )                                   /*!< Enable */

/* Bit 10 : Write '1' to enable interrupt for event TRIGGERED[10] */
#define EGU_INTENSET_TRIGGERED10_Pos         ( 10UL )                                  /*!< Position of TRIGGERED10 field. */
#define EGU_INTENSET_TRIGGERED10_Msk         ( 0x1UL << EGU_INTENSET_TRIGGERED10_Pos ) /*!< Bit mask of TRIGGERED10 field. */
#define EGU_INTENSET_TRIGGERED10_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED10_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED10_Set         ( 1UL )                                   /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event TRIGGERED[9] */
#define EGU_INTENSET_TRIGGERED9_Pos          ( 9UL )                                  /*!< Position of TRIGGERED9 field. */
#define EGU_INTENSET_TRIGGERED9_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED9_Pos ) /*!< Bit mask of TRIGGERED9 field. */
#define EGU_INTENSET_TRIGGERED9_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED9_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED9_Set          ( 1UL )                                  /*!< Enable */

/* Bit 8 : Write '1' to enable interrupt for event TRIGGERED[8] */
#define EGU_INTENSET_TRIGGERED8_Pos          ( 8UL )                                  /*!< Position of TRIGGERED8 field. */
#define EGU_INTENSET_TRIGGERED8_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED8_Pos ) /*!< Bit mask of TRIGGERED8 field. */
#define EGU_INTENSET_TRIGGERED8_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED8_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED8_Set          ( 1UL )                                  /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event TRIGGERED[7] */
#define EGU_INTENSET_TRIGGERED7_Pos          ( 7UL )                                  /*!< Position of TRIGGERED7 field. */
#define EGU_INTENSET_TRIGGERED7_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED7_Pos ) /*!< Bit mask of TRIGGERED7 field. */
#define EGU_INTENSET_TRIGGERED7_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED7_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED7_Set          ( 1UL )                                  /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event TRIGGERED[6] */
#define EGU_INTENSET_TRIGGERED6_Pos          ( 6UL )                                  /*!< Position of TRIGGERED6 field. */
#define EGU_INTENSET_TRIGGERED6_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED6_Pos ) /*!< Bit mask of TRIGGERED6 field. */
#define EGU_INTENSET_TRIGGERED6_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED6_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED6_Set          ( 1UL )                                  /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event TRIGGERED[5] */
#define EGU_INTENSET_TRIGGERED5_Pos          ( 5UL )                                  /*!< Position of TRIGGERED5 field. */
#define EGU_INTENSET_TRIGGERED5_Msk          ( 0x1UL << EGU_INTENSET_TRIGGERED5_Pos ) /*!< Bit mask of TRIGGERED5 field. */
#define EGU_INTENSET_TRIGGERED5_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENSET_TRIGGERED5_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENSET_TRIGGERED5_Set          ( 1UL )                                  /*!< Enable */

