FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 7 : Write '1' to disable interrupt for event TRIGGERED[7] */
#define EGU_INTENCLR_TRIGGERED7_Pos          ( 7UL )                                  /*!< Position of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED7_Pos ) /*!< Bit mask of TRIGGERED7 field. */
#define EGU_INTENCLR_TRIGGERED7_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED7_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED7_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event TRIGGERED[6] */
#define EGU_INTENCLR_TRIGGERED6_Pos          ( 6UL )                                  /*!< Position of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED6_Pos ) /*!< Bit mask of TRIGGERED6 field. */
#define EGU_INTENCLR_TRIGGERED6_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED6_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED6_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event TRIGGERED[5] */
#define EGU_INTENCLR_TRIGGERED5_Pos          ( 5UL )                                  /*!< Position of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED5_Pos ) /*!< Bit mask of TRIGGERED5 field. */
#define EGU_INTENCLR_TRIGGERED5_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED5_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED5_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event TRIGGERED[4] */
#define EGU_INTENCLR_TRIGGERED4_Pos          ( 4UL )                                  /*!< Position of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED4_Pos ) /*!< Bit mask of TRIGGERED4 field. */
#define EGU_INTENCLR_TRIGGERED4_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED4_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED4_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event TRIGGERED[3] */
#define EGU_INTENCLR_TRIGGERED3_Pos          ( 3UL )                                  /*!< Position of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED3_Pos ) /*!< Bit mask of TRIGGERED3 field. */
#define EGU_INTENCLR_TRIGGERED3_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED3_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED3_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event TRIGGERED[2] */
#define EGU_INTENCLR_TRIGGERED2_Pos          ( 2UL )                                  /*!< Position of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED2_Pos ) /*!< Bit mask of TRIGGERED2 field. */
#define EGU_INTENCLR_TRIGGERED2_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED2_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED2_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event TRIGGERED[1] */
#define EGU_INTENCLR_TRIGGERED1_Pos          ( 1UL )                                  /*!< Position of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED1_Pos ) /*!< Bit mask of TRIGGERED1 field. */
#define EGU_INTENCLR_TRIGGERED1_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED1_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED1_Clear        ( 1UL )                                  /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event TRIGGERED[0] */
#define EGU_INTENCLR_TRIGGERED0_Pos          ( 0UL )                                  /*!< Position of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Msk          ( 0x1UL << EGU_INTENCLR_TRIGGERED0_Pos ) /*!< Bit mask of TRIGGERED0 field. */
#define EGU_INTENCLR_TRIGGERED0_Disabled     ( 0UL )                                  /*!< Read: Disabled */
#define EGU_INTENCLR_TRIGGERED0_Enabled      ( 1UL )                                  /*!< Read: Enabled */
#define EGU_INTENCLR_TRIGGERED0_Clear        ( 1UL )                                  /*!< Disable */


/* Peripheral: FICR */
/* Description: Factory Information Configuration Registers */

/* Register: FICR_INFO_CONFIGID */
/* Description: Configuration identifier */

/* Bits 15..0 : Identification number for the HW */
#define FICR_INFO_CONFIGID_HWID_Pos    ( 0UL )                                     /*!< Position of HWID field. */
#define FICR_INFO_CONFIGID_HWID_Msk    ( 0xFFFFUL << FICR_INFO_CONFIGID_HWID_Pos ) /*!< Bit mask of HWID field. */

/* Register: FICR_INFO_DEVICEID */
/* Description: Description collection: Device identifier */

/* Bits 31..0 : 64 bit unique device identifier */
#define FICR_INFO_DEVICEID_DEVICEID_Pos    ( 0UL )                                             /*!< Position of DEVICEID field. */
#define FICR_INFO_DEVICEID_DEVICEID_Msk    ( 0xFFFFFFFFUL << FICR_INFO_DEVICEID_DEVICEID_Pos ) /*!< Bit mask of DEVICEID field. */

/* Register: FICR_INFO_PART */
/* Description: Part code */

/* Bits 31..0 : Part code */
#define FICR_INFO_PART_PART_Pos            ( 0UL )                                     /*!< Position of PART field. */
#define FICR_INFO_PART_PART_Msk            ( 0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos ) /*!< Bit mask of PART field. */
#define FICR_INFO_PART_PART_N5340          ( 0x5340UL )                                /*!< nRF5340 */
#define FICR_INFO_PART_PART_Unspecified    ( 0xFFFFFFFFUL )                            /*!< Unspecified */

