FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: FICR_INFO_VARIANT */
/* Description: Part Variant, Hardware version and Production configuration */

/* Bits 31..0 : Part Variant, Hardware version and Production configuration, encoded as ASCII */
#define FICR_INFO_VARIANT_VARIANT_Pos            ( 0UL )                                           /*!< Position of VARIANT field. */
#define FICR_INFO_VARIANT_VARIANT_Msk            ( 0xFFFFFFFFUL << FICR_INFO_VARIANT_VARIANT_Pos ) /*!< Bit mask of VARIANT field. */
#define FICR_INFO_VARIANT_VARIANT_CLAA           ( 0x434C4141UL )                                  /*!< CLAA */
#define FICR_INFO_VARIANT_VARIANT_QKAA           ( 0x514B4141UL )                                  /*!< QKAA */
#define FICR_INFO_VARIANT_VARIANT_Unspecified    ( 0xFFFFFFFFUL )                                  /*!< Unspecified */

/* Register: FICR_INFO_PACKAGE */
/* Description: Package option */

/* Bits 31..0 : Package option */
#define FICR_INFO_PACKAGE_PACKAGE_Pos            ( 0UL )                                           /*!< Position of PACKAGE field. */
#define FICR_INFO_PACKAGE_PACKAGE_Msk            ( 0xFFFFFFFFUL << FICR_INFO_PACKAGE_PACKAGE_Pos ) /*!< Bit mask of PACKAGE field. */
#define FICR_INFO_PACKAGE_PACKAGE_QK             ( 0x2000UL )                                      /*!< QKxx - 94-pin aQFN */
#define FICR_INFO_PACKAGE_PACKAGE_CL             ( 0x2005UL )                                      /*!< CLxx - WLCSP */
#define FICR_INFO_PACKAGE_PACKAGE_Unspecified    ( 0xFFFFFFFFUL )                                  /*!< Unspecified */

/* Register: FICR_INFO_RAM */
/* Description: RAM variant */

/* Bits 31..0 : RAM variant */
#define FICR_INFO_RAM_RAM_Pos            ( 0UL )                                   /*!< Position of RAM field. */
#define FICR_INFO_RAM_RAM_Msk            ( 0xFFFFFFFFUL << FICR_INFO_RAM_RAM_Pos ) /*!< Bit mask of RAM field. */
#define FICR_INFO_RAM_RAM_K16            ( 0x10UL )                                /*!< 16 kByte RAM */
#define FICR_INFO_RAM_RAM_K32            ( 0x20UL )                                /*!< 32 kByte RAM */
#define FICR_INFO_RAM_RAM_K64            ( 0x40UL )                                /*!< 64 kByte RAM */
#define FICR_INFO_RAM_RAM_K128           ( 0x80UL )                                /*!< 128 kByte RAM */
#define FICR_INFO_RAM_RAM_K256           ( 0x100UL )                               /*!< 256 kByte RAM */
#define FICR_INFO_RAM_RAM_K512           ( 0x200UL )                               /*!< 512 kByte RAM */
#define FICR_INFO_RAM_RAM_Unspecified    ( 0xFFFFFFFFUL )                          /*!< Unspecified */

/* Register: FICR_INFO_FLASH */
/* Description: Flash variant */

/* Bits 31..0 : Flash variant */
#define FICR_INFO_FLASH_FLASH_Pos            ( 0UL )                                       /*!< Position of FLASH field. */
#define FICR_INFO_FLASH_FLASH_Msk            ( 0xFFFFFFFFUL << FICR_INFO_FLASH_FLASH_Pos ) /*!< Bit mask of FLASH field. */
#define FICR_INFO_FLASH_FLASH_K128           ( 0x80UL )                                    /*!< 128 kByte FLASH */
#define FICR_INFO_FLASH_FLASH_K256           ( 0x100UL )                                   /*!< 256 kByte FLASH */
#define FICR_INFO_FLASH_FLASH_K512           ( 0x200UL )                                   /*!< 512 kByte FLASH */
#define FICR_INFO_FLASH_FLASH_K1024          ( 0x400UL )                                   /*!< 1 MByte FLASH */
#define FICR_INFO_FLASH_FLASH_K2048          ( 0x800UL )                                   /*!< 2 MByte FLASH */
#define FICR_INFO_FLASH_FLASH_Unspecified    ( 0xFFFFFFFFUL )                              /*!< Unspecified */

/* Register: FICR_INFO_CODEPAGESIZE */
/* Description: Code memory page size in bytes */

/* Bits 31..0 : Code memory page size in bytes */
#define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Pos      ( 0UL )                                                     /*!< Position of CODEPAGESIZE field. */
#define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Msk      ( 0xFFFFFFFFUL << FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_Pos ) /*!< Bit mask of CODEPAGESIZE field. */
#define FICR_INFO_CODEPAGESIZE_CODEPAGESIZE_K2048    ( 0x800UL )                                                 /*!< 2 kByte */

/* Register: FICR_INFO_CODESIZE */
/* Description: Code memory size */

/* Bits 31..0 : Code memory size in number of pages */
#define FICR_INFO_CODESIZE_CODESIZE_Pos     ( 0UL )                                             /*!< Position of CODESIZE field. */
#define FICR_INFO_CODESIZE_CODESIZE_Msk     ( 0xFFFFFFFFUL << FICR_INFO_CODESIZE_CODESIZE_Pos ) /*!< Bit mask of CODESIZE field. */
#define FICR_INFO_CODESIZE_CODESIZE_P128    ( 128UL )                                           /*!< 128 pages */

/* Register: FICR_INFO_DEVICETYPE */
/* Description: Device type */

/* Bits 31..0 : Device type */
#define FICR_INFO_DEVICETYPE_DEVICETYPE_Pos     ( 0UL )                                                 /*!< Position of DEVICETYPE field. */
#define FICR_INFO_DEVICETYPE_DEVICETYPE_Msk     ( 0xFFFFFFFFUL << FICR_INFO_DEVICETYPE_DEVICETYPE_Pos ) /*!< Bit mask of DEVICETYPE field. */
#define FICR_INFO_DEVICETYPE_DEVICETYPE_Die     ( 0x0000000UL )                                         /*!< Device is an physical DIE */
#define FICR_INFO_DEVICETYPE_DEVICETYPE_FPGA    ( 0xFFFFFFFFUL )                                        /*!< Device is an FPGA */

/* Register: FICR_ER */
/* Description: Description collection: Encryption Root, word n */

/* Bits 31..0 : Encryption Root, word n */
#define FICR_ER_ER_Pos    ( 0UL )                            /*!< Position of ER field. */
#define FICR_ER_ER_Msk    ( 0xFFFFFFFFUL << FICR_ER_ER_Pos ) /*!< Bit mask of ER field. */

/* Register: FICR_IR */
/* Description: Description collection: Identity Root, word n */

/* Bits 31..0 : Identity Root, word n */
#define FICR_IR_IR_Pos    ( 0UL )                            /*!< Position of IR field. */
#define FICR_IR_IR_Msk    ( 0xFFFFFFFFUL << FICR_IR_IR_Pos ) /*!< Bit mask of IR field. */

/* Register: FICR_DEVICEADDRTYPE */
/* Description: Device address type */

/* Bit 0 : Device address type */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos       ( 0UL )                                             /*!< Position of DEVICEADDRTYPE field. */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Msk       ( 0x1UL << FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Pos ) /*!< Bit mask of DEVICEADDRTYPE field. */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Public    ( 0UL )                                             /*!< Public address */
#define FICR_DEVICEADDRTYPE_DEVICEADDRTYPE_Random    ( 1UL )                                             /*!< Random address */

/* Register: FICR_DEVICEADDR */
/* Description: Description collection: Device address n */

/* Bits 31..0 : 48 bit device address */
#define FICR_DEVICEADDR_DEVICEADDR_Pos    ( 0UL )                                            /*!< Position of DEVICEADDR field. */
#define FICR_DEVICEADDR_DEVICEADDR_Msk    ( 0xFFFFFFFFUL << FICR_DEVICEADDR_DEVICEADDR_Pos ) /*!< Bit mask of DEVICEADDR field. */

/* Register: FICR_TRIMCNF_ADDR */
/* Description: Description cluster: Address */

