FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 31..0 : Address */
#define FICR_TRIMCNF_ADDR_Address_Pos    ( 0UL )                                           /*!< Position of Address field. */
#define FICR_TRIMCNF_ADDR_Address_Msk    ( 0xFFFFFFFFUL << FICR_TRIMCNF_ADDR_Address_Pos ) /*!< Bit mask of Address field. */

/* Register: FICR_TRIMCNF_DATA */
/* Description: Description cluster: Data */

/* Bits 31..0 : Data */
#define FICR_TRIMCNF_DATA_Data_Pos    ( 0UL )                                        /*!< Position of Data field. */
#define FICR_TRIMCNF_DATA_Data_Msk    ( 0xFFFFFFFFUL << FICR_TRIMCNF_DATA_Data_Pos ) /*!< Bit mask of Data field. */


/* Peripheral: GPIOTE */
/* Description: GPIO Tasks and Events */

/* Register: GPIOTE_TASKS_OUT */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is configured in CONFIG[n].POLARITY. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Pos        ( 0UL )                                     /*!< Position of TASKS_OUT field. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Msk        ( 0x1UL << GPIOTE_TASKS_OUT_TASKS_OUT_Pos ) /*!< Bit mask of TASKS_OUT field. */
#define GPIOTE_TASKS_OUT_TASKS_OUT_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: GPIOTE_TASKS_SET */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it high. */
#define GPIOTE_TASKS_SET_TASKS_SET_Pos        ( 0UL )                                     /*!< Position of TASKS_SET field. */
#define GPIOTE_TASKS_SET_TASKS_SET_Msk        ( 0x1UL << GPIOTE_TASKS_SET_TASKS_SET_Pos ) /*!< Bit mask of TASKS_SET field. */
#define GPIOTE_TASKS_SET_TASKS_SET_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: GPIOTE_TASKS_CLR */
/* Description: Description collection: Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */

/* Bit 0 : Task for writing to pin specified in CONFIG[n].PSEL. Action on pin is to set it low. */
#define GPIOTE_TASKS_CLR_TASKS_CLR_Pos        ( 0UL )                                     /*!< Position of TASKS_CLR field. */
#define GPIOTE_TASKS_CLR_TASKS_CLR_Msk        ( 0x1UL << GPIOTE_TASKS_CLR_TASKS_CLR_Pos ) /*!< Bit mask of TASKS_CLR field. */
#define GPIOTE_TASKS_CLR_TASKS_CLR_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: GPIOTE_SUBSCRIBE_OUT */
/* Description: Description collection: Subscribe configuration for task OUT[n] */

/* Bit 31 :   */
#define GPIOTE_SUBSCRIBE_OUT_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define GPIOTE_SUBSCRIBE_OUT_EN_Msk         ( 0x1UL << GPIOTE_SUBSCRIBE_OUT_EN_Pos ) /*!< Bit mask of EN field. */
#define GPIOTE_SUBSCRIBE_OUT_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define GPIOTE_SUBSCRIBE_OUT_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task OUT[n] will subscribe to */
#define GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define GPIOTE_SUBSCRIBE_OUT_CHIDX_Msk      ( 0xFFUL << GPIOTE_SUBSCRIBE_OUT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: GPIOTE_SUBSCRIBE_SET */
/* Description: Description collection: Subscribe configuration for task SET[n] */

/* Bit 31 :   */
#define GPIOTE_SUBSCRIBE_SET_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define GPIOTE_SUBSCRIBE_SET_EN_Msk         ( 0x1UL << GPIOTE_SUBSCRIBE_SET_EN_Pos ) /*!< Bit mask of EN field. */
#define GPIOTE_SUBSCRIBE_SET_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define GPIOTE_SUBSCRIBE_SET_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SET[n] will subscribe to */
#define GPIOTE_SUBSCRIBE_SET_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define GPIOTE_SUBSCRIBE_SET_CHIDX_Msk      ( 0xFFUL << GPIOTE_SUBSCRIBE_SET_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: GPIOTE_SUBSCRIBE_CLR */
/* Description: Description collection: Subscribe configuration for task CLR[n] */

/* Bit 31 :   */
#define GPIOTE_SUBSCRIBE_CLR_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define GPIOTE_SUBSCRIBE_CLR_EN_Msk         ( 0x1UL << GPIOTE_SUBSCRIBE_CLR_EN_Pos ) /*!< Bit mask of EN field. */
#define GPIOTE_SUBSCRIBE_CLR_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define GPIOTE_SUBSCRIBE_CLR_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CLR[n] will subscribe to */
#define GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define GPIOTE_SUBSCRIBE_CLR_CHIDX_Msk      ( 0xFFUL << GPIOTE_SUBSCRIBE_CLR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: GPIOTE_EVENTS_IN */
/* Description: Description collection: Event generated from pin specified in CONFIG[n].PSEL */

/* Bit 0 : Event generated from pin specified in CONFIG[n].PSEL */
#define GPIOTE_EVENTS_IN_EVENTS_IN_Pos             ( 0UL )                                     /*!< Position of EVENTS_IN field. */
#define GPIOTE_EVENTS_IN_EVENTS_IN_Msk             ( 0x1UL << GPIOTE_EVENTS_IN_EVENTS_IN_Pos ) /*!< Bit mask of EVENTS_IN field. */
#define GPIOTE_EVENTS_IN_EVENTS_IN_NotGenerated    ( 0UL )                                     /*!< Event not generated */
#define GPIOTE_EVENTS_IN_EVENTS_IN_Generated       ( 1UL )                                     /*!< Event generated */

/* Register: GPIOTE_EVENTS_PORT */
/* Description: Event generated from multiple input GPIO pins with SENSE mechanism enabled */

/* Bit 0 : Event generated from multiple input GPIO pins with SENSE mechanism enabled */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_Pos             ( 0UL )                                         /*!< Position of EVENTS_PORT field. */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_Msk             ( 0x1UL << GPIOTE_EVENTS_PORT_EVENTS_PORT_Pos ) /*!< Bit mask of EVENTS_PORT field. */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define GPIOTE_EVENTS_PORT_EVENTS_PORT_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: GPIOTE_PUBLISH_IN */
/* Description: Description collection: Publish configuration for event IN[n] */

/* Bit 31 :   */
#define GPIOTE_PUBLISH_IN_EN_Pos         ( 31UL )                              /*!< Position of EN field. */
#define GPIOTE_PUBLISH_IN_EN_Msk         ( 0x1UL << GPIOTE_PUBLISH_IN_EN_Pos ) /*!< Bit mask of EN field. */
#define GPIOTE_PUBLISH_IN_EN_Disabled    ( 0UL )                               /*!< Disable publishing */
#define GPIOTE_PUBLISH_IN_EN_Enabled     ( 1UL )                               /*!< Enable publishing */

