FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 31 : Write '1' to disable interrupt for event PORT */
#define GPIOTE_INTENCLR_PORT_Pos         ( 31UL )                              /*!< Position of PORT field. */
#define GPIOTE_INTENCLR_PORT_Msk         ( 0x1UL << GPIOTE_INTENCLR_PORT_Pos ) /*!< Bit mask of PORT field. */
#define GPIOTE_INTENCLR_PORT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define GPIOTE_INTENCLR_PORT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define GPIOTE_INTENCLR_PORT_Clear       ( 1UL )                               /*!< Disable */

/* Bit 7 : Write '1' to disable interrupt for event IN[7] */
#define GPIOTE_INTENCLR_IN7_Pos          ( 7UL )                              /*!< Position of IN7 field. */
#define GPIOTE_INTENCLR_IN7_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN7_Pos ) /*!< Bit mask of IN7 field. */
#define GPIOTE_INTENCLR_IN7_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN7_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN7_Clear        ( 1UL )                              /*!< Disable */

/* Bit 6 : Write '1' to disable interrupt for event IN[6] */
#define GPIOTE_INTENCLR_IN6_Pos          ( 6UL )                              /*!< Position of IN6 field. */
#define GPIOTE_INTENCLR_IN6_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN6_Pos ) /*!< Bit mask of IN6 field. */
#define GPIOTE_INTENCLR_IN6_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN6_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN6_Clear        ( 1UL )                              /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event IN[5] */
#define GPIOTE_INTENCLR_IN5_Pos          ( 5UL )                              /*!< Position of IN5 field. */
#define GPIOTE_INTENCLR_IN5_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN5_Pos ) /*!< Bit mask of IN5 field. */
#define GPIOTE_INTENCLR_IN5_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN5_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN5_Clear        ( 1UL )                              /*!< Disable */

/* Bit 4 : Write '1' to disable interrupt for event IN[4] */
#define GPIOTE_INTENCLR_IN4_Pos          ( 4UL )                              /*!< Position of IN4 field. */
#define GPIOTE_INTENCLR_IN4_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN4_Pos ) /*!< Bit mask of IN4 field. */
#define GPIOTE_INTENCLR_IN4_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN4_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN4_Clear        ( 1UL )                              /*!< Disable */

/* Bit 3 : Write '1' to disable interrupt for event IN[3] */
#define GPIOTE_INTENCLR_IN3_Pos          ( 3UL )                              /*!< Position of IN3 field. */
#define GPIOTE_INTENCLR_IN3_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN3_Pos ) /*!< Bit mask of IN3 field. */
#define GPIOTE_INTENCLR_IN3_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN3_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN3_Clear        ( 1UL )                              /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event IN[2] */
#define GPIOTE_INTENCLR_IN2_Pos          ( 2UL )                              /*!< Position of IN2 field. */
#define GPIOTE_INTENCLR_IN2_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN2_Pos ) /*!< Bit mask of IN2 field. */
#define GPIOTE_INTENCLR_IN2_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN2_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN2_Clear        ( 1UL )                              /*!< Disable */

/* Bit 1 : Write '1' to disable interrupt for event IN[1] */
#define GPIOTE_INTENCLR_IN1_Pos          ( 1UL )                              /*!< Position of IN1 field. */
#define GPIOTE_INTENCLR_IN1_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN1_Pos ) /*!< Bit mask of IN1 field. */
#define GPIOTE_INTENCLR_IN1_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN1_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN1_Clear        ( 1UL )                              /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event IN[0] */
#define GPIOTE_INTENCLR_IN0_Pos          ( 0UL )                              /*!< Position of IN0 field. */
#define GPIOTE_INTENCLR_IN0_Msk          ( 0x1UL << GPIOTE_INTENCLR_IN0_Pos ) /*!< Bit mask of IN0 field. */
#define GPIOTE_INTENCLR_IN0_Disabled     ( 0UL )                              /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN0_Enabled      ( 1UL )                              /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN0_Clear        ( 1UL )                              /*!< Disable */

/* Register: GPIOTE_LATENCY */
/* Description: Latency selection for Event mode (MODE=Event) with rising or falling edge detection on the pin. */

/* Bit 0 : Latency setting */
#define GPIOTE_LATENCY_LATENCY_Pos           ( 0UL )                                 /*!< Position of LATENCY field. */
#define GPIOTE_LATENCY_LATENCY_Msk           ( 0x1UL << GPIOTE_LATENCY_LATENCY_Pos ) /*!< Bit mask of LATENCY field. */
#define GPIOTE_LATENCY_LATENCY_LowPower      ( 0UL )                                 /*!< Low power setting, for signals with minimum hold time tGPIOTE,HOLD,LP; refer to Electrical specification section */
#define GPIOTE_LATENCY_LATENCY_LowLatency    ( 1UL )                                 /*!< Low latency setting, for signals with minimum hold time tGPIOTE,HOLD,LL; refer to Electrical specification section */

/* Register: GPIOTE_CONFIG */
/* Description: Description collection: Configuration for OUT[n], SET[n], and CLR[n] tasks and IN[n] event */

/* Bit 20 : When in task mode: Initial value of the output when the GPIOTE channel is configured. When in event mode: No effect. */
#define GPIOTE_CONFIG_OUTINIT_Pos        ( 20UL )                               /*!< Position of OUTINIT field. */
#define GPIOTE_CONFIG_OUTINIT_Msk        ( 0x1UL << GPIOTE_CONFIG_OUTINIT_Pos ) /*!< Bit mask of OUTINIT field. */
#define GPIOTE_CONFIG_OUTINIT_Low        ( 0UL )                                /*!< Task mode: Initial value of pin before task triggering is low */
#define GPIOTE_CONFIG_OUTINIT_High       ( 1UL )                                /*!< Task mode: Initial value of pin before task triggering is high */

/* Bits 17..16 : When In task mode: Operation to be performed on output when OUT[n] task is triggered. When In event mode: Operation on input that shall trigger IN[n] event. */
#define GPIOTE_CONFIG_POLARITY_Pos       ( 16UL )                                /*!< Position of POLARITY field. */
#define GPIOTE_CONFIG_POLARITY_Msk       ( 0x3UL << GPIOTE_CONFIG_POLARITY_Pos ) /*!< Bit mask of POLARITY field. */
#define GPIOTE_CONFIG_POLARITY_None      ( 0UL )                                 /*!< Task mode: No effect on pin from OUT[n] task. Event mode: no IN[n] event generated on pin activity. */
#define GPIOTE_CONFIG_POLARITY_LoToHi    ( 1UL )                                 /*!< Task mode: Set pin from OUT[n] task. Event mode: Generate IN[n] event when rising edge on pin. */
#define GPIOTE_CONFIG_POLARITY_HiToLo    ( 2UL )                                 /*!< Task mode: Clear pin from OUT[n] task. Event mode: Generate IN[n] event when falling edge on pin. */
#define GPIOTE_CONFIG_POLARITY_Toggle    ( 3UL )                                 /*!< Task mode: Toggle pin from OUT[n]. Event mode: Generate IN[n] when any change on pin. */

/* Bit 13 : Port number */
#define GPIOTE_CONFIG_PORT_Pos           ( 13UL )                            /*!< Position of PORT field. */
#define GPIOTE_CONFIG_PORT_Msk           ( 0x1UL << GPIOTE_CONFIG_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 12..8 : GPIO number associated with SET[n], CLR[n], and OUT[n] tasks and IN[n] event */
#define GPIOTE_CONFIG_PSEL_Pos           ( 8UL )                              /*!< Position of PSEL field. */
#define GPIOTE_CONFIG_PSEL_Msk           ( 0x1FUL << GPIOTE_CONFIG_PSEL_Pos ) /*!< Bit mask of PSEL field. */

/* Bits 1..0 : Mode */
#define GPIOTE_CONFIG_MODE_Pos           ( 0UL )                             /*!< Position of MODE field. */
#define GPIOTE_CONFIG_MODE_Msk           ( 0x3UL << GPIOTE_CONFIG_MODE_Pos ) /*!< Bit mask of MODE field. */
#define GPIOTE_CONFIG_MODE_Disabled      ( 0UL )                             /*!< Disabled. Pin specified by PSEL will not be acquired by the GPIOTE module. */
#define GPIOTE_CONFIG_MODE_Event         ( 1UL )                             /*!< Event mode */
#define GPIOTE_CONFIG_MODE_Task          ( 3UL )                             /*!< Task mode */


/* Peripheral: IPC */
/* Description: Interprocessor communication */

/* Register: IPC_TASKS_SEND */
/* Description: Description collection: Trigger events on IPC channel enabled in SEND_CNF[n] */

