FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 0 : Trigger events on IPC channel enabled in SEND_CNF[n] */
#define IPC_TASKS_SEND_TASKS_SEND_Pos        ( 0UL )                                    /*!< Position of TASKS_SEND field. */
#define IPC_TASKS_SEND_TASKS_SEND_Msk        ( 0x1UL << IPC_TASKS_SEND_TASKS_SEND_Pos ) /*!< Bit mask of TASKS_SEND field. */
#define IPC_TASKS_SEND_TASKS_SEND_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: IPC_SUBSCRIBE_SEND */
/* Description: Description collection: Subscribe configuration for task SEND[n] */

/* Bit 31 :   */
#define IPC_SUBSCRIBE_SEND_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define IPC_SUBSCRIBE_SEND_EN_Msk         ( 0x1UL << IPC_SUBSCRIBE_SEND_EN_Pos ) /*!< Bit mask of EN field. */
#define IPC_SUBSCRIBE_SEND_EN_Disabled    ( 0UL )                                /*!< Disable subscription */
#define IPC_SUBSCRIBE_SEND_EN_Enabled     ( 1UL )                                /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SEND[n] will subscribe to */
#define IPC_SUBSCRIBE_SEND_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define IPC_SUBSCRIBE_SEND_CHIDX_Msk      ( 0xFFUL << IPC_SUBSCRIBE_SEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: IPC_EVENTS_RECEIVE */
/* Description: Description collection: Event received on one or more of the enabled IPC channels in RECEIVE_CNF[n] */

/* Bit 0 : Event received on one or more of the enabled IPC channels in RECEIVE_CNF[n] */
#define IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos             ( 0UL )                                            /*!< Position of EVENTS_RECEIVE field. */
#define IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_Msk             ( 0x1UL << IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_Pos ) /*!< Bit mask of EVENTS_RECEIVE field. */
#define IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define IPC_EVENTS_RECEIVE_EVENTS_RECEIVE_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: IPC_PUBLISH_RECEIVE */
/* Description: Description collection: Publish configuration for event RECEIVE[n] */

/* Bit 31 :   */
#define IPC_PUBLISH_RECEIVE_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define IPC_PUBLISH_RECEIVE_EN_Msk         ( 0x1UL << IPC_PUBLISH_RECEIVE_EN_Pos ) /*!< Bit mask of EN field. */
#define IPC_PUBLISH_RECEIVE_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define IPC_PUBLISH_RECEIVE_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RECEIVE[n] will publish to. */
#define IPC_PUBLISH_RECEIVE_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define IPC_PUBLISH_RECEIVE_CHIDX_Msk      ( 0xFFUL << IPC_PUBLISH_RECEIVE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: IPC_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 15 : Enable or disable interrupt for event RECEIVE[15] */
#define IPC_INTEN_RECEIVE15_Pos         ( 15UL )                             /*!< Position of RECEIVE15 field. */
#define IPC_INTEN_RECEIVE15_Msk         ( 0x1UL << IPC_INTEN_RECEIVE15_Pos ) /*!< Bit mask of RECEIVE15 field. */
#define IPC_INTEN_RECEIVE15_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE15_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 14 : Enable or disable interrupt for event RECEIVE[14] */
#define IPC_INTEN_RECEIVE14_Pos         ( 14UL )                             /*!< Position of RECEIVE14 field. */
#define IPC_INTEN_RECEIVE14_Msk         ( 0x1UL << IPC_INTEN_RECEIVE14_Pos ) /*!< Bit mask of RECEIVE14 field. */
#define IPC_INTEN_RECEIVE14_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE14_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 13 : Enable or disable interrupt for event RECEIVE[13] */
#define IPC_INTEN_RECEIVE13_Pos         ( 13UL )                             /*!< Position of RECEIVE13 field. */
#define IPC_INTEN_RECEIVE13_Msk         ( 0x1UL << IPC_INTEN_RECEIVE13_Pos ) /*!< Bit mask of RECEIVE13 field. */
#define IPC_INTEN_RECEIVE13_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE13_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 12 : Enable or disable interrupt for event RECEIVE[12] */
#define IPC_INTEN_RECEIVE12_Pos         ( 12UL )                             /*!< Position of RECEIVE12 field. */
#define IPC_INTEN_RECEIVE12_Msk         ( 0x1UL << IPC_INTEN_RECEIVE12_Pos ) /*!< Bit mask of RECEIVE12 field. */
#define IPC_INTEN_RECEIVE12_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE12_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 11 : Enable or disable interrupt for event RECEIVE[11] */
#define IPC_INTEN_RECEIVE11_Pos         ( 11UL )                             /*!< Position of RECEIVE11 field. */
#define IPC_INTEN_RECEIVE11_Msk         ( 0x1UL << IPC_INTEN_RECEIVE11_Pos ) /*!< Bit mask of RECEIVE11 field. */
#define IPC_INTEN_RECEIVE11_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE11_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 10 : Enable or disable interrupt for event RECEIVE[10] */
#define IPC_INTEN_RECEIVE10_Pos         ( 10UL )                             /*!< Position of RECEIVE10 field. */
#define IPC_INTEN_RECEIVE10_Msk         ( 0x1UL << IPC_INTEN_RECEIVE10_Pos ) /*!< Bit mask of RECEIVE10 field. */
#define IPC_INTEN_RECEIVE10_Disabled    ( 0UL )                              /*!< Disable */
#define IPC_INTEN_RECEIVE10_Enabled     ( 1UL )                              /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event RECEIVE[9] */
#define IPC_INTEN_RECEIVE9_Pos          ( 9UL )                             /*!< Position of RECEIVE9 field. */
#define IPC_INTEN_RECEIVE9_Msk          ( 0x1UL << IPC_INTEN_RECEIVE9_Pos ) /*!< Bit mask of RECEIVE9 field. */
#define IPC_INTEN_RECEIVE9_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE9_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event RECEIVE[8] */
#define IPC_INTEN_RECEIVE8_Pos          ( 8UL )                             /*!< Position of RECEIVE8 field. */
#define IPC_INTEN_RECEIVE8_Msk          ( 0x1UL << IPC_INTEN_RECEIVE8_Pos ) /*!< Bit mask of RECEIVE8 field. */
#define IPC_INTEN_RECEIVE8_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE8_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event RECEIVE[7] */
#define IPC_INTEN_RECEIVE7_Pos          ( 7UL )                             /*!< Position of RECEIVE7 field. */
#define IPC_INTEN_RECEIVE7_Msk          ( 0x1UL << IPC_INTEN_RECEIVE7_Pos ) /*!< Bit mask of RECEIVE7 field. */
#define IPC_INTEN_RECEIVE7_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE7_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 6 : Enable or disable interrupt for event RECEIVE[6] */
#define IPC_INTEN_RECEIVE6_Pos          ( 6UL )                             /*!< Position of RECEIVE6 field. */
#define IPC_INTEN_RECEIVE6_Msk          ( 0x1UL << IPC_INTEN_RECEIVE6_Pos ) /*!< Bit mask of RECEIVE6 field. */
#define IPC_INTEN_RECEIVE6_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE6_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event RECEIVE[5] */
#define IPC_INTEN_RECEIVE5_Pos          ( 5UL )                             /*!< Position of RECEIVE5 field. */
#define IPC_INTEN_RECEIVE5_Msk          ( 0x1UL << IPC_INTEN_RECEIVE5_Pos ) /*!< Bit mask of RECEIVE5 field. */
#define IPC_INTEN_RECEIVE5_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE5_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event RECEIVE[4] */
#define IPC_INTEN_RECEIVE4_Pos          ( 4UL )                             /*!< Position of RECEIVE4 field. */
#define IPC_INTEN_RECEIVE4_Msk          ( 0x1UL << IPC_INTEN_RECEIVE4_Pos ) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTEN_RECEIVE4_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE4_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 3 : Enable or disable interrupt for event RECEIVE[3] */
#define IPC_INTEN_RECEIVE3_Pos          ( 3UL )                             /*!< Position of RECEIVE3 field. */
#define IPC_INTEN_RECEIVE3_Msk          ( 0x1UL << IPC_INTEN_RECEIVE3_Pos ) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTEN_RECEIVE3_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE3_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event RECEIVE[2] */
#define IPC_INTEN_RECEIVE2_Pos          ( 2UL )                             /*!< Position of RECEIVE2 field. */
#define IPC_INTEN_RECEIVE2_Msk          ( 0x1UL << IPC_INTEN_RECEIVE2_Pos ) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTEN_RECEIVE2_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE2_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event RECEIVE[1] */
#define IPC_INTEN_RECEIVE1_Pos          ( 1UL )                             /*!< Position of RECEIVE1 field. */
#define IPC_INTEN_RECEIVE1_Msk          ( 0x1UL << IPC_INTEN_RECEIVE1_Pos ) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTEN_RECEIVE1_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE1_Enabled      ( 1UL )                             /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event RECEIVE[0] */
#define IPC_INTEN_RECEIVE0_Pos          ( 0UL )                             /*!< Position of RECEIVE0 field. */
#define IPC_INTEN_RECEIVE0_Msk          ( 0x1UL << IPC_INTEN_RECEIVE0_Pos ) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTEN_RECEIVE0_Disabled     ( 0UL )                             /*!< Disable */
#define IPC_INTEN_RECEIVE0_Enabled      ( 1UL )                             /*!< Enable */

/* Register: IPC_INTENSET */
/* Description: Enable interrupt */

/* Bit 15 : Write '1' to enable interrupt for event RECEIVE[15] */
#define IPC_INTENSET_RECEIVE15_Pos         ( 15UL )                                /*!< Position of RECEIVE15 field. */
#define IPC_INTENSET_RECEIVE15_Msk         ( 0x1UL << IPC_INTENSET_RECEIVE15_Pos ) /*!< Bit mask of RECEIVE15 field. */
#define IPC_INTENSET_RECEIVE15_Disabled    ( 0UL )                                 /*!< Read: Disabled */
#define IPC_INTENSET_RECEIVE15_Enabled     ( 1UL )                                 /*!< Read: Enabled */
#define IPC_INTENSET_RECEIVE15_Set         ( 1UL )                                 /*!< Enable */

