FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: IPC_INTPEND */
/* Description: Pending interrupts */

/* Bit 15 : Read pending status of interrupt for event RECEIVE[15] */
#define IPC_INTPEND_RECEIVE15_Pos           ( 15UL )                               /*!< Position of RECEIVE15 field. */
#define IPC_INTPEND_RECEIVE15_Msk           ( 0x1UL << IPC_INTPEND_RECEIVE15_Pos ) /*!< Bit mask of RECEIVE15 field. */
#define IPC_INTPEND_RECEIVE15_NotPending    ( 0UL )                                /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE15_Pending       ( 1UL )                                /*!< Read: Pending */

/* Bit 14 : Read pending status of interrupt for event RECEIVE[14] */
#define IPC_INTPEND_RECEIVE14_Pos           ( 14UL )                               /*!< Position of RECEIVE14 field. */
#define IPC_INTPEND_RECEIVE14_Msk           ( 0x1UL << IPC_INTPEND_RECEIVE14_Pos ) /*!< Bit mask of RECEIVE14 field. */
#define IPC_INTPEND_RECEIVE14_NotPending    ( 0UL )                                /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE14_Pending       ( 1UL )                                /*!< Read: Pending */

/* Bit 13 : Read pending status of interrupt for event RECEIVE[13] */
#define IPC_INTPEND_RECEIVE13_Pos           ( 13UL )                               /*!< Position of RECEIVE13 field. */
#define IPC_INTPEND_RECEIVE13_Msk           ( 0x1UL << IPC_INTPEND_RECEIVE13_Pos ) /*!< Bit mask of RECEIVE13 field. */
#define IPC_INTPEND_RECEIVE13_NotPending    ( 0UL )                                /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE13_Pending       ( 1UL )                                /*!< Read: Pending */

/* Bit 12 : Read pending status of interrupt for event RECEIVE[12] */
#define IPC_INTPEND_RECEIVE12_Pos           ( 12UL )                               /*!< Position of RECEIVE12 field. */
#define IPC_INTPEND_RECEIVE12_Msk           ( 0x1UL << IPC_INTPEND_RECEIVE12_Pos ) /*!< Bit mask of RECEIVE12 field. */
#define IPC_INTPEND_RECEIVE12_NotPending    ( 0UL )                                /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE12_Pending       ( 1UL )                                /*!< Read: Pending */

/* Bit 11 : Read pending status of interrupt for event RECEIVE[11] */
#define IPC_INTPEND_RECEIVE11_Pos           ( 11UL )                               /*!< Position of RECEIVE11 field. */
#define IPC_INTPEND_RECEIVE11_Msk           ( 0x1UL << IPC_INTPEND_RECEIVE11_Pos ) /*!< Bit mask of RECEIVE11 field. */
#define IPC_INTPEND_RECEIVE11_NotPending    ( 0UL )                                /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE11_Pending       ( 1UL )                                /*!< Read: Pending */

/* Bit 10 : Read pending status of interrupt for event RECEIVE[10] */
#define IPC_INTPEND_RECEIVE10_Pos           ( 10UL )                               /*!< Position of RECEIVE10 field. */
#define IPC_INTPEND_RECEIVE10_Msk           ( 0x1UL << IPC_INTPEND_RECEIVE10_Pos ) /*!< Bit mask of RECEIVE10 field. */
#define IPC_INTPEND_RECEIVE10_NotPending    ( 0UL )                                /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE10_Pending       ( 1UL )                                /*!< Read: Pending */

/* Bit 9 : Read pending status of interrupt for event RECEIVE[9] */
#define IPC_INTPEND_RECEIVE9_Pos            ( 9UL )                               /*!< Position of RECEIVE9 field. */
#define IPC_INTPEND_RECEIVE9_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE9_Pos ) /*!< Bit mask of RECEIVE9 field. */
#define IPC_INTPEND_RECEIVE9_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE9_Pending        ( 1UL )                               /*!< Read: Pending */

/* Bit 8 : Read pending status of interrupt for event RECEIVE[8] */
#define IPC_INTPEND_RECEIVE8_Pos            ( 8UL )                               /*!< Position of RECEIVE8 field. */
#define IPC_INTPEND_RECEIVE8_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE8_Pos ) /*!< Bit mask of RECEIVE8 field. */
#define IPC_INTPEND_RECEIVE8_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE8_Pending        ( 1UL )                               /*!< Read: Pending */

/* Bit 7 : Read pending status of interrupt for event RECEIVE[7] */
#define IPC_INTPEND_RECEIVE7_Pos            ( 7UL )                               /*!< Position of RECEIVE7 field. */
#define IPC_INTPEND_RECEIVE7_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE7_Pos ) /*!< Bit mask of RECEIVE7 field. */
#define IPC_INTPEND_RECEIVE7_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE7_Pending        ( 1UL )                               /*!< Read: Pending */

/* Bit 6 : Read pending status of interrupt for event RECEIVE[6] */
#define IPC_INTPEND_RECEIVE6_Pos            ( 6UL )                               /*!< Position of RECEIVE6 field. */
#define IPC_INTPEND_RECEIVE6_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE6_Pos ) /*!< Bit mask of RECEIVE6 field. */
#define IPC_INTPEND_RECEIVE6_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE6_Pending        ( 1UL )                               /*!< Read: Pending */

/* Bit 5 : Read pending status of interrupt for event RECEIVE[5] */
#define IPC_INTPEND_RECEIVE5_Pos            ( 5UL )                               /*!< Position of RECEIVE5 field. */
#define IPC_INTPEND_RECEIVE5_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE5_Pos ) /*!< Bit mask of RECEIVE5 field. */
#define IPC_INTPEND_RECEIVE5_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE5_Pending        ( 1UL )                               /*!< Read: Pending */

/* Bit 4 : Read pending status of interrupt for event RECEIVE[4] */
#define IPC_INTPEND_RECEIVE4_Pos            ( 4UL )                               /*!< Position of RECEIVE4 field. */
#define IPC_INTPEND_RECEIVE4_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE4_Pos ) /*!< Bit mask of RECEIVE4 field. */
#define IPC_INTPEND_RECEIVE4_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE4_Pending        ( 1UL )                               /*!< Read: Pending */

/* Bit 3 : Read pending status of interrupt for event RECEIVE[3] */
#define IPC_INTPEND_RECEIVE3_Pos            ( 3UL )                               /*!< Position of RECEIVE3 field. */
#define IPC_INTPEND_RECEIVE3_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE3_Pos ) /*!< Bit mask of RECEIVE3 field. */
#define IPC_INTPEND_RECEIVE3_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE3_Pending        ( 1UL )                               /*!< Read: Pending */

/* Bit 2 : Read pending status of interrupt for event RECEIVE[2] */
#define IPC_INTPEND_RECEIVE2_Pos            ( 2UL )                               /*!< Position of RECEIVE2 field. */
#define IPC_INTPEND_RECEIVE2_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE2_Pos ) /*!< Bit mask of RECEIVE2 field. */
#define IPC_INTPEND_RECEIVE2_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE2_Pending        ( 1UL )                               /*!< Read: Pending */

/* Bit 1 : Read pending status of interrupt for event RECEIVE[1] */
#define IPC_INTPEND_RECEIVE1_Pos            ( 1UL )                               /*!< Position of RECEIVE1 field. */
#define IPC_INTPEND_RECEIVE1_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE1_Pos ) /*!< Bit mask of RECEIVE1 field. */
#define IPC_INTPEND_RECEIVE1_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE1_Pending        ( 1UL )                               /*!< Read: Pending */

/* Bit 0 : Read pending status of interrupt for event RECEIVE[0] */
#define IPC_INTPEND_RECEIVE0_Pos            ( 0UL )                               /*!< Position of RECEIVE0 field. */
#define IPC_INTPEND_RECEIVE0_Msk            ( 0x1UL << IPC_INTPEND_RECEIVE0_Pos ) /*!< Bit mask of RECEIVE0 field. */
#define IPC_INTPEND_RECEIVE0_NotPending     ( 0UL )                               /*!< Read: Not pending */
#define IPC_INTPEND_RECEIVE0_Pending        ( 1UL )                               /*!< Read: Pending */

/* Register: IPC_SEND_CNF */
/* Description: Description collection: Send event configuration for TASKS_SEND[n] */

/* Bit 15 : Enable broadcasting on IPC channel 15 */
#define IPC_SEND_CNF_CHEN15_Pos        ( 15UL )                             /*!< Position of CHEN15 field. */
#define IPC_SEND_CNF_CHEN15_Msk        ( 0x1UL << IPC_SEND_CNF_CHEN15_Pos ) /*!< Bit mask of CHEN15 field. */
#define IPC_SEND_CNF_CHEN15_Disable    ( 0UL )                              /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN15_Enable     ( 1UL )                              /*!< Enable broadcast */

/* Bit 14 : Enable broadcasting on IPC channel 14 */
#define IPC_SEND_CNF_CHEN14_Pos        ( 14UL )                             /*!< Position of CHEN14 field. */
#define IPC_SEND_CNF_CHEN14_Msk        ( 0x1UL << IPC_SEND_CNF_CHEN14_Pos ) /*!< Bit mask of CHEN14 field. */
#define IPC_SEND_CNF_CHEN14_Disable    ( 0UL )                              /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN14_Enable     ( 1UL )                              /*!< Enable broadcast */

/* Bit 13 : Enable broadcasting on IPC channel 13 */
#define IPC_SEND_CNF_CHEN13_Pos        ( 13UL )                             /*!< Position of CHEN13 field. */
#define IPC_SEND_CNF_CHEN13_Msk        ( 0x1UL << IPC_SEND_CNF_CHEN13_Pos ) /*!< Bit mask of CHEN13 field. */
#define IPC_SEND_CNF_CHEN13_Disable    ( 0UL )                              /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN13_Enable     ( 1UL )                              /*!< Enable broadcast */

/* Bit 12 : Enable broadcasting on IPC channel 12 */
#define IPC_SEND_CNF_CHEN12_Pos        ( 12UL )                             /*!< Position of CHEN12 field. */
#define IPC_SEND_CNF_CHEN12_Msk        ( 0x1UL << IPC_SEND_CNF_CHEN12_Pos ) /*!< Bit mask of CHEN12 field. */
#define IPC_SEND_CNF_CHEN12_Disable    ( 0UL )                              /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN12_Enable     ( 1UL )                              /*!< Enable broadcast */

/* Bit 11 : Enable broadcasting on IPC channel 11 */
#define IPC_SEND_CNF_CHEN11_Pos        ( 11UL )                             /*!< Position of CHEN11 field. */
#define IPC_SEND_CNF_CHEN11_Msk        ( 0x1UL << IPC_SEND_CNF_CHEN11_Pos ) /*!< Bit mask of CHEN11 field. */
#define IPC_SEND_CNF_CHEN11_Disable    ( 0UL )                              /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN11_Enable     ( 1UL )                              /*!< Enable broadcast */

/* Bit 10 : Enable broadcasting on IPC channel 10 */
#define IPC_SEND_CNF_CHEN10_Pos        ( 10UL )                             /*!< Position of CHEN10 field. */
#define IPC_SEND_CNF_CHEN10_Msk        ( 0x1UL << IPC_SEND_CNF_CHEN10_Pos ) /*!< Bit mask of CHEN10 field. */
#define IPC_SEND_CNF_CHEN10_Disable    ( 0UL )                              /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN10_Enable     ( 1UL )                              /*!< Enable broadcast */

/* Bit 9 : Enable broadcasting on IPC channel 9 */
#define IPC_SEND_CNF_CHEN9_Pos         ( 9UL )                             /*!< Position of CHEN9 field. */
#define IPC_SEND_CNF_CHEN9_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN9_Pos ) /*!< Bit mask of CHEN9 field. */
#define IPC_SEND_CNF_CHEN9_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN9_Enable      ( 1UL )                             /*!< Enable broadcast */

/* Bit 8 : Enable broadcasting on IPC channel 8 */
#define IPC_SEND_CNF_CHEN8_Pos         ( 8UL )                             /*!< Position of CHEN8 field. */
#define IPC_SEND_CNF_CHEN8_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN8_Pos ) /*!< Bit mask of CHEN8 field. */
#define IPC_SEND_CNF_CHEN8_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN8_Enable      ( 1UL )                             /*!< Enable broadcast */

/* Bit 7 : Enable broadcasting on IPC channel 7 */
#define IPC_SEND_CNF_CHEN7_Pos         ( 7UL )                             /*!< Position of CHEN7 field. */
#define IPC_SEND_CNF_CHEN7_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN7_Pos ) /*!< Bit mask of CHEN7 field. */
#define IPC_SEND_CNF_CHEN7_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN7_Enable      ( 1UL )                             /*!< Enable broadcast */

