FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 6 : Enable broadcasting on IPC channel 6 */
#define IPC_SEND_CNF_CHEN6_Pos         ( 6UL )                             /*!< Position of CHEN6 field. */
#define IPC_SEND_CNF_CHEN6_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN6_Pos ) /*!< Bit mask of CHEN6 field. */
#define IPC_SEND_CNF_CHEN6_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN6_Enable      ( 1UL )                             /*!< Enable broadcast */

/* Bit 5 : Enable broadcasting on IPC channel 5 */
#define IPC_SEND_CNF_CHEN5_Pos         ( 5UL )                             /*!< Position of CHEN5 field. */
#define IPC_SEND_CNF_CHEN5_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN5_Pos ) /*!< Bit mask of CHEN5 field. */
#define IPC_SEND_CNF_CHEN5_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN5_Enable      ( 1UL )                             /*!< Enable broadcast */

/* Bit 4 : Enable broadcasting on IPC channel 4 */
#define IPC_SEND_CNF_CHEN4_Pos         ( 4UL )                             /*!< Position of CHEN4 field. */
#define IPC_SEND_CNF_CHEN4_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN4_Pos ) /*!< Bit mask of CHEN4 field. */
#define IPC_SEND_CNF_CHEN4_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN4_Enable      ( 1UL )                             /*!< Enable broadcast */

/* Bit 3 : Enable broadcasting on IPC channel 3 */
#define IPC_SEND_CNF_CHEN3_Pos         ( 3UL )                             /*!< Position of CHEN3 field. */
#define IPC_SEND_CNF_CHEN3_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN3_Pos ) /*!< Bit mask of CHEN3 field. */
#define IPC_SEND_CNF_CHEN3_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN3_Enable      ( 1UL )                             /*!< Enable broadcast */

/* Bit 2 : Enable broadcasting on IPC channel 2 */
#define IPC_SEND_CNF_CHEN2_Pos         ( 2UL )                             /*!< Position of CHEN2 field. */
#define IPC_SEND_CNF_CHEN2_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN2_Pos ) /*!< Bit mask of CHEN2 field. */
#define IPC_SEND_CNF_CHEN2_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN2_Enable      ( 1UL )                             /*!< Enable broadcast */

/* Bit 1 : Enable broadcasting on IPC channel 1 */
#define IPC_SEND_CNF_CHEN1_Pos         ( 1UL )                             /*!< Position of CHEN1 field. */
#define IPC_SEND_CNF_CHEN1_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN1_Pos ) /*!< Bit mask of CHEN1 field. */
#define IPC_SEND_CNF_CHEN1_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN1_Enable      ( 1UL )                             /*!< Enable broadcast */

/* Bit 0 : Enable broadcasting on IPC channel 0 */
#define IPC_SEND_CNF_CHEN0_Pos         ( 0UL )                             /*!< Position of CHEN0 field. */
#define IPC_SEND_CNF_CHEN0_Msk         ( 0x1UL << IPC_SEND_CNF_CHEN0_Pos ) /*!< Bit mask of CHEN0 field. */
#define IPC_SEND_CNF_CHEN0_Disable     ( 0UL )                             /*!< Disable broadcast */
#define IPC_SEND_CNF_CHEN0_Enable      ( 1UL )                             /*!< Enable broadcast */

/* Register: IPC_RECEIVE_CNF */
/* Description: Description collection: Receive event configuration for EVENTS_RECEIVE[n] */

/* Bit 15 : Enable subscription to IPC channel 15 */
#define IPC_RECEIVE_CNF_CHEN15_Pos        ( 15UL )                                /*!< Position of CHEN15 field. */
#define IPC_RECEIVE_CNF_CHEN15_Msk        ( 0x1UL << IPC_RECEIVE_CNF_CHEN15_Pos ) /*!< Bit mask of CHEN15 field. */
#define IPC_RECEIVE_CNF_CHEN15_Disable    ( 0UL )                                 /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN15_Enable     ( 1UL )                                 /*!< Enable events */

/* Bit 14 : Enable subscription to IPC channel 14 */
#define IPC_RECEIVE_CNF_CHEN14_Pos        ( 14UL )                                /*!< Position of CHEN14 field. */
#define IPC_RECEIVE_CNF_CHEN14_Msk        ( 0x1UL << IPC_RECEIVE_CNF_CHEN14_Pos ) /*!< Bit mask of CHEN14 field. */
#define IPC_RECEIVE_CNF_CHEN14_Disable    ( 0UL )                                 /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN14_Enable     ( 1UL )                                 /*!< Enable events */

/* Bit 13 : Enable subscription to IPC channel 13 */
#define IPC_RECEIVE_CNF_CHEN13_Pos        ( 13UL )                                /*!< Position of CHEN13 field. */
#define IPC_RECEIVE_CNF_CHEN13_Msk        ( 0x1UL << IPC_RECEIVE_CNF_CHEN13_Pos ) /*!< Bit mask of CHEN13 field. */
#define IPC_RECEIVE_CNF_CHEN13_Disable    ( 0UL )                                 /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN13_Enable     ( 1UL )                                 /*!< Enable events */

/* Bit 12 : Enable subscription to IPC channel 12 */
#define IPC_RECEIVE_CNF_CHEN12_Pos        ( 12UL )                                /*!< Position of CHEN12 field. */
#define IPC_RECEIVE_CNF_CHEN12_Msk        ( 0x1UL << IPC_RECEIVE_CNF_CHEN12_Pos ) /*!< Bit mask of CHEN12 field. */
#define IPC_RECEIVE_CNF_CHEN12_Disable    ( 0UL )                                 /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN12_Enable     ( 1UL )                                 /*!< Enable events */

/* Bit 11 : Enable subscription to IPC channel 11 */
#define IPC_RECEIVE_CNF_CHEN11_Pos        ( 11UL )                                /*!< Position of CHEN11 field. */
#define IPC_RECEIVE_CNF_CHEN11_Msk        ( 0x1UL << IPC_RECEIVE_CNF_CHEN11_Pos ) /*!< Bit mask of CHEN11 field. */
#define IPC_RECEIVE_CNF_CHEN11_Disable    ( 0UL )                                 /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN11_Enable     ( 1UL )                                 /*!< Enable events */

/* Bit 10 : Enable subscription to IPC channel 10 */
#define IPC_RECEIVE_CNF_CHEN10_Pos        ( 10UL )                                /*!< Position of CHEN10 field. */
#define IPC_RECEIVE_CNF_CHEN10_Msk        ( 0x1UL << IPC_RECEIVE_CNF_CHEN10_Pos ) /*!< Bit mask of CHEN10 field. */
#define IPC_RECEIVE_CNF_CHEN10_Disable    ( 0UL )                                 /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN10_Enable     ( 1UL )                                 /*!< Enable events */

/* Bit 9 : Enable subscription to IPC channel 9 */
#define IPC_RECEIVE_CNF_CHEN9_Pos         ( 9UL )                                /*!< Position of CHEN9 field. */
#define IPC_RECEIVE_CNF_CHEN9_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN9_Pos ) /*!< Bit mask of CHEN9 field. */
#define IPC_RECEIVE_CNF_CHEN9_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN9_Enable      ( 1UL )                                /*!< Enable events */

