FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 8 : Enable subscription to IPC channel 8 */
#define IPC_RECEIVE_CNF_CHEN8_Pos         ( 8UL )                                /*!< Position of CHEN8 field. */
#define IPC_RECEIVE_CNF_CHEN8_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN8_Pos ) /*!< Bit mask of CHEN8 field. */
#define IPC_RECEIVE_CNF_CHEN8_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN8_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 7 : Enable subscription to IPC channel 7 */
#define IPC_RECEIVE_CNF_CHEN7_Pos         ( 7UL )                                /*!< Position of CHEN7 field. */
#define IPC_RECEIVE_CNF_CHEN7_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN7_Pos ) /*!< Bit mask of CHEN7 field. */
#define IPC_RECEIVE_CNF_CHEN7_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN7_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 6 : Enable subscription to IPC channel 6 */
#define IPC_RECEIVE_CNF_CHEN6_Pos         ( 6UL )                                /*!< Position of CHEN6 field. */
#define IPC_RECEIVE_CNF_CHEN6_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN6_Pos ) /*!< Bit mask of CHEN6 field. */
#define IPC_RECEIVE_CNF_CHEN6_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN6_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 5 : Enable subscription to IPC channel 5 */
#define IPC_RECEIVE_CNF_CHEN5_Pos         ( 5UL )                                /*!< Position of CHEN5 field. */
#define IPC_RECEIVE_CNF_CHEN5_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN5_Pos ) /*!< Bit mask of CHEN5 field. */
#define IPC_RECEIVE_CNF_CHEN5_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN5_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 4 : Enable subscription to IPC channel 4 */
#define IPC_RECEIVE_CNF_CHEN4_Pos         ( 4UL )                                /*!< Position of CHEN4 field. */
#define IPC_RECEIVE_CNF_CHEN4_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN4_Pos ) /*!< Bit mask of CHEN4 field. */
#define IPC_RECEIVE_CNF_CHEN4_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN4_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 3 : Enable subscription to IPC channel 3 */
#define IPC_RECEIVE_CNF_CHEN3_Pos         ( 3UL )                                /*!< Position of CHEN3 field. */
#define IPC_RECEIVE_CNF_CHEN3_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN3_Pos ) /*!< Bit mask of CHEN3 field. */
#define IPC_RECEIVE_CNF_CHEN3_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN3_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 2 : Enable subscription to IPC channel 2 */
#define IPC_RECEIVE_CNF_CHEN2_Pos         ( 2UL )                                /*!< Position of CHEN2 field. */
#define IPC_RECEIVE_CNF_CHEN2_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN2_Pos ) /*!< Bit mask of CHEN2 field. */
#define IPC_RECEIVE_CNF_CHEN2_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN2_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 1 : Enable subscription to IPC channel 1 */
#define IPC_RECEIVE_CNF_CHEN1_Pos         ( 1UL )                                /*!< Position of CHEN1 field. */
#define IPC_RECEIVE_CNF_CHEN1_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN1_Pos ) /*!< Bit mask of CHEN1 field. */
#define IPC_RECEIVE_CNF_CHEN1_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN1_Enable      ( 1UL )                                /*!< Enable events */

/* Bit 0 : Enable subscription to IPC channel 0 */
#define IPC_RECEIVE_CNF_CHEN0_Pos         ( 0UL )                                /*!< Position of CHEN0 field. */
#define IPC_RECEIVE_CNF_CHEN0_Msk         ( 0x1UL << IPC_RECEIVE_CNF_CHEN0_Pos ) /*!< Bit mask of CHEN0 field. */
#define IPC_RECEIVE_CNF_CHEN0_Disable     ( 0UL )                                /*!< Disable events */
#define IPC_RECEIVE_CNF_CHEN0_Enable      ( 1UL )                                /*!< Enable events */

/* Register: IPC_GPMEM */
/* Description: Description collection: General purpose memory */

/* Bits 31..0 : General purpose memory */
#define IPC_GPMEM_GPMEM_Pos    ( 0UL )                                 /*!< Position of GPMEM field. */
#define IPC_GPMEM_GPMEM_Msk    ( 0xFFFFFFFFUL << IPC_GPMEM_GPMEM_Pos ) /*!< Bit mask of GPMEM field. */


/* Peripheral: NVMC */
/* Description: Non-volatile memory controller */

/* Register: NVMC_READY */
/* Description: Ready flag */

/* Bit 0 : NVMC is ready or busy */
#define NVMC_READY_READY_Pos      ( 0UL )                           /*!< Position of READY field. */
#define NVMC_READY_READY_Msk      ( 0x1UL << NVMC_READY_READY_Pos ) /*!< Bit mask of READY field. */
#define NVMC_READY_READY_Busy     ( 0UL )                           /*!< NVMC is busy (ongoing write or erase operation) */
#define NVMC_READY_READY_Ready    ( 1UL )                           /*!< NVMC is ready */

/* Register: NVMC_READYNEXT */
/* Description: Ready flag */

/* Bit 0 : NVMC can accept a new write operation */
#define NVMC_READYNEXT_READYNEXT_Pos      ( 0UL )                                   /*!< Position of READYNEXT field. */
#define NVMC_READYNEXT_READYNEXT_Msk      ( 0x1UL << NVMC_READYNEXT_READYNEXT_Pos ) /*!< Bit mask of READYNEXT field. */
#define NVMC_READYNEXT_READYNEXT_Busy     ( 0UL )                                   /*!< NVMC cannot accept any write operation */
#define NVMC_READYNEXT_READYNEXT_Ready    ( 1UL )                                   /*!< NVMC is ready */

/* Register: NVMC_CONFIG */
/* Description: Configuration register */

/* Bits 2..0 : Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. Enabling write or erase will invalidate the cache and keep it invalidated. */
#define NVMC_CONFIG_WEN_Pos     ( 0UL )                          /*!< Position of WEN field. */
#define NVMC_CONFIG_WEN_Msk     ( 0x7UL << NVMC_CONFIG_WEN_Pos ) /*!< Bit mask of WEN field. */
#define NVMC_CONFIG_WEN_Ren     ( 0UL )                          /*!< Read only access */
#define NVMC_CONFIG_WEN_Wen     ( 1UL )                          /*!< Write enabled */
#define NVMC_CONFIG_WEN_Een     ( 2UL )                          /*!< Erase enabled */
#define NVMC_CONFIG_WEN_PEen    ( 4UL )                          /*!< Partial erase enabled */

/* Register: NVMC_ERASEALL */
/* Description: Register for erasing all non-volatile user memory */

