FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 0 : Erase all non-volatile memory including UICR registers. Before the non-volatile memory can be erased, erasing must be enabled by setting CONFIG.WEN=Een. */
#define NVMC_ERASEALL_ERASEALL_Pos            ( 0UL )                                 /*!< Position of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_Msk            ( 0x1UL << NVMC_ERASEALL_ERASEALL_Pos ) /*!< Bit mask of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_NoOperation    ( 0UL )                                 /*!< No operation */
#define NVMC_ERASEALL_ERASEALL_Erase          ( 1UL )                                 /*!< Start chip erase */

/* Register: NVMC_ERASEPAGEPARTIALCFG */
/* Description: Register for partial erase configuration */

/* Bits 6..0 : Duration of the partial erase in milliseconds */
#define NVMC_ERASEPAGEPARTIALCFG_DURATION_Pos    ( 0UL )                                             /*!< Position of DURATION field. */
#define NVMC_ERASEPAGEPARTIALCFG_DURATION_Msk    ( 0x7FUL << NVMC_ERASEPAGEPARTIALCFG_DURATION_Pos ) /*!< Bit mask of DURATION field. */

/* Register: NVMC_ICACHECNF */
/* Description: I-code cache configuration register */

/* Bit 8 : Cache profiling enable */
#define NVMC_ICACHECNF_CACHEPROFEN_Pos         ( 8UL )                                     /*!< Position of CACHEPROFEN field. */
#define NVMC_ICACHECNF_CACHEPROFEN_Msk         ( 0x1UL << NVMC_ICACHECNF_CACHEPROFEN_Pos ) /*!< Bit mask of CACHEPROFEN field. */
#define NVMC_ICACHECNF_CACHEPROFEN_Disabled    ( 0UL )                                     /*!< Disable cache profiling */
#define NVMC_ICACHECNF_CACHEPROFEN_Enabled     ( 1UL )                                     /*!< Enable cache profiling */

/* Bit 0 : Cache enable */
#define NVMC_ICACHECNF_CACHEEN_Pos             ( 0UL )                                 /*!< Position of CACHEEN field. */
#define NVMC_ICACHECNF_CACHEEN_Msk             ( 0x1UL << NVMC_ICACHECNF_CACHEEN_Pos ) /*!< Bit mask of CACHEEN field. */
#define NVMC_ICACHECNF_CACHEEN_Disabled        ( 0UL )                                 /*!< Disable cache. Invalidates all cache entries. */
#define NVMC_ICACHECNF_CACHEEN_Enabled         ( 1UL )                                 /*!< Enable cache */

/* Register: NVMC_IHIT */
/* Description: I-code cache hit counter */

/* Bits 31..0 : Number of cache hits Write zero to clear */
#define NVMC_IHIT_HITS_Pos    ( 0UL )                                /*!< Position of HITS field. */
#define NVMC_IHIT_HITS_Msk    ( 0xFFFFFFFFUL << NVMC_IHIT_HITS_Pos ) /*!< Bit mask of HITS field. */

/* Register: NVMC_IMISS */
/* Description: I-code cache miss counter */

/* Bits 31..0 : Number of cache misses Write zero to clear */
#define NVMC_IMISS_MISSES_Pos    ( 0UL )                                   /*!< Position of MISSES field. */
#define NVMC_IMISS_MISSES_Msk    ( 0xFFFFFFFFUL << NVMC_IMISS_MISSES_Pos ) /*!< Bit mask of MISSES field. */


/* Peripheral: GPIO */
/* Description: GPIO Port 0 */

/* Register: GPIO_OUT */
/* Description: Write GPIO port */

/* Bit 31 : Pin 31 */
#define GPIO_OUT_PIN31_Pos     ( 31UL )                        /*!< Position of PIN31 field. */
#define GPIO_OUT_PIN31_Msk     ( 0x1UL << GPIO_OUT_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define GPIO_OUT_PIN31_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN31_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 30 : Pin 30 */
#define GPIO_OUT_PIN30_Pos     ( 30UL )                        /*!< Position of PIN30 field. */
#define GPIO_OUT_PIN30_Msk     ( 0x1UL << GPIO_OUT_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define GPIO_OUT_PIN30_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN30_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 29 : Pin 29 */
#define GPIO_OUT_PIN29_Pos     ( 29UL )                        /*!< Position of PIN29 field. */
#define GPIO_OUT_PIN29_Msk     ( 0x1UL << GPIO_OUT_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define GPIO_OUT_PIN29_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN29_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 28 : Pin 28 */
#define GPIO_OUT_PIN28_Pos     ( 28UL )                        /*!< Position of PIN28 field. */
#define GPIO_OUT_PIN28_Msk     ( 0x1UL << GPIO_OUT_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define GPIO_OUT_PIN28_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN28_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 27 : Pin 27 */
#define GPIO_OUT_PIN27_Pos     ( 27UL )                        /*!< Position of PIN27 field. */
#define GPIO_OUT_PIN27_Msk     ( 0x1UL << GPIO_OUT_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define GPIO_OUT_PIN27_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN27_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 26 : Pin 26 */
#define GPIO_OUT_PIN26_Pos     ( 26UL )                        /*!< Position of PIN26 field. */
#define GPIO_OUT_PIN26_Msk     ( 0x1UL << GPIO_OUT_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define GPIO_OUT_PIN26_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN26_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 25 : Pin 25 */
#define GPIO_OUT_PIN25_Pos     ( 25UL )                        /*!< Position of PIN25 field. */
#define GPIO_OUT_PIN25_Msk     ( 0x1UL << GPIO_OUT_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define GPIO_OUT_PIN25_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN25_High    ( 1UL )                         /*!< Pin driver is high */

/* Bit 24 : Pin 24 */
#define GPIO_OUT_PIN24_Pos     ( 24UL )                        /*!< Position of PIN24 field. */
#define GPIO_OUT_PIN24_Msk     ( 0x1UL << GPIO_OUT_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define GPIO_OUT_PIN24_Low     ( 0UL )                         /*!< Pin driver is low */
#define GPIO_OUT_PIN24_High    ( 1UL )                         /*!< Pin driver is high */

