FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: GPIO_DIRSET */
/* Description: DIR set register */

/* Bit 31 : Set as output pin 31 */
#define GPIO_DIRSET_PIN31_Pos       ( 31UL )                           /*!< Position of PIN31 field. */
#define GPIO_DIRSET_PIN31_Msk       ( 0x1UL << GPIO_DIRSET_PIN31_Pos ) /*!< Bit mask of PIN31 field. */
#define GPIO_DIRSET_PIN31_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN31_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN31_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 30 : Set as output pin 30 */
#define GPIO_DIRSET_PIN30_Pos       ( 30UL )                           /*!< Position of PIN30 field. */
#define GPIO_DIRSET_PIN30_Msk       ( 0x1UL << GPIO_DIRSET_PIN30_Pos ) /*!< Bit mask of PIN30 field. */
#define GPIO_DIRSET_PIN30_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN30_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN30_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 29 : Set as output pin 29 */
#define GPIO_DIRSET_PIN29_Pos       ( 29UL )                           /*!< Position of PIN29 field. */
#define GPIO_DIRSET_PIN29_Msk       ( 0x1UL << GPIO_DIRSET_PIN29_Pos ) /*!< Bit mask of PIN29 field. */
#define GPIO_DIRSET_PIN29_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN29_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN29_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 28 : Set as output pin 28 */
#define GPIO_DIRSET_PIN28_Pos       ( 28UL )                           /*!< Position of PIN28 field. */
#define GPIO_DIRSET_PIN28_Msk       ( 0x1UL << GPIO_DIRSET_PIN28_Pos ) /*!< Bit mask of PIN28 field. */
#define GPIO_DIRSET_PIN28_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN28_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN28_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 27 : Set as output pin 27 */
#define GPIO_DIRSET_PIN27_Pos       ( 27UL )                           /*!< Position of PIN27 field. */
#define GPIO_DIRSET_PIN27_Msk       ( 0x1UL << GPIO_DIRSET_PIN27_Pos ) /*!< Bit mask of PIN27 field. */
#define GPIO_DIRSET_PIN27_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN27_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN27_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 26 : Set as output pin 26 */
#define GPIO_DIRSET_PIN26_Pos       ( 26UL )                           /*!< Position of PIN26 field. */
#define GPIO_DIRSET_PIN26_Msk       ( 0x1UL << GPIO_DIRSET_PIN26_Pos ) /*!< Bit mask of PIN26 field. */
#define GPIO_DIRSET_PIN26_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN26_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN26_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 25 : Set as output pin 25 */
#define GPIO_DIRSET_PIN25_Pos       ( 25UL )                           /*!< Position of PIN25 field. */
#define GPIO_DIRSET_PIN25_Msk       ( 0x1UL << GPIO_DIRSET_PIN25_Pos ) /*!< Bit mask of PIN25 field. */
#define GPIO_DIRSET_PIN25_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN25_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN25_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 24 : Set as output pin 24 */
#define GPIO_DIRSET_PIN24_Pos       ( 24UL )                           /*!< Position of PIN24 field. */
#define GPIO_DIRSET_PIN24_Msk       ( 0x1UL << GPIO_DIRSET_PIN24_Pos ) /*!< Bit mask of PIN24 field. */
#define GPIO_DIRSET_PIN24_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN24_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN24_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 23 : Set as output pin 23 */
#define GPIO_DIRSET_PIN23_Pos       ( 23UL )                           /*!< Position of PIN23 field. */
#define GPIO_DIRSET_PIN23_Msk       ( 0x1UL << GPIO_DIRSET_PIN23_Pos ) /*!< Bit mask of PIN23 field. */
#define GPIO_DIRSET_PIN23_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN23_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN23_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 22 : Set as output pin 22 */
#define GPIO_DIRSET_PIN22_Pos       ( 22UL )                           /*!< Position of PIN22 field. */
#define GPIO_DIRSET_PIN22_Msk       ( 0x1UL << GPIO_DIRSET_PIN22_Pos ) /*!< Bit mask of PIN22 field. */
#define GPIO_DIRSET_PIN22_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN22_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN22_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

