FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 21 : Set as output pin 21 */
#define GPIO_DIRSET_PIN21_Pos       ( 21UL )                           /*!< Position of PIN21 field. */
#define GPIO_DIRSET_PIN21_Msk       ( 0x1UL << GPIO_DIRSET_PIN21_Pos ) /*!< Bit mask of PIN21 field. */
#define GPIO_DIRSET_PIN21_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN21_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN21_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 20 : Set as output pin 20 */
#define GPIO_DIRSET_PIN20_Pos       ( 20UL )                           /*!< Position of PIN20 field. */
#define GPIO_DIRSET_PIN20_Msk       ( 0x1UL << GPIO_DIRSET_PIN20_Pos ) /*!< Bit mask of PIN20 field. */
#define GPIO_DIRSET_PIN20_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN20_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN20_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 19 : Set as output pin 19 */
#define GPIO_DIRSET_PIN19_Pos       ( 19UL )                           /*!< Position of PIN19 field. */
#define GPIO_DIRSET_PIN19_Msk       ( 0x1UL << GPIO_DIRSET_PIN19_Pos ) /*!< Bit mask of PIN19 field. */
#define GPIO_DIRSET_PIN19_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN19_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN19_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 18 : Set as output pin 18 */
#define GPIO_DIRSET_PIN18_Pos       ( 18UL )                           /*!< Position of PIN18 field. */
#define GPIO_DIRSET_PIN18_Msk       ( 0x1UL << GPIO_DIRSET_PIN18_Pos ) /*!< Bit mask of PIN18 field. */
#define GPIO_DIRSET_PIN18_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN18_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN18_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 17 : Set as output pin 17 */
#define GPIO_DIRSET_PIN17_Pos       ( 17UL )                           /*!< Position of PIN17 field. */
#define GPIO_DIRSET_PIN17_Msk       ( 0x1UL << GPIO_DIRSET_PIN17_Pos ) /*!< Bit mask of PIN17 field. */
#define GPIO_DIRSET_PIN17_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN17_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN17_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 16 : Set as output pin 16 */
#define GPIO_DIRSET_PIN16_Pos       ( 16UL )                           /*!< Position of PIN16 field. */
#define GPIO_DIRSET_PIN16_Msk       ( 0x1UL << GPIO_DIRSET_PIN16_Pos ) /*!< Bit mask of PIN16 field. */
#define GPIO_DIRSET_PIN16_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN16_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN16_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 15 : Set as output pin 15 */
#define GPIO_DIRSET_PIN15_Pos       ( 15UL )                           /*!< Position of PIN15 field. */
#define GPIO_DIRSET_PIN15_Msk       ( 0x1UL << GPIO_DIRSET_PIN15_Pos ) /*!< Bit mask of PIN15 field. */
#define GPIO_DIRSET_PIN15_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN15_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN15_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 14 : Set as output pin 14 */
#define GPIO_DIRSET_PIN14_Pos       ( 14UL )                           /*!< Position of PIN14 field. */
#define GPIO_DIRSET_PIN14_Msk       ( 0x1UL << GPIO_DIRSET_PIN14_Pos ) /*!< Bit mask of PIN14 field. */
#define GPIO_DIRSET_PIN14_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN14_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN14_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 13 : Set as output pin 13 */
#define GPIO_DIRSET_PIN13_Pos       ( 13UL )                           /*!< Position of PIN13 field. */
#define GPIO_DIRSET_PIN13_Msk       ( 0x1UL << GPIO_DIRSET_PIN13_Pos ) /*!< Bit mask of PIN13 field. */
#define GPIO_DIRSET_PIN13_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN13_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN13_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 12 : Set as output pin 12 */
#define GPIO_DIRSET_PIN12_Pos       ( 12UL )                           /*!< Position of PIN12 field. */
#define GPIO_DIRSET_PIN12_Msk       ( 0x1UL << GPIO_DIRSET_PIN12_Pos ) /*!< Bit mask of PIN12 field. */
#define GPIO_DIRSET_PIN12_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN12_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN12_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 11 : Set as output pin 11 */
#define GPIO_DIRSET_PIN11_Pos       ( 11UL )                           /*!< Position of PIN11 field. */
#define GPIO_DIRSET_PIN11_Msk       ( 0x1UL << GPIO_DIRSET_PIN11_Pos ) /*!< Bit mask of PIN11 field. */
#define GPIO_DIRSET_PIN11_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN11_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN11_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 10 : Set as output pin 10 */
#define GPIO_DIRSET_PIN10_Pos       ( 10UL )                           /*!< Position of PIN10 field. */
#define GPIO_DIRSET_PIN10_Msk       ( 0x1UL << GPIO_DIRSET_PIN10_Pos ) /*!< Bit mask of PIN10 field. */
#define GPIO_DIRSET_PIN10_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN10_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN10_Set       ( 1UL )                            /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 9 : Set as output pin 9 */
#define GPIO_DIRSET_PIN9_Pos        ( 9UL )                           /*!< Position of PIN9 field. */
#define GPIO_DIRSET_PIN9_Msk        ( 0x1UL << GPIO_DIRSET_PIN9_Pos ) /*!< Bit mask of PIN9 field. */
#define GPIO_DIRSET_PIN9_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN9_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN9_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 8 : Set as output pin 8 */
#define GPIO_DIRSET_PIN8_Pos        ( 8UL )                           /*!< Position of PIN8 field. */
#define GPIO_DIRSET_PIN8_Msk        ( 0x1UL << GPIO_DIRSET_PIN8_Pos ) /*!< Bit mask of PIN8 field. */
#define GPIO_DIRSET_PIN8_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN8_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN8_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 7 : Set as output pin 7 */
#define GPIO_DIRSET_PIN7_Pos        ( 7UL )                           /*!< Position of PIN7 field. */
#define GPIO_DIRSET_PIN7_Msk        ( 0x1UL << GPIO_DIRSET_PIN7_Pos ) /*!< Bit mask of PIN7 field. */
#define GPIO_DIRSET_PIN7_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN7_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN7_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 6 : Set as output pin 6 */
#define GPIO_DIRSET_PIN6_Pos        ( 6UL )                           /*!< Position of PIN6 field. */
#define GPIO_DIRSET_PIN6_Msk        ( 0x1UL << GPIO_DIRSET_PIN6_Pos ) /*!< Bit mask of PIN6 field. */
#define GPIO_DIRSET_PIN6_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN6_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN6_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 5 : Set as output pin 5 */
#define GPIO_DIRSET_PIN5_Pos        ( 5UL )                           /*!< Position of PIN5 field. */
#define GPIO_DIRSET_PIN5_Msk        ( 0x1UL << GPIO_DIRSET_PIN5_Pos ) /*!< Bit mask of PIN5 field. */
#define GPIO_DIRSET_PIN5_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN5_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN5_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 4 : Set as output pin 4 */
#define GPIO_DIRSET_PIN4_Pos        ( 4UL )                           /*!< Position of PIN4 field. */
#define GPIO_DIRSET_PIN4_Msk        ( 0x1UL << GPIO_DIRSET_PIN4_Pos ) /*!< Bit mask of PIN4 field. */
#define GPIO_DIRSET_PIN4_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN4_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN4_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* Bit 3 : Set as output pin 3 */
#define GPIO_DIRSET_PIN3_Pos        ( 3UL )                           /*!< Position of PIN3 field. */
#define GPIO_DIRSET_PIN3_Msk        ( 0x1UL << GPIO_DIRSET_PIN3_Pos ) /*!< Bit mask of PIN3 field. */
#define GPIO_DIRSET_PIN3_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRSET_PIN3_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRSET_PIN3_Set        ( 1UL )                           /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

