FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 22 : Set as input pin 22 */
#define GPIO_DIRCLR_PIN22_Pos       ( 22UL )                           /*!< Position of PIN22 field. */
#define GPIO_DIRCLR_PIN22_Msk       ( 0x1UL << GPIO_DIRCLR_PIN22_Pos ) /*!< Bit mask of PIN22 field. */
#define GPIO_DIRCLR_PIN22_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN22_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN22_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 21 : Set as input pin 21 */
#define GPIO_DIRCLR_PIN21_Pos       ( 21UL )                           /*!< Position of PIN21 field. */
#define GPIO_DIRCLR_PIN21_Msk       ( 0x1UL << GPIO_DIRCLR_PIN21_Pos ) /*!< Bit mask of PIN21 field. */
#define GPIO_DIRCLR_PIN21_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN21_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN21_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 20 : Set as input pin 20 */
#define GPIO_DIRCLR_PIN20_Pos       ( 20UL )                           /*!< Position of PIN20 field. */
#define GPIO_DIRCLR_PIN20_Msk       ( 0x1UL << GPIO_DIRCLR_PIN20_Pos ) /*!< Bit mask of PIN20 field. */
#define GPIO_DIRCLR_PIN20_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN20_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN20_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 19 : Set as input pin 19 */
#define GPIO_DIRCLR_PIN19_Pos       ( 19UL )                           /*!< Position of PIN19 field. */
#define GPIO_DIRCLR_PIN19_Msk       ( 0x1UL << GPIO_DIRCLR_PIN19_Pos ) /*!< Bit mask of PIN19 field. */
#define GPIO_DIRCLR_PIN19_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN19_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN19_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 18 : Set as input pin 18 */
#define GPIO_DIRCLR_PIN18_Pos       ( 18UL )                           /*!< Position of PIN18 field. */
#define GPIO_DIRCLR_PIN18_Msk       ( 0x1UL << GPIO_DIRCLR_PIN18_Pos ) /*!< Bit mask of PIN18 field. */
#define GPIO_DIRCLR_PIN18_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN18_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN18_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 17 : Set as input pin 17 */
#define GPIO_DIRCLR_PIN17_Pos       ( 17UL )                           /*!< Position of PIN17 field. */
#define GPIO_DIRCLR_PIN17_Msk       ( 0x1UL << GPIO_DIRCLR_PIN17_Pos ) /*!< Bit mask of PIN17 field. */
#define GPIO_DIRCLR_PIN17_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN17_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN17_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 16 : Set as input pin 16 */
#define GPIO_DIRCLR_PIN16_Pos       ( 16UL )                           /*!< Position of PIN16 field. */
#define GPIO_DIRCLR_PIN16_Msk       ( 0x1UL << GPIO_DIRCLR_PIN16_Pos ) /*!< Bit mask of PIN16 field. */
#define GPIO_DIRCLR_PIN16_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN16_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN16_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 15 : Set as input pin 15 */
#define GPIO_DIRCLR_PIN15_Pos       ( 15UL )                           /*!< Position of PIN15 field. */
#define GPIO_DIRCLR_PIN15_Msk       ( 0x1UL << GPIO_DIRCLR_PIN15_Pos ) /*!< Bit mask of PIN15 field. */
#define GPIO_DIRCLR_PIN15_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN15_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN15_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 14 : Set as input pin 14 */
#define GPIO_DIRCLR_PIN14_Pos       ( 14UL )                           /*!< Position of PIN14 field. */
#define GPIO_DIRCLR_PIN14_Msk       ( 0x1UL << GPIO_DIRCLR_PIN14_Pos ) /*!< Bit mask of PIN14 field. */
#define GPIO_DIRCLR_PIN14_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN14_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN14_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 13 : Set as input pin 13 */
#define GPIO_DIRCLR_PIN13_Pos       ( 13UL )                           /*!< Position of PIN13 field. */
#define GPIO_DIRCLR_PIN13_Msk       ( 0x1UL << GPIO_DIRCLR_PIN13_Pos ) /*!< Bit mask of PIN13 field. */
#define GPIO_DIRCLR_PIN13_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN13_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN13_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 12 : Set as input pin 12 */
#define GPIO_DIRCLR_PIN12_Pos       ( 12UL )                           /*!< Position of PIN12 field. */
#define GPIO_DIRCLR_PIN12_Msk       ( 0x1UL << GPIO_DIRCLR_PIN12_Pos ) /*!< Bit mask of PIN12 field. */
#define GPIO_DIRCLR_PIN12_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN12_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN12_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 11 : Set as input pin 11 */
#define GPIO_DIRCLR_PIN11_Pos       ( 11UL )                           /*!< Position of PIN11 field. */
#define GPIO_DIRCLR_PIN11_Msk       ( 0x1UL << GPIO_DIRCLR_PIN11_Pos ) /*!< Bit mask of PIN11 field. */
#define GPIO_DIRCLR_PIN11_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN11_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN11_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 10 : Set as input pin 10 */
#define GPIO_DIRCLR_PIN10_Pos       ( 10UL )                           /*!< Position of PIN10 field. */
#define GPIO_DIRCLR_PIN10_Msk       ( 0x1UL << GPIO_DIRCLR_PIN10_Pos ) /*!< Bit mask of PIN10 field. */
#define GPIO_DIRCLR_PIN10_Input     ( 0UL )                            /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN10_Output    ( 1UL )                            /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN10_Clear     ( 1UL )                            /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 9 : Set as input pin 9 */
#define GPIO_DIRCLR_PIN9_Pos        ( 9UL )                           /*!< Position of PIN9 field. */
#define GPIO_DIRCLR_PIN9_Msk        ( 0x1UL << GPIO_DIRCLR_PIN9_Pos ) /*!< Bit mask of PIN9 field. */
#define GPIO_DIRCLR_PIN9_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN9_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN9_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 8 : Set as input pin 8 */
#define GPIO_DIRCLR_PIN8_Pos        ( 8UL )                           /*!< Position of PIN8 field. */
#define GPIO_DIRCLR_PIN8_Msk        ( 0x1UL << GPIO_DIRCLR_PIN8_Pos ) /*!< Bit mask of PIN8 field. */
#define GPIO_DIRCLR_PIN8_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN8_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN8_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

/* Bit 7 : Set as input pin 7 */
#define GPIO_DIRCLR_PIN7_Pos        ( 7UL )                           /*!< Position of PIN7 field. */
#define GPIO_DIRCLR_PIN7_Msk        ( 0x1UL << GPIO_DIRCLR_PIN7_Pos ) /*!< Bit mask of PIN7 field. */
#define GPIO_DIRCLR_PIN7_Input      ( 0UL )                           /*!< Read: pin set as input */
#define GPIO_DIRCLR_PIN7_Output     ( 1UL )                           /*!< Read: pin set as output */
#define GPIO_DIRCLR_PIN7_Clear      ( 1UL )                           /*!< Write: writing a '1' sets pin to input; writing a '0' has no effect */

