FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 16 : Status on whether PIN[16] has met criteria set in PIN_CNF[16].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN16_Pos           ( 16UL )                          /*!< Position of PIN16 field. */
#define GPIO_LATCH_PIN16_Msk           ( 0x1UL << GPIO_LATCH_PIN16_Pos ) /*!< Bit mask of PIN16 field. */
#define GPIO_LATCH_PIN16_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN16_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 15 : Status on whether PIN[15] has met criteria set in PIN_CNF[15].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN15_Pos           ( 15UL )                          /*!< Position of PIN15 field. */
#define GPIO_LATCH_PIN15_Msk           ( 0x1UL << GPIO_LATCH_PIN15_Pos ) /*!< Bit mask of PIN15 field. */
#define GPIO_LATCH_PIN15_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN15_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 14 : Status on whether PIN[14] has met criteria set in PIN_CNF[14].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN14_Pos           ( 14UL )                          /*!< Position of PIN14 field. */
#define GPIO_LATCH_PIN14_Msk           ( 0x1UL << GPIO_LATCH_PIN14_Pos ) /*!< Bit mask of PIN14 field. */
#define GPIO_LATCH_PIN14_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN14_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 13 : Status on whether PIN[13] has met criteria set in PIN_CNF[13].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN13_Pos           ( 13UL )                          /*!< Position of PIN13 field. */
#define GPIO_LATCH_PIN13_Msk           ( 0x1UL << GPIO_LATCH_PIN13_Pos ) /*!< Bit mask of PIN13 field. */
#define GPIO_LATCH_PIN13_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN13_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 12 : Status on whether PIN[12] has met criteria set in PIN_CNF[12].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN12_Pos           ( 12UL )                          /*!< Position of PIN12 field. */
#define GPIO_LATCH_PIN12_Msk           ( 0x1UL << GPIO_LATCH_PIN12_Pos ) /*!< Bit mask of PIN12 field. */
#define GPIO_LATCH_PIN12_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN12_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 11 : Status on whether PIN[11] has met criteria set in PIN_CNF[11].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN11_Pos           ( 11UL )                          /*!< Position of PIN11 field. */
#define GPIO_LATCH_PIN11_Msk           ( 0x1UL << GPIO_LATCH_PIN11_Pos ) /*!< Bit mask of PIN11 field. */
#define GPIO_LATCH_PIN11_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN11_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 10 : Status on whether PIN[10] has met criteria set in PIN_CNF[10].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN10_Pos           ( 10UL )                          /*!< Position of PIN10 field. */
#define GPIO_LATCH_PIN10_Msk           ( 0x1UL << GPIO_LATCH_PIN10_Pos ) /*!< Bit mask of PIN10 field. */
#define GPIO_LATCH_PIN10_NotLatched    ( 0UL )                           /*!< Criteria has not been met */
#define GPIO_LATCH_PIN10_Latched       ( 1UL )                           /*!< Criteria has been met */

/* Bit 9 : Status on whether PIN[9] has met criteria set in PIN_CNF[9].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN9_Pos            ( 9UL )                          /*!< Position of PIN9 field. */
#define GPIO_LATCH_PIN9_Msk            ( 0x1UL << GPIO_LATCH_PIN9_Pos ) /*!< Bit mask of PIN9 field. */
#define GPIO_LATCH_PIN9_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN9_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 8 : Status on whether PIN[8] has met criteria set in PIN_CNF[8].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN8_Pos            ( 8UL )                          /*!< Position of PIN8 field. */
#define GPIO_LATCH_PIN8_Msk            ( 0x1UL << GPIO_LATCH_PIN8_Pos ) /*!< Bit mask of PIN8 field. */
#define GPIO_LATCH_PIN8_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN8_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 7 : Status on whether PIN[7] has met criteria set in PIN_CNF[7].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN7_Pos            ( 7UL )                          /*!< Position of PIN7 field. */
#define GPIO_LATCH_PIN7_Msk            ( 0x1UL << GPIO_LATCH_PIN7_Pos ) /*!< Bit mask of PIN7 field. */
#define GPIO_LATCH_PIN7_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN7_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 6 : Status on whether PIN[6] has met criteria set in PIN_CNF[6].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN6_Pos            ( 6UL )                          /*!< Position of PIN6 field. */
#define GPIO_LATCH_PIN6_Msk            ( 0x1UL << GPIO_LATCH_PIN6_Pos ) /*!< Bit mask of PIN6 field. */
#define GPIO_LATCH_PIN6_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN6_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 5 : Status on whether PIN[5] has met criteria set in PIN_CNF[5].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN5_Pos            ( 5UL )                          /*!< Position of PIN5 field. */
#define GPIO_LATCH_PIN5_Msk            ( 0x1UL << GPIO_LATCH_PIN5_Pos ) /*!< Bit mask of PIN5 field. */
#define GPIO_LATCH_PIN5_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN5_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 4 : Status on whether PIN[4] has met criteria set in PIN_CNF[4].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN4_Pos            ( 4UL )                          /*!< Position of PIN4 field. */
#define GPIO_LATCH_PIN4_Msk            ( 0x1UL << GPIO_LATCH_PIN4_Pos ) /*!< Bit mask of PIN4 field. */
#define GPIO_LATCH_PIN4_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN4_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 3 : Status on whether PIN[3] has met criteria set in PIN_CNF[3].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN3_Pos            ( 3UL )                          /*!< Position of PIN3 field. */
#define GPIO_LATCH_PIN3_Msk            ( 0x1UL << GPIO_LATCH_PIN3_Pos ) /*!< Bit mask of PIN3 field. */
#define GPIO_LATCH_PIN3_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN3_Latched        ( 1UL )                          /*!< Criteria has been met */

