FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 2 : Status on whether PIN[2] has met criteria set in PIN_CNF[2].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN2_Pos            ( 2UL )                          /*!< Position of PIN2 field. */
#define GPIO_LATCH_PIN2_Msk            ( 0x1UL << GPIO_LATCH_PIN2_Pos ) /*!< Bit mask of PIN2 field. */
#define GPIO_LATCH_PIN2_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN2_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 1 : Status on whether PIN[1] has met criteria set in PIN_CNF[1].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN1_Pos            ( 1UL )                          /*!< Position of PIN1 field. */
#define GPIO_LATCH_PIN1_Msk            ( 0x1UL << GPIO_LATCH_PIN1_Pos ) /*!< Bit mask of PIN1 field. */
#define GPIO_LATCH_PIN1_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN1_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Bit 0 : Status on whether PIN[0] has met criteria set in PIN_CNF[0].SENSE register. Write '1' to clear. */
#define GPIO_LATCH_PIN0_Pos            ( 0UL )                          /*!< Position of PIN0 field. */
#define GPIO_LATCH_PIN0_Msk            ( 0x1UL << GPIO_LATCH_PIN0_Pos ) /*!< Bit mask of PIN0 field. */
#define GPIO_LATCH_PIN0_NotLatched     ( 0UL )                          /*!< Criteria has not been met */
#define GPIO_LATCH_PIN0_Latched        ( 1UL )                          /*!< Criteria has been met */

/* Register: GPIO_DETECTMODE */
/* Description: Select between default DETECT signal behavior and LDETECT mode (For non-secure pin only) */

/* Bit 0 : Select between default DETECT signal behavior and LDETECT mode */
#define GPIO_DETECTMODE_DETECTMODE_Pos        ( 0UL )                                     /*!< Position of DETECTMODE field. */
#define GPIO_DETECTMODE_DETECTMODE_Msk        ( 0x1UL << GPIO_DETECTMODE_DETECTMODE_Pos ) /*!< Bit mask of DETECTMODE field. */
#define GPIO_DETECTMODE_DETECTMODE_Default    ( 0UL )                                     /*!< DETECT directly connected to PIN DETECT signals */
#define GPIO_DETECTMODE_DETECTMODE_LDETECT    ( 1UL )                                     /*!< Use the latched LDETECT behavior */

/* Register: GPIO_DETECTMODE_SEC */
/* Description: Select between default DETECT signal behavior and LDETECT mode (For secure pin only) */

/* Bit 0 : Select between default DETECT signal behavior and LDETECT mode */
#define GPIO_DETECTMODE_SEC_DETECTMODE_Pos        ( 0UL )                                         /*!< Position of DETECTMODE field. */
#define GPIO_DETECTMODE_SEC_DETECTMODE_Msk        ( 0x1UL << GPIO_DETECTMODE_SEC_DETECTMODE_Pos ) /*!< Bit mask of DETECTMODE field. */
#define GPIO_DETECTMODE_SEC_DETECTMODE_Default    ( 0UL )                                         /*!< DETECT directly connected to PIN DETECT signals */
#define GPIO_DETECTMODE_SEC_DETECTMODE_LDETECT    ( 1UL )                                         /*!< Use the latched LDETECT behavior */

/* Register: GPIO_PIN_CNF */
/* Description: Description collection: Configuration of GPIO pins */

/* Bits 30..28 : Select which MCU/Subsystem controls this pin Note: this field is only accessible from secure code. */
#define GPIO_PIN_CNF_MCUSEL_Pos           ( 28UL )                             /*!< Position of MCUSEL field. */
#define GPIO_PIN_CNF_MCUSEL_Msk           ( 0x7UL << GPIO_PIN_CNF_MCUSEL_Pos ) /*!< Bit mask of MCUSEL field. */
#define GPIO_PIN_CNF_MCUSEL_AppMCU        ( 0x0UL )                            /*!< Application MCU */
#define GPIO_PIN_CNF_MCUSEL_NetworkMCU    ( 0x1UL )                            /*!< Network MCU */
#define GPIO_PIN_CNF_MCUSEL_Peripheral    ( 0x3UL )                            /*!< Peripheral with dedicated pins */
#define GPIO_PIN_CNF_MCUSEL_TND           ( 0x7UL )                            /*!< Trace and Debug Subsystem */

/* Bits 17..16 : Pin sensing mechanism */
#define GPIO_PIN_CNF_SENSE_Pos            ( 16UL )                            /*!< Position of SENSE field. */
#define GPIO_PIN_CNF_SENSE_Msk            ( 0x3UL << GPIO_PIN_CNF_SENSE_Pos ) /*!< Bit mask of SENSE field. */
#define GPIO_PIN_CNF_SENSE_Disabled       ( 0UL )                             /*!< Disabled */
#define GPIO_PIN_CNF_SENSE_High           ( 2UL )                             /*!< Sense for high level */
#define GPIO_PIN_CNF_SENSE_Low            ( 3UL )                             /*!< Sense for low level */

/* Bits 11..8 : Drive configuration */
#define GPIO_PIN_CNF_DRIVE_Pos            ( 8UL )                             /*!< Position of DRIVE field. */
#define GPIO_PIN_CNF_DRIVE_Msk            ( 0xFUL << GPIO_PIN_CNF_DRIVE_Pos ) /*!< Bit mask of DRIVE field. */
#define GPIO_PIN_CNF_DRIVE_S0S1           ( 0UL )                             /*!< Standard '0', standard '1' */
#define GPIO_PIN_CNF_DRIVE_H0S1           ( 1UL )                             /*!< High drive '0', standard '1' */
#define GPIO_PIN_CNF_DRIVE_S0H1           ( 2UL )                             /*!< Standard '0', high drive '1' */
#define GPIO_PIN_CNF_DRIVE_H0H1           ( 3UL )                             /*!< High drive '0', high 'drive '1'' */
#define GPIO_PIN_CNF_DRIVE_D0S1           ( 4UL )                             /*!< Disconnect '0', standard '1' (normally used for wired-or connections) */
#define GPIO_PIN_CNF_DRIVE_D0H1           ( 5UL )                             /*!< Disconnect '0', high drive '1' (normally used for wired-or connections) */
#define GPIO_PIN_CNF_DRIVE_S0D1           ( 6UL )                             /*!< Standard '0', disconnect '1' (normally used for wired-and connections) */
#define GPIO_PIN_CNF_DRIVE_H0D1           ( 7UL )                             /*!< High drive '0', disconnect '1' (normally used for wired-and connections) */
#define GPIO_PIN_CNF_DRIVE_E0E1           ( 11UL )                            /*!< Extra high drive '0', extra high drive '1' */

/* Bits 3..2 : Pull configuration */
#define GPIO_PIN_CNF_PULL_Pos             ( 2UL )                            /*!< Position of PULL field. */
#define GPIO_PIN_CNF_PULL_Msk             ( 0x3UL << GPIO_PIN_CNF_PULL_Pos ) /*!< Bit mask of PULL field. */
#define GPIO_PIN_CNF_PULL_Disabled        ( 0UL )                            /*!< No pull */
#define GPIO_PIN_CNF_PULL_Pulldown        ( 1UL )                            /*!< Pull down on pin */
#define GPIO_PIN_CNF_PULL_Pullup          ( 3UL )                            /*!< Pull up on pin */

/* Bit 1 : Connect or disconnect input buffer */
#define GPIO_PIN_CNF_INPUT_Pos            ( 1UL )                             /*!< Position of INPUT field. */
#define GPIO_PIN_CNF_INPUT_Msk            ( 0x1UL << GPIO_PIN_CNF_INPUT_Pos ) /*!< Bit mask of INPUT field. */
#define GPIO_PIN_CNF_INPUT_Connect        ( 0UL )                             /*!< Connect input buffer */
#define GPIO_PIN_CNF_INPUT_Disconnect     ( 1UL )                             /*!< Disconnect input buffer */

/* Bit 0 : Pin direction. Same physical register as DIR register */
#define GPIO_PIN_CNF_DIR_Pos              ( 0UL )                           /*!< Position of DIR field. */
#define GPIO_PIN_CNF_DIR_Msk              ( 0x1UL << GPIO_PIN_CNF_DIR_Pos ) /*!< Bit mask of DIR field. */
#define GPIO_PIN_CNF_DIR_Input            ( 0UL )                           /*!< Configure pin as an input pin */
#define GPIO_PIN_CNF_DIR_Output           ( 1UL )                           /*!< Configure pin as an output pin */


/* Peripheral: POWER */
/* Description: Power control */

/* Register: POWER_TASKS_CONSTLAT */
/* Description: Enable Constant Latency mode */

/* Bit 0 : Enable Constant Latency mode */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos        ( 0UL )                                              /*!< Position of TASKS_CONSTLAT field. */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Msk        ( 0x1UL << POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos ) /*!< Bit mask of TASKS_CONSTLAT field. */
#define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger    ( 1UL )                                              /*!< Trigger task */

/* Register: POWER_TASKS_LOWPWR */
/* Description: Enable Low-Power mode (variable latency) */

/* Bit 0 : Enable Low-Power mode (variable latency) */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos        ( 0UL )                                          /*!< Position of TASKS_LOWPWR field. */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Msk        ( 0x1UL << POWER_TASKS_LOWPWR_TASKS_LOWPWR_Pos ) /*!< Bit mask of TASKS_LOWPWR field. */
#define POWER_TASKS_LOWPWR_TASKS_LOWPWR_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: POWER_SUBSCRIBE_CONSTLAT */
/* Description: Subscribe configuration for task CONSTLAT */

/* Bit 31 :   */
#define POWER_SUBSCRIBE_CONSTLAT_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define POWER_SUBSCRIBE_CONSTLAT_EN_Msk         ( 0x1UL << POWER_SUBSCRIBE_CONSTLAT_EN_Pos ) /*!< Bit mask of EN field. */
#define POWER_SUBSCRIBE_CONSTLAT_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define POWER_SUBSCRIBE_CONSTLAT_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CONSTLAT will subscribe to */
#define POWER_SUBSCRIBE_CONSTLAT_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define POWER_SUBSCRIBE_CONSTLAT_CHIDX_Msk      ( 0xFFUL << POWER_SUBSCRIBE_CONSTLAT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: POWER_SUBSCRIBE_LOWPWR */
/* Description: Subscribe configuration for task LOWPWR */

/* Bit 31 :   */
#define POWER_SUBSCRIBE_LOWPWR_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define POWER_SUBSCRIBE_LOWPWR_EN_Msk         ( 0x1UL << POWER_SUBSCRIBE_LOWPWR_EN_Pos ) /*!< Bit mask of EN field. */
#define POWER_SUBSCRIBE_LOWPWR_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define POWER_SUBSCRIBE_LOWPWR_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task LOWPWR will subscribe to */
#define POWER_SUBSCRIBE_LOWPWR_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define POWER_SUBSCRIBE_LOWPWR_CHIDX_Msk      ( 0xFFUL << POWER_SUBSCRIBE_LOWPWR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

