FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: POWER_EVENTS_POFWARN */
/* Description: Power failure warning */

/* Bit 0 : Power failure warning */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos             ( 0UL )                                              /*!< Position of EVENTS_POFWARN field. */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Msk             ( 0x1UL << POWER_EVENTS_POFWARN_EVENTS_POFWARN_Pos ) /*!< Bit mask of EVENTS_POFWARN field. */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define POWER_EVENTS_POFWARN_EVENTS_POFWARN_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: POWER_EVENTS_SLEEPENTER */
/* Description: CPU entered WFI/WFE sleep */

/* Bit 0 : CPU entered WFI/WFE sleep */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos             ( 0UL )                                                    /*!< Position of EVENTS_SLEEPENTER field. */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Msk             ( 0x1UL << POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Pos ) /*!< Bit mask of EVENTS_SLEEPENTER field. */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_NotGenerated    ( 0UL )                                                    /*!< Event not generated */
#define POWER_EVENTS_SLEEPENTER_EVENTS_SLEEPENTER_Generated       ( 1UL )                                                    /*!< Event generated */

/* Register: POWER_EVENTS_SLEEPEXIT */
/* Description: CPU exited WFI/WFE sleep */

/* Bit 0 : CPU exited WFI/WFE sleep */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos             ( 0UL )                                                  /*!< Position of EVENTS_SLEEPEXIT field. */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Msk             ( 0x1UL << POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos ) /*!< Bit mask of EVENTS_SLEEPEXIT field. */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_NotGenerated    ( 0UL )                                                  /*!< Event not generated */
#define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Generated       ( 1UL )                                                  /*!< Event generated */

/* Register: POWER_PUBLISH_POFWARN */
/* Description: Publish configuration for event POFWARN */

/* Bit 31 :   */
#define POWER_PUBLISH_POFWARN_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define POWER_PUBLISH_POFWARN_EN_Msk         ( 0x1UL << POWER_PUBLISH_POFWARN_EN_Pos ) /*!< Bit mask of EN field. */
#define POWER_PUBLISH_POFWARN_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define POWER_PUBLISH_POFWARN_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event POFWARN will publish to. */
#define POWER_PUBLISH_POFWARN_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define POWER_PUBLISH_POFWARN_CHIDX_Msk      ( 0xFFUL << POWER_PUBLISH_POFWARN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: POWER_PUBLISH_SLEEPENTER */
/* Description: Publish configuration for event SLEEPENTER */

/* Bit 31 :   */
#define POWER_PUBLISH_SLEEPENTER_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define POWER_PUBLISH_SLEEPENTER_EN_Msk         ( 0x1UL << POWER_PUBLISH_SLEEPENTER_EN_Pos ) /*!< Bit mask of EN field. */
#define POWER_PUBLISH_SLEEPENTER_EN_Disabled    ( 0UL )                                      /*!< Disable publishing */
#define POWER_PUBLISH_SLEEPENTER_EN_Enabled     ( 1UL )                                      /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event SLEEPENTER will publish to. */
#define POWER_PUBLISH_SLEEPENTER_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define POWER_PUBLISH_SLEEPENTER_CHIDX_Msk      ( 0xFFUL << POWER_PUBLISH_SLEEPENTER_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: POWER_PUBLISH_SLEEPEXIT */
/* Description: Publish configuration for event SLEEPEXIT */

/* Bit 31 :   */
#define POWER_PUBLISH_SLEEPEXIT_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define POWER_PUBLISH_SLEEPEXIT_EN_Msk         ( 0x1UL << POWER_PUBLISH_SLEEPEXIT_EN_Pos ) /*!< Bit mask of EN field. */
#define POWER_PUBLISH_SLEEPEXIT_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define POWER_PUBLISH_SLEEPEXIT_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event SLEEPEXIT will publish to. */
#define POWER_PUBLISH_SLEEPEXIT_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define POWER_PUBLISH_SLEEPEXIT_CHIDX_Msk      ( 0xFFUL << POWER_PUBLISH_SLEEPEXIT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: POWER_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 6 : Enable or disable interrupt for event SLEEPEXIT */
#define POWER_INTEN_SLEEPEXIT_Pos          ( 6UL )                                /*!< Position of SLEEPEXIT field. */
#define POWER_INTEN_SLEEPEXIT_Msk          ( 0x1UL << POWER_INTEN_SLEEPEXIT_Pos ) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTEN_SLEEPEXIT_Disabled     ( 0UL )                                /*!< Disable */
#define POWER_INTEN_SLEEPEXIT_Enabled      ( 1UL )                                /*!< Enable */

/* Bit 5 : Enable or disable interrupt for event SLEEPENTER */
#define POWER_INTEN_SLEEPENTER_Pos         ( 5UL )                                 /*!< Position of SLEEPENTER field. */
#define POWER_INTEN_SLEEPENTER_Msk         ( 0x1UL << POWER_INTEN_SLEEPENTER_Pos ) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTEN_SLEEPENTER_Disabled    ( 0UL )                                 /*!< Disable */
#define POWER_INTEN_SLEEPENTER_Enabled     ( 1UL )                                 /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event POFWARN */
#define POWER_INTEN_POFWARN_Pos            ( 2UL )                              /*!< Position of POFWARN field. */
#define POWER_INTEN_POFWARN_Msk            ( 0x1UL << POWER_INTEN_POFWARN_Pos ) /*!< Bit mask of POFWARN field. */
#define POWER_INTEN_POFWARN_Disabled       ( 0UL )                              /*!< Disable */
#define POWER_INTEN_POFWARN_Enabled        ( 1UL )                              /*!< Enable */

/* Register: POWER_INTENSET */
/* Description: Enable interrupt */

/* Bit 6 : Write '1' to enable interrupt for event SLEEPEXIT */
#define POWER_INTENSET_SLEEPEXIT_Pos          ( 6UL )                                   /*!< Position of SLEEPEXIT field. */
#define POWER_INTENSET_SLEEPEXIT_Msk          ( 0x1UL << POWER_INTENSET_SLEEPEXIT_Pos ) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTENSET_SLEEPEXIT_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define POWER_INTENSET_SLEEPEXIT_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define POWER_INTENSET_SLEEPEXIT_Set          ( 1UL )                                   /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event SLEEPENTER */
#define POWER_INTENSET_SLEEPENTER_Pos         ( 5UL )                                    /*!< Position of SLEEPENTER field. */
#define POWER_INTENSET_SLEEPENTER_Msk         ( 0x1UL << POWER_INTENSET_SLEEPENTER_Pos ) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTENSET_SLEEPENTER_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define POWER_INTENSET_SLEEPENTER_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define POWER_INTENSET_SLEEPENTER_Set         ( 1UL )                                    /*!< Enable */

/* Bit 2 : Write '1' to enable interrupt for event POFWARN */
#define POWER_INTENSET_POFWARN_Pos            ( 2UL )                                 /*!< Position of POFWARN field. */
#define POWER_INTENSET_POFWARN_Msk            ( 0x1UL << POWER_INTENSET_POFWARN_Pos ) /*!< Bit mask of POFWARN field. */
#define POWER_INTENSET_POFWARN_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define POWER_INTENSET_POFWARN_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define POWER_INTENSET_POFWARN_Set            ( 1UL )                                 /*!< Enable */

/* Register: POWER_INTENCLR */
/* Description: Disable interrupt */

/* Bit 6 : Write '1' to disable interrupt for event SLEEPEXIT */
#define POWER_INTENCLR_SLEEPEXIT_Pos          ( 6UL )                                   /*!< Position of SLEEPEXIT field. */
#define POWER_INTENCLR_SLEEPEXIT_Msk          ( 0x1UL << POWER_INTENCLR_SLEEPEXIT_Pos ) /*!< Bit mask of SLEEPEXIT field. */
#define POWER_INTENCLR_SLEEPEXIT_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define POWER_INTENCLR_SLEEPEXIT_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define POWER_INTENCLR_SLEEPEXIT_Clear        ( 1UL )                                   /*!< Disable */

/* Bit 5 : Write '1' to disable interrupt for event SLEEPENTER */
#define POWER_INTENCLR_SLEEPENTER_Pos         ( 5UL )                                    /*!< Position of SLEEPENTER field. */
#define POWER_INTENCLR_SLEEPENTER_Msk         ( 0x1UL << POWER_INTENCLR_SLEEPENTER_Pos ) /*!< Bit mask of SLEEPENTER field. */
#define POWER_INTENCLR_SLEEPENTER_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define POWER_INTENCLR_SLEEPENTER_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define POWER_INTENCLR_SLEEPENTER_Clear       ( 1UL )                                    /*!< Disable */

/* Bit 2 : Write '1' to disable interrupt for event POFWARN */
#define POWER_INTENCLR_POFWARN_Pos            ( 2UL )                                 /*!< Position of POFWARN field. */
#define POWER_INTENCLR_POFWARN_Msk            ( 0x1UL << POWER_INTENCLR_POFWARN_Pos ) /*!< Bit mask of POFWARN field. */
#define POWER_INTENCLR_POFWARN_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define POWER_INTENCLR_POFWARN_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define POWER_INTENCLR_POFWARN_Clear          ( 1UL )                                 /*!< Disable */

