FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: RADIO_TASKS_CCASTART */
/* Description: Start the clear channel assessment used in IEEE 802.15.4 mode */

/* Bit 0 : Start the clear channel assessment used in IEEE 802.15.4 mode */
#define RADIO_TASKS_CCASTART_TASKS_CCASTART_Pos        ( 0UL )                                              /*!< Position of TASKS_CCASTART field. */
#define RADIO_TASKS_CCASTART_TASKS_CCASTART_Msk        ( 0x1UL << RADIO_TASKS_CCASTART_TASKS_CCASTART_Pos ) /*!< Bit mask of TASKS_CCASTART field. */
#define RADIO_TASKS_CCASTART_TASKS_CCASTART_Trigger    ( 1UL )                                              /*!< Trigger task */

/* Register: RADIO_TASKS_CCASTOP */
/* Description: Stop the clear channel assessment */

/* Bit 0 : Stop the clear channel assessment */
#define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Pos        ( 0UL )                                            /*!< Position of TASKS_CCASTOP field. */
#define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Msk        ( 0x1UL << RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Pos ) /*!< Bit mask of TASKS_CCASTOP field. */
#define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: RADIO_SUBSCRIBE_TXEN */
/* Description: Subscribe configuration for task TXEN */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_TXEN_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_TXEN_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_TXEN_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_TXEN_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define RADIO_SUBSCRIBE_TXEN_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task TXEN will subscribe to */
#define RADIO_SUBSCRIBE_TXEN_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_TXEN_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_TXEN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_RXEN */
/* Description: Subscribe configuration for task RXEN */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_RXEN_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_RXEN_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_RXEN_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_RXEN_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define RADIO_SUBSCRIBE_RXEN_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task RXEN will subscribe to */
#define RADIO_SUBSCRIBE_RXEN_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_RXEN_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_RXEN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_START_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_START_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define RADIO_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define RADIO_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define RADIO_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define RADIO_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_DISABLE */
/* Description: Subscribe configuration for task DISABLE */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DISABLE_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_DISABLE_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_DISABLE_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_DISABLE_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define RADIO_SUBSCRIBE_DISABLE_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task DISABLE will subscribe to */
#define RADIO_SUBSCRIBE_DISABLE_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_DISABLE_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_DISABLE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_RSSISTART */
/* Description: Subscribe configuration for task RSSISTART */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_RSSISTART_EN_Pos         ( 31UL )                                      /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_RSSISTART_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_RSSISTART_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_RSSISTART_EN_Disabled    ( 0UL )                                       /*!< Disable subscription */
#define RADIO_SUBSCRIBE_RSSISTART_EN_Enabled     ( 1UL )                                       /*!< Enable subscription */

