FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 7..0 : DPPI channel that task RSSISTART will subscribe to */
#define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Pos      ( 0UL )                                           /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_RSSISTART_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_RSSISTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_RSSISTOP */
/* Description: Subscribe configuration for task RSSISTOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_RSSISTOP_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_RSSISTOP_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_RSSISTOP_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_RSSISTOP_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define RADIO_SUBSCRIBE_RSSISTOP_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task RSSISTOP will subscribe to */
#define RADIO_SUBSCRIBE_RSSISTOP_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_RSSISTOP_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_RSSISTOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_BCSTART */
/* Description: Subscribe configuration for task BCSTART */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_BCSTART_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_BCSTART_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_BCSTART_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_BCSTART_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define RADIO_SUBSCRIBE_BCSTART_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task BCSTART will subscribe to */
#define RADIO_SUBSCRIBE_BCSTART_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_BCSTART_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_BCSTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_BCSTOP */
/* Description: Subscribe configuration for task BCSTOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_BCSTOP_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_BCSTOP_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_BCSTOP_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_BCSTOP_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define RADIO_SUBSCRIBE_BCSTOP_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task BCSTOP will subscribe to */
#define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_BCSTOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_EDSTART */
/* Description: Subscribe configuration for task EDSTART */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_EDSTART_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_EDSTART_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_EDSTART_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_EDSTART_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define RADIO_SUBSCRIBE_EDSTART_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task EDSTART will subscribe to */
#define RADIO_SUBSCRIBE_EDSTART_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_EDSTART_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_EDSTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_EDSTOP */
/* Description: Subscribe configuration for task EDSTOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_EDSTOP_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_EDSTOP_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_EDSTOP_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_EDSTOP_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define RADIO_SUBSCRIBE_EDSTOP_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task EDSTOP will subscribe to */
#define RADIO_SUBSCRIBE_EDSTOP_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_EDSTOP_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_EDSTOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_CCASTART */
/* Description: Subscribe configuration for task CCASTART */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CCASTART_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_CCASTART_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_CCASTART_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_CCASTART_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define RADIO_SUBSCRIBE_CCASTART_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CCASTART will subscribe to */
#define RADIO_SUBSCRIBE_CCASTART_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_CCASTART_CHIDX_Msk      ( 0xFFUL << RADIO_SUBSCRIBE_CCASTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_CCASTOP */
/* Description: Subscribe configuration for task CCASTOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CCASTOP_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_CCASTOP_EN_Msk         ( 0x1UL << RADIO_SUBSCRIBE_CCASTOP_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_CCASTOP_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define RADIO_SUBSCRIBE_CCASTOP_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

