FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: RADIO_EVENTS_TXREADY */
/* Description: RADIO has ramped up and is ready to be started TX path */

/* Bit 0 : RADIO has ramped up and is ready to be started TX path */
#define RADIO_EVENTS_TXREADY_EVENTS_TXREADY_Pos             ( 0UL )                                              /*!< Position of EVENTS_TXREADY field. */
#define RADIO_EVENTS_TXREADY_EVENTS_TXREADY_Msk             ( 0x1UL << RADIO_EVENTS_TXREADY_EVENTS_TXREADY_Pos ) /*!< Bit mask of EVENTS_TXREADY field. */
#define RADIO_EVENTS_TXREADY_EVENTS_TXREADY_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define RADIO_EVENTS_TXREADY_EVENTS_TXREADY_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: RADIO_EVENTS_RXREADY */
/* Description: RADIO has ramped up and is ready to be started RX path */

/* Bit 0 : RADIO has ramped up and is ready to be started RX path */
#define RADIO_EVENTS_RXREADY_EVENTS_RXREADY_Pos             ( 0UL )                                              /*!< Position of EVENTS_RXREADY field. */
#define RADIO_EVENTS_RXREADY_EVENTS_RXREADY_Msk             ( 0x1UL << RADIO_EVENTS_RXREADY_EVENTS_RXREADY_Pos ) /*!< Bit mask of EVENTS_RXREADY field. */
#define RADIO_EVENTS_RXREADY_EVENTS_RXREADY_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define RADIO_EVENTS_RXREADY_EVENTS_RXREADY_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: RADIO_EVENTS_MHRMATCH */
/* Description: MAC header match found */

/* Bit 0 : MAC header match found */
#define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Pos             ( 0UL )                                                /*!< Position of EVENTS_MHRMATCH field. */
#define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Msk             ( 0x1UL << RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Pos ) /*!< Bit mask of EVENTS_MHRMATCH field. */
#define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_NotGenerated    ( 0UL )                                                /*!< Event not generated */
#define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_Generated       ( 1UL )                                                /*!< Event generated */

/* Register: RADIO_EVENTS_SYNC */
/* Description: Preamble indicator */

/* Bit 0 : Preamble indicator */
#define RADIO_EVENTS_SYNC_EVENTS_SYNC_Pos             ( 0UL )                                        /*!< Position of EVENTS_SYNC field. */
#define RADIO_EVENTS_SYNC_EVENTS_SYNC_Msk             ( 0x1UL << RADIO_EVENTS_SYNC_EVENTS_SYNC_Pos ) /*!< Bit mask of EVENTS_SYNC field. */
#define RADIO_EVENTS_SYNC_EVENTS_SYNC_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define RADIO_EVENTS_SYNC_EVENTS_SYNC_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: RADIO_EVENTS_PHYEND */
/* Description: Generated when last bit is sent on air, or received from air */

/* Bit 0 : Generated when last bit is sent on air, or received from air */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Pos             ( 0UL )                                            /*!< Position of EVENTS_PHYEND field. */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Msk             ( 0x1UL << RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Pos ) /*!< Bit mask of EVENTS_PHYEND field. */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: RADIO_EVENTS_CTEPRESENT */
/* Description: CTE is present (early warning right after receiving CTEInfo byte) */

/* Bit 0 : CTE is present (early warning right after receiving CTEInfo byte) */
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Pos             ( 0UL )                                                    /*!< Position of EVENTS_CTEPRESENT field. */
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Msk             ( 0x1UL << RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Pos ) /*!< Bit mask of EVENTS_CTEPRESENT field. */
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_NotGenerated    ( 0UL )                                                    /*!< Event not generated */
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_Generated       ( 1UL )                                                    /*!< Event generated */

/* Register: RADIO_PUBLISH_READY */
/* Description: Publish configuration for event READY */

/* Bit 31 :   */
#define RADIO_PUBLISH_READY_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define RADIO_PUBLISH_READY_EN_Msk         ( 0x1UL << RADIO_PUBLISH_READY_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_READY_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define RADIO_PUBLISH_READY_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event READY will publish to. */
#define RADIO_PUBLISH_READY_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_READY_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_READY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_ADDRESS */
/* Description: Publish configuration for event ADDRESS */

/* Bit 31 :   */
#define RADIO_PUBLISH_ADDRESS_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_PUBLISH_ADDRESS_EN_Msk         ( 0x1UL << RADIO_PUBLISH_ADDRESS_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_ADDRESS_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define RADIO_PUBLISH_ADDRESS_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ADDRESS will publish to. */
#define RADIO_PUBLISH_ADDRESS_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_ADDRESS_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_ADDRESS_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_PAYLOAD */
/* Description: Publish configuration for event PAYLOAD */

/* Bit 31 :   */
#define RADIO_PUBLISH_PAYLOAD_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_PUBLISH_PAYLOAD_EN_Msk         ( 0x1UL << RADIO_PUBLISH_PAYLOAD_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_PAYLOAD_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define RADIO_PUBLISH_PAYLOAD_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event PAYLOAD will publish to. */
#define RADIO_PUBLISH_PAYLOAD_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_PAYLOAD_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_PAYLOAD_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_END */
/* Description: Publish configuration for event END */

/* Bit 31 :   */
#define RADIO_PUBLISH_END_EN_Pos         ( 31UL )                              /*!< Position of EN field. */
#define RADIO_PUBLISH_END_EN_Msk         ( 0x1UL << RADIO_PUBLISH_END_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_END_EN_Disabled    ( 0UL )                               /*!< Disable publishing */
#define RADIO_PUBLISH_END_EN_Enabled     ( 1UL )                               /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event END will publish to. */
#define RADIO_PUBLISH_END_CHIDX_Pos      ( 0UL )                                   /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_END_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_END_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_DISABLED */
/* Description: Publish configuration for event DISABLED */

/* Bit 31 :   */
#define RADIO_PUBLISH_DISABLED_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define RADIO_PUBLISH_DISABLED_EN_Msk         ( 0x1UL << RADIO_PUBLISH_DISABLED_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_DISABLED_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define RADIO_PUBLISH_DISABLED_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event DISABLED will publish to. */
#define RADIO_PUBLISH_DISABLED_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_DISABLED_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_DISABLED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_DEVMATCH */
/* Description: Publish configuration for event DEVMATCH */

/* Bit 31 :   */
#define RADIO_PUBLISH_DEVMATCH_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define RADIO_PUBLISH_DEVMATCH_EN_Msk         ( 0x1UL << RADIO_PUBLISH_DEVMATCH_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_DEVMATCH_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define RADIO_PUBLISH_DEVMATCH_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

