FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 7..0 : DPPI channel that event DEVMATCH will publish to. */
#define RADIO_PUBLISH_DEVMATCH_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_DEVMATCH_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_DEVMATCH_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_DEVMISS */
/* Description: Publish configuration for event DEVMISS */

/* Bit 31 :   */
#define RADIO_PUBLISH_DEVMISS_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_PUBLISH_DEVMISS_EN_Msk         ( 0x1UL << RADIO_PUBLISH_DEVMISS_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_DEVMISS_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define RADIO_PUBLISH_DEVMISS_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event DEVMISS will publish to. */
#define RADIO_PUBLISH_DEVMISS_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_DEVMISS_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_DEVMISS_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_RSSIEND */
/* Description: Publish configuration for event RSSIEND */

/* Bit 31 :   */
#define RADIO_PUBLISH_RSSIEND_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_PUBLISH_RSSIEND_EN_Msk         ( 0x1UL << RADIO_PUBLISH_RSSIEND_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_RSSIEND_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define RADIO_PUBLISH_RSSIEND_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RSSIEND will publish to. */
#define RADIO_PUBLISH_RSSIEND_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_RSSIEND_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_RSSIEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_BCMATCH */
/* Description: Publish configuration for event BCMATCH */

/* Bit 31 :   */
#define RADIO_PUBLISH_BCMATCH_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_PUBLISH_BCMATCH_EN_Msk         ( 0x1UL << RADIO_PUBLISH_BCMATCH_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_BCMATCH_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define RADIO_PUBLISH_BCMATCH_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event BCMATCH will publish to. */
#define RADIO_PUBLISH_BCMATCH_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_BCMATCH_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_BCMATCH_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_CRCOK */
/* Description: Publish configuration for event CRCOK */

/* Bit 31 :   */
#define RADIO_PUBLISH_CRCOK_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define RADIO_PUBLISH_CRCOK_EN_Msk         ( 0x1UL << RADIO_PUBLISH_CRCOK_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_CRCOK_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define RADIO_PUBLISH_CRCOK_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CRCOK will publish to. */
#define RADIO_PUBLISH_CRCOK_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_CRCOK_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_CRCOK_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_CRCERROR */
/* Description: Publish configuration for event CRCERROR */

/* Bit 31 :   */
#define RADIO_PUBLISH_CRCERROR_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define RADIO_PUBLISH_CRCERROR_EN_Msk         ( 0x1UL << RADIO_PUBLISH_CRCERROR_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_CRCERROR_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define RADIO_PUBLISH_CRCERROR_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CRCERROR will publish to. */
#define RADIO_PUBLISH_CRCERROR_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_CRCERROR_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_CRCERROR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_FRAMESTART */
/* Description: Publish configuration for event FRAMESTART */

/* Bit 31 :   */
#define RADIO_PUBLISH_FRAMESTART_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define RADIO_PUBLISH_FRAMESTART_EN_Msk         ( 0x1UL << RADIO_PUBLISH_FRAMESTART_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_FRAMESTART_EN_Disabled    ( 0UL )                                      /*!< Disable publishing */
#define RADIO_PUBLISH_FRAMESTART_EN_Enabled     ( 1UL )                                      /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event FRAMESTART will publish to. */
#define RADIO_PUBLISH_FRAMESTART_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_FRAMESTART_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_FRAMESTART_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_EDEND */
/* Description: Publish configuration for event EDEND */

/* Bit 31 :   */
#define RADIO_PUBLISH_EDEND_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define RADIO_PUBLISH_EDEND_EN_Msk         ( 0x1UL << RADIO_PUBLISH_EDEND_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_EDEND_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define RADIO_PUBLISH_EDEND_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event EDEND will publish to. */
#define RADIO_PUBLISH_EDEND_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_EDEND_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_EDEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

