FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: RADIO_PUBLISH_EDSTOPPED */
/* Description: Publish configuration for event EDSTOPPED */

/* Bit 31 :   */
#define RADIO_PUBLISH_EDSTOPPED_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define RADIO_PUBLISH_EDSTOPPED_EN_Msk         ( 0x1UL << RADIO_PUBLISH_EDSTOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_EDSTOPPED_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define RADIO_PUBLISH_EDSTOPPED_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event EDSTOPPED will publish to. */
#define RADIO_PUBLISH_EDSTOPPED_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_EDSTOPPED_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_EDSTOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_CCAIDLE */
/* Description: Publish configuration for event CCAIDLE */

/* Bit 31 :   */
#define RADIO_PUBLISH_CCAIDLE_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_PUBLISH_CCAIDLE_EN_Msk         ( 0x1UL << RADIO_PUBLISH_CCAIDLE_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_CCAIDLE_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define RADIO_PUBLISH_CCAIDLE_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CCAIDLE will publish to. */
#define RADIO_PUBLISH_CCAIDLE_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_CCAIDLE_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_CCAIDLE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_CCABUSY */
/* Description: Publish configuration for event CCABUSY */

/* Bit 31 :   */
#define RADIO_PUBLISH_CCABUSY_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_PUBLISH_CCABUSY_EN_Msk         ( 0x1UL << RADIO_PUBLISH_CCABUSY_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_CCABUSY_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define RADIO_PUBLISH_CCABUSY_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CCABUSY will publish to. */
#define RADIO_PUBLISH_CCABUSY_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_CCABUSY_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_CCABUSY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_CCASTOPPED */
/* Description: Publish configuration for event CCASTOPPED */

/* Bit 31 :   */
#define RADIO_PUBLISH_CCASTOPPED_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define RADIO_PUBLISH_CCASTOPPED_EN_Msk         ( 0x1UL << RADIO_PUBLISH_CCASTOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_CCASTOPPED_EN_Disabled    ( 0UL )                                      /*!< Disable publishing */
#define RADIO_PUBLISH_CCASTOPPED_EN_Enabled     ( 1UL )                                      /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CCASTOPPED will publish to. */
#define RADIO_PUBLISH_CCASTOPPED_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_CCASTOPPED_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_CCASTOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_RATEBOOST */
/* Description: Publish configuration for event RATEBOOST */

/* Bit 31 :   */
#define RADIO_PUBLISH_RATEBOOST_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define RADIO_PUBLISH_RATEBOOST_EN_Msk         ( 0x1UL << RADIO_PUBLISH_RATEBOOST_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_RATEBOOST_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define RADIO_PUBLISH_RATEBOOST_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RATEBOOST will publish to. */
#define RADIO_PUBLISH_RATEBOOST_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_RATEBOOST_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_RATEBOOST_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_TXREADY */
/* Description: Publish configuration for event TXREADY */

/* Bit 31 :   */
#define RADIO_PUBLISH_TXREADY_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_PUBLISH_TXREADY_EN_Msk         ( 0x1UL << RADIO_PUBLISH_TXREADY_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_TXREADY_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define RADIO_PUBLISH_TXREADY_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TXREADY will publish to. */
#define RADIO_PUBLISH_TXREADY_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_TXREADY_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_TXREADY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_RXREADY */
/* Description: Publish configuration for event RXREADY */

/* Bit 31 :   */
#define RADIO_PUBLISH_RXREADY_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RADIO_PUBLISH_RXREADY_EN_Msk         ( 0x1UL << RADIO_PUBLISH_RXREADY_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_RXREADY_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define RADIO_PUBLISH_RXREADY_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

