FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 7..0 : DPPI channel that event RXREADY will publish to. */
#define RADIO_PUBLISH_RXREADY_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_RXREADY_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_RXREADY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_MHRMATCH */
/* Description: Publish configuration for event MHRMATCH */

/* Bit 31 :   */
#define RADIO_PUBLISH_MHRMATCH_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define RADIO_PUBLISH_MHRMATCH_EN_Msk         ( 0x1UL << RADIO_PUBLISH_MHRMATCH_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_MHRMATCH_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define RADIO_PUBLISH_MHRMATCH_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event MHRMATCH will publish to. */
#define RADIO_PUBLISH_MHRMATCH_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_MHRMATCH_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_MHRMATCH_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_SYNC */
/* Description: Publish configuration for event SYNC */

/* Bit 31 :   */
#define RADIO_PUBLISH_SYNC_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define RADIO_PUBLISH_SYNC_EN_Msk         ( 0x1UL << RADIO_PUBLISH_SYNC_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_SYNC_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define RADIO_PUBLISH_SYNC_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event SYNC will publish to. */
#define RADIO_PUBLISH_SYNC_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_SYNC_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_SYNC_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_PHYEND */
/* Description: Publish configuration for event PHYEND */

/* Bit 31 :   */
#define RADIO_PUBLISH_PHYEND_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define RADIO_PUBLISH_PHYEND_EN_Msk         ( 0x1UL << RADIO_PUBLISH_PHYEND_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_PHYEND_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define RADIO_PUBLISH_PHYEND_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event PHYEND will publish to. */
#define RADIO_PUBLISH_PHYEND_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_PHYEND_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_PHYEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_PUBLISH_CTEPRESENT */
/* Description: Publish configuration for event CTEPRESENT */

/* Bit 31 :   */
#define RADIO_PUBLISH_CTEPRESENT_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define RADIO_PUBLISH_CTEPRESENT_EN_Msk         ( 0x1UL << RADIO_PUBLISH_CTEPRESENT_EN_Pos ) /*!< Bit mask of EN field. */
#define RADIO_PUBLISH_CTEPRESENT_EN_Disabled    ( 0UL )                                      /*!< Disable publishing */
#define RADIO_PUBLISH_CTEPRESENT_EN_Enabled     ( 1UL )                                      /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event CTEPRESENT will publish to. */
#define RADIO_PUBLISH_CTEPRESENT_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define RADIO_PUBLISH_CTEPRESENT_CHIDX_Msk      ( 0xFFUL << RADIO_PUBLISH_CTEPRESENT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 21 : Shortcut between event PHYEND and task START */
#define RADIO_SHORTS_PHYEND_START_Pos               ( 21UL )                                   /*!< Position of PHYEND_START field. */
#define RADIO_SHORTS_PHYEND_START_Msk               ( 0x1UL << RADIO_SHORTS_PHYEND_START_Pos ) /*!< Bit mask of PHYEND_START field. */
#define RADIO_SHORTS_PHYEND_START_Disabled          ( 0UL )                                    /*!< Disable shortcut */
#define RADIO_SHORTS_PHYEND_START_Enabled           ( 1UL )                                    /*!< Enable shortcut */

/* Bit 20 : Shortcut between event PHYEND and task DISABLE */
#define RADIO_SHORTS_PHYEND_DISABLE_Pos             ( 20UL )                                     /*!< Position of PHYEND_DISABLE field. */
#define RADIO_SHORTS_PHYEND_DISABLE_Msk             ( 0x1UL << RADIO_SHORTS_PHYEND_DISABLE_Pos ) /*!< Bit mask of PHYEND_DISABLE field. */
#define RADIO_SHORTS_PHYEND_DISABLE_Disabled        ( 0UL )                                      /*!< Disable shortcut */
#define RADIO_SHORTS_PHYEND_DISABLE_Enabled         ( 1UL )                                      /*!< Enable shortcut */

/* Bit 19 : Shortcut between event RXREADY and task START */
#define RADIO_SHORTS_RXREADY_START_Pos              ( 19UL )                                    /*!< Position of RXREADY_START field. */
#define RADIO_SHORTS_RXREADY_START_Msk              ( 0x1UL << RADIO_SHORTS_RXREADY_START_Pos ) /*!< Bit mask of RXREADY_START field. */
#define RADIO_SHORTS_RXREADY_START_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_RXREADY_START_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 18 : Shortcut between event TXREADY and task START */
#define RADIO_SHORTS_TXREADY_START_Pos              ( 18UL )                                    /*!< Position of TXREADY_START field. */
#define RADIO_SHORTS_TXREADY_START_Msk              ( 0x1UL << RADIO_SHORTS_TXREADY_START_Pos ) /*!< Bit mask of TXREADY_START field. */
#define RADIO_SHORTS_TXREADY_START_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_TXREADY_START_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 17 : Shortcut between event CCAIDLE and task STOP */
#define RADIO_SHORTS_CCAIDLE_STOP_Pos               ( 17UL )                                   /*!< Position of CCAIDLE_STOP field. */
#define RADIO_SHORTS_CCAIDLE_STOP_Msk               ( 0x1UL << RADIO_SHORTS_CCAIDLE_STOP_Pos ) /*!< Bit mask of CCAIDLE_STOP field. */
#define RADIO_SHORTS_CCAIDLE_STOP_Disabled          ( 0UL )                                    /*!< Disable shortcut */
#define RADIO_SHORTS_CCAIDLE_STOP_Enabled           ( 1UL )                                    /*!< Enable shortcut */

/* Bit 16 : Shortcut between event EDEND and task DISABLE */
#define RADIO_SHORTS_EDEND_DISABLE_Pos              ( 16UL )                                    /*!< Position of EDEND_DISABLE field. */
#define RADIO_SHORTS_EDEND_DISABLE_Msk              ( 0x1UL << RADIO_SHORTS_EDEND_DISABLE_Pos ) /*!< Bit mask of EDEND_DISABLE field. */
#define RADIO_SHORTS_EDEND_DISABLE_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_EDEND_DISABLE_Enabled          ( 1UL )                                     /*!< Enable shortcut */

