FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 15 : Shortcut between event READY and task EDSTART */
#define RADIO_SHORTS_READY_EDSTART_Pos              ( 15UL )                                    /*!< Position of READY_EDSTART field. */
#define RADIO_SHORTS_READY_EDSTART_Msk              ( 0x1UL << RADIO_SHORTS_READY_EDSTART_Pos ) /*!< Bit mask of READY_EDSTART field. */
#define RADIO_SHORTS_READY_EDSTART_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_READY_EDSTART_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 14 : Shortcut between event FRAMESTART and task BCSTART */
#define RADIO_SHORTS_FRAMESTART_BCSTART_Pos         ( 14UL )                                         /*!< Position of FRAMESTART_BCSTART field. */
#define RADIO_SHORTS_FRAMESTART_BCSTART_Msk         ( 0x1UL << RADIO_SHORTS_FRAMESTART_BCSTART_Pos ) /*!< Bit mask of FRAMESTART_BCSTART field. */
#define RADIO_SHORTS_FRAMESTART_BCSTART_Disabled    ( 0UL )                                          /*!< Disable shortcut */
#define RADIO_SHORTS_FRAMESTART_BCSTART_Enabled     ( 1UL )                                          /*!< Enable shortcut */

/* Bit 13 : Shortcut between event CCABUSY and task DISABLE */
#define RADIO_SHORTS_CCABUSY_DISABLE_Pos            ( 13UL )                                      /*!< Position of CCABUSY_DISABLE field. */
#define RADIO_SHORTS_CCABUSY_DISABLE_Msk            ( 0x1UL << RADIO_SHORTS_CCABUSY_DISABLE_Pos ) /*!< Bit mask of CCABUSY_DISABLE field. */
#define RADIO_SHORTS_CCABUSY_DISABLE_Disabled       ( 0UL )                                       /*!< Disable shortcut */
#define RADIO_SHORTS_CCABUSY_DISABLE_Enabled        ( 1UL )                                       /*!< Enable shortcut */

/* Bit 12 : Shortcut between event CCAIDLE and task TXEN */
#define RADIO_SHORTS_CCAIDLE_TXEN_Pos               ( 12UL )                                   /*!< Position of CCAIDLE_TXEN field. */
#define RADIO_SHORTS_CCAIDLE_TXEN_Msk               ( 0x1UL << RADIO_SHORTS_CCAIDLE_TXEN_Pos ) /*!< Bit mask of CCAIDLE_TXEN field. */
#define RADIO_SHORTS_CCAIDLE_TXEN_Disabled          ( 0UL )                                    /*!< Disable shortcut */
#define RADIO_SHORTS_CCAIDLE_TXEN_Enabled           ( 1UL )                                    /*!< Enable shortcut */

/* Bit 11 : Shortcut between event RXREADY and task CCASTART */
#define RADIO_SHORTS_RXREADY_CCASTART_Pos           ( 11UL )                                       /*!< Position of RXREADY_CCASTART field. */
#define RADIO_SHORTS_RXREADY_CCASTART_Msk           ( 0x1UL << RADIO_SHORTS_RXREADY_CCASTART_Pos ) /*!< Bit mask of RXREADY_CCASTART field. */
#define RADIO_SHORTS_RXREADY_CCASTART_Disabled      ( 0UL )                                        /*!< Disable shortcut */
#define RADIO_SHORTS_RXREADY_CCASTART_Enabled       ( 1UL )                                        /*!< Enable shortcut */

/* Bit 8 : Shortcut between event DISABLED and task RSSISTOP */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Pos          ( 8UL )                                         /*!< Position of DISABLED_RSSISTOP field. */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Msk          ( 0x1UL << RADIO_SHORTS_DISABLED_RSSISTOP_Pos ) /*!< Bit mask of DISABLED_RSSISTOP field. */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Disabled     ( 0UL )                                         /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_RSSISTOP_Enabled      ( 1UL )                                         /*!< Enable shortcut */

/* Bit 6 : Shortcut between event ADDRESS and task BCSTART */
#define RADIO_SHORTS_ADDRESS_BCSTART_Pos            ( 6UL )                                       /*!< Position of ADDRESS_BCSTART field. */
#define RADIO_SHORTS_ADDRESS_BCSTART_Msk            ( 0x1UL << RADIO_SHORTS_ADDRESS_BCSTART_Pos ) /*!< Bit mask of ADDRESS_BCSTART field. */
#define RADIO_SHORTS_ADDRESS_BCSTART_Disabled       ( 0UL )                                       /*!< Disable shortcut */
#define RADIO_SHORTS_ADDRESS_BCSTART_Enabled        ( 1UL )                                       /*!< Enable shortcut */

/* Bit 5 : Shortcut between event END and task START */
#define RADIO_SHORTS_END_START_Pos                  ( 5UL )                                 /*!< Position of END_START field. */
#define RADIO_SHORTS_END_START_Msk                  ( 0x1UL << RADIO_SHORTS_END_START_Pos ) /*!< Bit mask of END_START field. */
#define RADIO_SHORTS_END_START_Disabled             ( 0UL )                                 /*!< Disable shortcut */
#define RADIO_SHORTS_END_START_Enabled              ( 1UL )                                 /*!< Enable shortcut */

/* Bit 4 : Shortcut between event ADDRESS and task RSSISTART */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Pos          ( 4UL )                                         /*!< Position of ADDRESS_RSSISTART field. */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Msk          ( 0x1UL << RADIO_SHORTS_ADDRESS_RSSISTART_Pos ) /*!< Bit mask of ADDRESS_RSSISTART field. */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Disabled     ( 0UL )                                         /*!< Disable shortcut */
#define RADIO_SHORTS_ADDRESS_RSSISTART_Enabled      ( 1UL )                                         /*!< Enable shortcut */

/* Bit 3 : Shortcut between event DISABLED and task RXEN */
#define RADIO_SHORTS_DISABLED_RXEN_Pos              ( 3UL )                                     /*!< Position of DISABLED_RXEN field. */
#define RADIO_SHORTS_DISABLED_RXEN_Msk              ( 0x1UL << RADIO_SHORTS_DISABLED_RXEN_Pos ) /*!< Bit mask of DISABLED_RXEN field. */
#define RADIO_SHORTS_DISABLED_RXEN_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_RXEN_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 2 : Shortcut between event DISABLED and task TXEN */
#define RADIO_SHORTS_DISABLED_TXEN_Pos              ( 2UL )                                     /*!< Position of DISABLED_TXEN field. */
#define RADIO_SHORTS_DISABLED_TXEN_Msk              ( 0x1UL << RADIO_SHORTS_DISABLED_TXEN_Pos ) /*!< Bit mask of DISABLED_TXEN field. */
#define RADIO_SHORTS_DISABLED_TXEN_Disabled         ( 0UL )                                     /*!< Disable shortcut */
#define RADIO_SHORTS_DISABLED_TXEN_Enabled          ( 1UL )                                     /*!< Enable shortcut */

/* Bit 1 : Shortcut between event END and task DISABLE */
#define RADIO_SHORTS_END_DISABLE_Pos                ( 1UL )                                   /*!< Position of END_DISABLE field. */
#define RADIO_SHORTS_END_DISABLE_Msk                ( 0x1UL << RADIO_SHORTS_END_DISABLE_Pos ) /*!< Bit mask of END_DISABLE field. */
#define RADIO_SHORTS_END_DISABLE_Disabled           ( 0UL )                                   /*!< Disable shortcut */
#define RADIO_SHORTS_END_DISABLE_Enabled            ( 1UL )                                   /*!< Enable shortcut */

