FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 0 : Shortcut between event READY and task START */
#define RADIO_SHORTS_READY_START_Pos                ( 0UL )                                   /*!< Position of READY_START field. */
#define RADIO_SHORTS_READY_START_Msk                ( 0x1UL << RADIO_SHORTS_READY_START_Pos ) /*!< Bit mask of READY_START field. */
#define RADIO_SHORTS_READY_START_Disabled           ( 0UL )                                   /*!< Disable shortcut */
#define RADIO_SHORTS_READY_START_Enabled            ( 1UL )                                   /*!< Enable shortcut */

/* Register: RADIO_INTENSET */
/* Description: Enable interrupt */

/* Bit 28 : Write '1' to enable interrupt for event CTEPRESENT */
#define RADIO_INTENSET_CTEPRESENT_Pos         ( 28UL )                                   /*!< Position of CTEPRESENT field. */
#define RADIO_INTENSET_CTEPRESENT_Msk         ( 0x1UL << RADIO_INTENSET_CTEPRESENT_Pos ) /*!< Bit mask of CTEPRESENT field. */
#define RADIO_INTENSET_CTEPRESENT_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define RADIO_INTENSET_CTEPRESENT_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define RADIO_INTENSET_CTEPRESENT_Set         ( 1UL )                                    /*!< Enable */

/* Bit 27 : Write '1' to enable interrupt for event PHYEND */
#define RADIO_INTENSET_PHYEND_Pos             ( 27UL )                               /*!< Position of PHYEND field. */
#define RADIO_INTENSET_PHYEND_Msk             ( 0x1UL << RADIO_INTENSET_PHYEND_Pos ) /*!< Bit mask of PHYEND field. */
#define RADIO_INTENSET_PHYEND_Disabled        ( 0UL )                                /*!< Read: Disabled */
#define RADIO_INTENSET_PHYEND_Enabled         ( 1UL )                                /*!< Read: Enabled */
#define RADIO_INTENSET_PHYEND_Set             ( 1UL )                                /*!< Enable */

/* Bit 26 : Write '1' to enable interrupt for event SYNC */
#define RADIO_INTENSET_SYNC_Pos               ( 26UL )                             /*!< Position of SYNC field. */
#define RADIO_INTENSET_SYNC_Msk               ( 0x1UL << RADIO_INTENSET_SYNC_Pos ) /*!< Bit mask of SYNC field. */
#define RADIO_INTENSET_SYNC_Disabled          ( 0UL )                              /*!< Read: Disabled */
#define RADIO_INTENSET_SYNC_Enabled           ( 1UL )                              /*!< Read: Enabled */
#define RADIO_INTENSET_SYNC_Set               ( 1UL )                              /*!< Enable */

/* Bit 23 : Write '1' to enable interrupt for event MHRMATCH */
#define RADIO_INTENSET_MHRMATCH_Pos           ( 23UL )                                 /*!< Position of MHRMATCH field. */
#define RADIO_INTENSET_MHRMATCH_Msk           ( 0x1UL << RADIO_INTENSET_MHRMATCH_Pos ) /*!< Bit mask of MHRMATCH field. */
#define RADIO_INTENSET_MHRMATCH_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_MHRMATCH_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_MHRMATCH_Set           ( 1UL )                                  /*!< Enable */

/* Bit 22 : Write '1' to enable interrupt for event RXREADY */
#define RADIO_INTENSET_RXREADY_Pos            ( 22UL )                                /*!< Position of RXREADY field. */
#define RADIO_INTENSET_RXREADY_Msk            ( 0x1UL << RADIO_INTENSET_RXREADY_Pos ) /*!< Bit mask of RXREADY field. */
#define RADIO_INTENSET_RXREADY_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_RXREADY_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_RXREADY_Set            ( 1UL )                                 /*!< Enable */

/* Bit 21 : Write '1' to enable interrupt for event TXREADY */
#define RADIO_INTENSET_TXREADY_Pos            ( 21UL )                                /*!< Position of TXREADY field. */
#define RADIO_INTENSET_TXREADY_Msk            ( 0x1UL << RADIO_INTENSET_TXREADY_Pos ) /*!< Bit mask of TXREADY field. */
#define RADIO_INTENSET_TXREADY_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_TXREADY_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_TXREADY_Set            ( 1UL )                                 /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event RATEBOOST */
#define RADIO_INTENSET_RATEBOOST_Pos          ( 20UL )                                  /*!< Position of RATEBOOST field. */
#define RADIO_INTENSET_RATEBOOST_Msk          ( 0x1UL << RADIO_INTENSET_RATEBOOST_Pos ) /*!< Bit mask of RATEBOOST field. */
#define RADIO_INTENSET_RATEBOOST_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define RADIO_INTENSET_RATEBOOST_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define RADIO_INTENSET_RATEBOOST_Set          ( 1UL )                                   /*!< Enable */

/* Bit 19 : Write '1' to enable interrupt for event CCASTOPPED */
#define RADIO_INTENSET_CCASTOPPED_Pos         ( 19UL )                                   /*!< Position of CCASTOPPED field. */
#define RADIO_INTENSET_CCASTOPPED_Msk         ( 0x1UL << RADIO_INTENSET_CCASTOPPED_Pos ) /*!< Bit mask of CCASTOPPED field. */
#define RADIO_INTENSET_CCASTOPPED_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define RADIO_INTENSET_CCASTOPPED_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define RADIO_INTENSET_CCASTOPPED_Set         ( 1UL )                                    /*!< Enable */

/* Bit 18 : Write '1' to enable interrupt for event CCABUSY */
#define RADIO_INTENSET_CCABUSY_Pos            ( 18UL )                                /*!< Position of CCABUSY field. */
#define RADIO_INTENSET_CCABUSY_Msk            ( 0x1UL << RADIO_INTENSET_CCABUSY_Pos ) /*!< Bit mask of CCABUSY field. */
#define RADIO_INTENSET_CCABUSY_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_CCABUSY_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_CCABUSY_Set            ( 1UL )                                 /*!< Enable */

/* Bit 17 : Write '1' to enable interrupt for event CCAIDLE */
#define RADIO_INTENSET_CCAIDLE_Pos            ( 17UL )                                /*!< Position of CCAIDLE field. */
#define RADIO_INTENSET_CCAIDLE_Msk            ( 0x1UL << RADIO_INTENSET_CCAIDLE_Pos ) /*!< Bit mask of CCAIDLE field. */
#define RADIO_INTENSET_CCAIDLE_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_CCAIDLE_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_CCAIDLE_Set            ( 1UL )                                 /*!< Enable */

