FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 16 : Write '1' to enable interrupt for event EDSTOPPED */
#define RADIO_INTENSET_EDSTOPPED_Pos          ( 16UL )                                  /*!< Position of EDSTOPPED field. */
#define RADIO_INTENSET_EDSTOPPED_Msk          ( 0x1UL << RADIO_INTENSET_EDSTOPPED_Pos ) /*!< Bit mask of EDSTOPPED field. */
#define RADIO_INTENSET_EDSTOPPED_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define RADIO_INTENSET_EDSTOPPED_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define RADIO_INTENSET_EDSTOPPED_Set          ( 1UL )                                   /*!< Enable */

/* Bit 15 : Write '1' to enable interrupt for event EDEND */
#define RADIO_INTENSET_EDEND_Pos              ( 15UL )                              /*!< Position of EDEND field. */
#define RADIO_INTENSET_EDEND_Msk              ( 0x1UL << RADIO_INTENSET_EDEND_Pos ) /*!< Bit mask of EDEND field. */
#define RADIO_INTENSET_EDEND_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENSET_EDEND_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENSET_EDEND_Set              ( 1UL )                               /*!< Enable */

/* Bit 14 : Write '1' to enable interrupt for event FRAMESTART */
#define RADIO_INTENSET_FRAMESTART_Pos         ( 14UL )                                   /*!< Position of FRAMESTART field. */
#define RADIO_INTENSET_FRAMESTART_Msk         ( 0x1UL << RADIO_INTENSET_FRAMESTART_Pos ) /*!< Bit mask of FRAMESTART field. */
#define RADIO_INTENSET_FRAMESTART_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define RADIO_INTENSET_FRAMESTART_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define RADIO_INTENSET_FRAMESTART_Set         ( 1UL )                                    /*!< Enable */

/* Bit 13 : Write '1' to enable interrupt for event CRCERROR */
#define RADIO_INTENSET_CRCERROR_Pos           ( 13UL )                                 /*!< Position of CRCERROR field. */
#define RADIO_INTENSET_CRCERROR_Msk           ( 0x1UL << RADIO_INTENSET_CRCERROR_Pos ) /*!< Bit mask of CRCERROR field. */
#define RADIO_INTENSET_CRCERROR_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_CRCERROR_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_CRCERROR_Set           ( 1UL )                                  /*!< Enable */

/* Bit 12 : Write '1' to enable interrupt for event CRCOK */
#define RADIO_INTENSET_CRCOK_Pos              ( 12UL )                              /*!< Position of CRCOK field. */
#define RADIO_INTENSET_CRCOK_Msk              ( 0x1UL << RADIO_INTENSET_CRCOK_Pos ) /*!< Bit mask of CRCOK field. */
#define RADIO_INTENSET_CRCOK_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENSET_CRCOK_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENSET_CRCOK_Set              ( 1UL )                               /*!< Enable */

/* Bit 10 : Write '1' to enable interrupt for event BCMATCH */
#define RADIO_INTENSET_BCMATCH_Pos            ( 10UL )                                /*!< Position of BCMATCH field. */
#define RADIO_INTENSET_BCMATCH_Msk            ( 0x1UL << RADIO_INTENSET_BCMATCH_Pos ) /*!< Bit mask of BCMATCH field. */
#define RADIO_INTENSET_BCMATCH_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_BCMATCH_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_BCMATCH_Set            ( 1UL )                                 /*!< Enable */

/* Bit 7 : Write '1' to enable interrupt for event RSSIEND */
#define RADIO_INTENSET_RSSIEND_Pos            ( 7UL )                                 /*!< Position of RSSIEND field. */
#define RADIO_INTENSET_RSSIEND_Msk            ( 0x1UL << RADIO_INTENSET_RSSIEND_Pos ) /*!< Bit mask of RSSIEND field. */
#define RADIO_INTENSET_RSSIEND_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_RSSIEND_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_RSSIEND_Set            ( 1UL )                                 /*!< Enable */

/* Bit 6 : Write '1' to enable interrupt for event DEVMISS */
#define RADIO_INTENSET_DEVMISS_Pos            ( 6UL )                                 /*!< Position of DEVMISS field. */
#define RADIO_INTENSET_DEVMISS_Msk            ( 0x1UL << RADIO_INTENSET_DEVMISS_Pos ) /*!< Bit mask of DEVMISS field. */
#define RADIO_INTENSET_DEVMISS_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_DEVMISS_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_DEVMISS_Set            ( 1UL )                                 /*!< Enable */

/* Bit 5 : Write '1' to enable interrupt for event DEVMATCH */
#define RADIO_INTENSET_DEVMATCH_Pos           ( 5UL )                                  /*!< Position of DEVMATCH field. */
#define RADIO_INTENSET_DEVMATCH_Msk           ( 0x1UL << RADIO_INTENSET_DEVMATCH_Pos ) /*!< Bit mask of DEVMATCH field. */
#define RADIO_INTENSET_DEVMATCH_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_DEVMATCH_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_DEVMATCH_Set           ( 1UL )                                  /*!< Enable */

/* Bit 4 : Write '1' to enable interrupt for event DISABLED */
#define RADIO_INTENSET_DISABLED_Pos           ( 4UL )                                  /*!< Position of DISABLED field. */
#define RADIO_INTENSET_DISABLED_Msk           ( 0x1UL << RADIO_INTENSET_DISABLED_Pos ) /*!< Bit mask of DISABLED field. */
#define RADIO_INTENSET_DISABLED_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENSET_DISABLED_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENSET_DISABLED_Set           ( 1UL )                                  /*!< Enable */

/* Bit 3 : Write '1' to enable interrupt for event END */
#define RADIO_INTENSET_END_Pos                ( 3UL )                             /*!< Position of END field. */
#define RADIO_INTENSET_END_Msk                ( 0x1UL << RADIO_INTENSET_END_Pos ) /*!< Bit mask of END field. */
#define RADIO_INTENSET_END_Disabled           ( 0UL )                             /*!< Read: Disabled */
#define RADIO_INTENSET_END_Enabled            ( 1UL )                             /*!< Read: Enabled */
#define RADIO_INTENSET_END_Set                ( 1UL )                             /*!< Enable */

