FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 2 : Write '1' to enable interrupt for event PAYLOAD */
#define RADIO_INTENSET_PAYLOAD_Pos            ( 2UL )                                 /*!< Position of PAYLOAD field. */
#define RADIO_INTENSET_PAYLOAD_Msk            ( 0x1UL << RADIO_INTENSET_PAYLOAD_Pos ) /*!< Bit mask of PAYLOAD field. */
#define RADIO_INTENSET_PAYLOAD_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_PAYLOAD_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_PAYLOAD_Set            ( 1UL )                                 /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event ADDRESS */
#define RADIO_INTENSET_ADDRESS_Pos            ( 1UL )                                 /*!< Position of ADDRESS field. */
#define RADIO_INTENSET_ADDRESS_Msk            ( 0x1UL << RADIO_INTENSET_ADDRESS_Pos ) /*!< Bit mask of ADDRESS field. */
#define RADIO_INTENSET_ADDRESS_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENSET_ADDRESS_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENSET_ADDRESS_Set            ( 1UL )                                 /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event READY */
#define RADIO_INTENSET_READY_Pos              ( 0UL )                               /*!< Position of READY field. */
#define RADIO_INTENSET_READY_Msk              ( 0x1UL << RADIO_INTENSET_READY_Pos ) /*!< Bit mask of READY field. */
#define RADIO_INTENSET_READY_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENSET_READY_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENSET_READY_Set              ( 1UL )                               /*!< Enable */

/* Register: RADIO_INTENCLR */
/* Description: Disable interrupt */

/* Bit 28 : Write '1' to disable interrupt for event CTEPRESENT */
#define RADIO_INTENCLR_CTEPRESENT_Pos         ( 28UL )                                   /*!< Position of CTEPRESENT field. */
#define RADIO_INTENCLR_CTEPRESENT_Msk         ( 0x1UL << RADIO_INTENCLR_CTEPRESENT_Pos ) /*!< Bit mask of CTEPRESENT field. */
#define RADIO_INTENCLR_CTEPRESENT_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define RADIO_INTENCLR_CTEPRESENT_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define RADIO_INTENCLR_CTEPRESENT_Clear       ( 1UL )                                    /*!< Disable */

/* Bit 27 : Write '1' to disable interrupt for event PHYEND */
#define RADIO_INTENCLR_PHYEND_Pos             ( 27UL )                               /*!< Position of PHYEND field. */
#define RADIO_INTENCLR_PHYEND_Msk             ( 0x1UL << RADIO_INTENCLR_PHYEND_Pos ) /*!< Bit mask of PHYEND field. */
#define RADIO_INTENCLR_PHYEND_Disabled        ( 0UL )                                /*!< Read: Disabled */
#define RADIO_INTENCLR_PHYEND_Enabled         ( 1UL )                                /*!< Read: Enabled */
#define RADIO_INTENCLR_PHYEND_Clear           ( 1UL )                                /*!< Disable */

/* Bit 26 : Write '1' to disable interrupt for event SYNC */
#define RADIO_INTENCLR_SYNC_Pos               ( 26UL )                             /*!< Position of SYNC field. */
#define RADIO_INTENCLR_SYNC_Msk               ( 0x1UL << RADIO_INTENCLR_SYNC_Pos ) /*!< Bit mask of SYNC field. */
#define RADIO_INTENCLR_SYNC_Disabled          ( 0UL )                              /*!< Read: Disabled */
#define RADIO_INTENCLR_SYNC_Enabled           ( 1UL )                              /*!< Read: Enabled */
#define RADIO_INTENCLR_SYNC_Clear             ( 1UL )                              /*!< Disable */

/* Bit 23 : Write '1' to disable interrupt for event MHRMATCH */
#define RADIO_INTENCLR_MHRMATCH_Pos           ( 23UL )                                 /*!< Position of MHRMATCH field. */
#define RADIO_INTENCLR_MHRMATCH_Msk           ( 0x1UL << RADIO_INTENCLR_MHRMATCH_Pos ) /*!< Bit mask of MHRMATCH field. */
#define RADIO_INTENCLR_MHRMATCH_Disabled      ( 0UL )                                  /*!< Read: Disabled */
#define RADIO_INTENCLR_MHRMATCH_Enabled       ( 1UL )                                  /*!< Read: Enabled */
#define RADIO_INTENCLR_MHRMATCH_Clear         ( 1UL )                                  /*!< Disable */

/* Bit 22 : Write '1' to disable interrupt for event RXREADY */
#define RADIO_INTENCLR_RXREADY_Pos            ( 22UL )                                /*!< Position of RXREADY field. */
#define RADIO_INTENCLR_RXREADY_Msk            ( 0x1UL << RADIO_INTENCLR_RXREADY_Pos ) /*!< Bit mask of RXREADY field. */
#define RADIO_INTENCLR_RXREADY_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENCLR_RXREADY_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENCLR_RXREADY_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 21 : Write '1' to disable interrupt for event TXREADY */
#define RADIO_INTENCLR_TXREADY_Pos            ( 21UL )                                /*!< Position of TXREADY field. */
#define RADIO_INTENCLR_TXREADY_Msk            ( 0x1UL << RADIO_INTENCLR_TXREADY_Pos ) /*!< Bit mask of TXREADY field. */
#define RADIO_INTENCLR_TXREADY_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENCLR_TXREADY_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENCLR_TXREADY_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 20 : Write '1' to disable interrupt for event RATEBOOST */
#define RADIO_INTENCLR_RATEBOOST_Pos          ( 20UL )                                  /*!< Position of RATEBOOST field. */
#define RADIO_INTENCLR_RATEBOOST_Msk          ( 0x1UL << RADIO_INTENCLR_RATEBOOST_Pos ) /*!< Bit mask of RATEBOOST field. */
#define RADIO_INTENCLR_RATEBOOST_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define RADIO_INTENCLR_RATEBOOST_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define RADIO_INTENCLR_RATEBOOST_Clear        ( 1UL )                                   /*!< Disable */

/* Bit 19 : Write '1' to disable interrupt for event CCASTOPPED */
#define RADIO_INTENCLR_CCASTOPPED_Pos         ( 19UL )                                   /*!< Position of CCASTOPPED field. */
#define RADIO_INTENCLR_CCASTOPPED_Msk         ( 0x1UL << RADIO_INTENCLR_CCASTOPPED_Pos ) /*!< Bit mask of CCASTOPPED field. */
#define RADIO_INTENCLR_CCASTOPPED_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define RADIO_INTENCLR_CCASTOPPED_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define RADIO_INTENCLR_CCASTOPPED_Clear       ( 1UL )                                    /*!< Disable */

/* Bit 18 : Write '1' to disable interrupt for event CCABUSY */
#define RADIO_INTENCLR_CCABUSY_Pos            ( 18UL )                                /*!< Position of CCABUSY field. */
#define RADIO_INTENCLR_CCABUSY_Msk            ( 0x1UL << RADIO_INTENCLR_CCABUSY_Pos ) /*!< Bit mask of CCABUSY field. */
#define RADIO_INTENCLR_CCABUSY_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENCLR_CCABUSY_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENCLR_CCABUSY_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 17 : Write '1' to disable interrupt for event CCAIDLE */
#define RADIO_INTENCLR_CCAIDLE_Pos            ( 17UL )                                /*!< Position of CCAIDLE field. */
#define RADIO_INTENCLR_CCAIDLE_Msk            ( 0x1UL << RADIO_INTENCLR_CCAIDLE_Pos ) /*!< Bit mask of CCAIDLE field. */
#define RADIO_INTENCLR_CCAIDLE_Disabled       ( 0UL )                                 /*!< Read: Disabled */
#define RADIO_INTENCLR_CCAIDLE_Enabled        ( 1UL )                                 /*!< Read: Enabled */
#define RADIO_INTENCLR_CCAIDLE_Clear          ( 1UL )                                 /*!< Disable */

/* Bit 16 : Write '1' to disable interrupt for event EDSTOPPED */
#define RADIO_INTENCLR_EDSTOPPED_Pos          ( 16UL )                                  /*!< Position of EDSTOPPED field. */
#define RADIO_INTENCLR_EDSTOPPED_Msk          ( 0x1UL << RADIO_INTENCLR_EDSTOPPED_Pos ) /*!< Bit mask of EDSTOPPED field. */
#define RADIO_INTENCLR_EDSTOPPED_Disabled     ( 0UL )                                   /*!< Read: Disabled */
#define RADIO_INTENCLR_EDSTOPPED_Enabled      ( 1UL )                                   /*!< Read: Enabled */
#define RADIO_INTENCLR_EDSTOPPED_Clear        ( 1UL )                                   /*!< Disable */

/* Bit 15 : Write '1' to disable interrupt for event EDEND */
#define RADIO_INTENCLR_EDEND_Pos              ( 15UL )                              /*!< Position of EDEND field. */
#define RADIO_INTENCLR_EDEND_Msk              ( 0x1UL << RADIO_INTENCLR_EDEND_Pos ) /*!< Bit mask of EDEND field. */
#define RADIO_INTENCLR_EDEND_Disabled         ( 0UL )                               /*!< Read: Disabled */
#define RADIO_INTENCLR_EDEND_Enabled          ( 1UL )                               /*!< Read: Enabled */
#define RADIO_INTENCLR_EDEND_Clear            ( 1UL )                               /*!< Disable */

/* Bit 14 : Write '1' to disable interrupt for event FRAMESTART */
#define RADIO_INTENCLR_FRAMESTART_Pos         ( 14UL )                                   /*!< Position of FRAMESTART field. */
#define RADIO_INTENCLR_FRAMESTART_Msk         ( 0x1UL << RADIO_INTENCLR_FRAMESTART_Pos ) /*!< Bit mask of FRAMESTART field. */
#define RADIO_INTENCLR_FRAMESTART_Disabled    ( 0UL )                                    /*!< Read: Disabled */
#define RADIO_INTENCLR_FRAMESTART_Enabled     ( 1UL )                                    /*!< Read: Enabled */
#define RADIO_INTENCLR_FRAMESTART_Clear       ( 1UL )                                    /*!< Disable */

