FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: RADIO_RXADDRESSES */
/* Description: Receive address select */

/* Bit 7 : Enable or disable reception on logical address 7. */
#define RADIO_RXADDRESSES_ADDR7_Pos         ( 7UL )                                  /*!< Position of ADDR7 field. */
#define RADIO_RXADDRESSES_ADDR7_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR7_Pos ) /*!< Bit mask of ADDR7 field. */
#define RADIO_RXADDRESSES_ADDR7_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR7_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 6 : Enable or disable reception on logical address 6. */
#define RADIO_RXADDRESSES_ADDR6_Pos         ( 6UL )                                  /*!< Position of ADDR6 field. */
#define RADIO_RXADDRESSES_ADDR6_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR6_Pos ) /*!< Bit mask of ADDR6 field. */
#define RADIO_RXADDRESSES_ADDR6_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR6_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 5 : Enable or disable reception on logical address 5. */
#define RADIO_RXADDRESSES_ADDR5_Pos         ( 5UL )                                  /*!< Position of ADDR5 field. */
#define RADIO_RXADDRESSES_ADDR5_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR5_Pos ) /*!< Bit mask of ADDR5 field. */
#define RADIO_RXADDRESSES_ADDR5_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR5_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 4 : Enable or disable reception on logical address 4. */
#define RADIO_RXADDRESSES_ADDR4_Pos         ( 4UL )                                  /*!< Position of ADDR4 field. */
#define RADIO_RXADDRESSES_ADDR4_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR4_Pos ) /*!< Bit mask of ADDR4 field. */
#define RADIO_RXADDRESSES_ADDR4_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR4_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 3 : Enable or disable reception on logical address 3. */
#define RADIO_RXADDRESSES_ADDR3_Pos         ( 3UL )                                  /*!< Position of ADDR3 field. */
#define RADIO_RXADDRESSES_ADDR3_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR3_Pos ) /*!< Bit mask of ADDR3 field. */
#define RADIO_RXADDRESSES_ADDR3_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR3_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 2 : Enable or disable reception on logical address 2. */
#define RADIO_RXADDRESSES_ADDR2_Pos         ( 2UL )                                  /*!< Position of ADDR2 field. */
#define RADIO_RXADDRESSES_ADDR2_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR2_Pos ) /*!< Bit mask of ADDR2 field. */
#define RADIO_RXADDRESSES_ADDR2_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR2_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 1 : Enable or disable reception on logical address 1. */
#define RADIO_RXADDRESSES_ADDR1_Pos         ( 1UL )                                  /*!< Position of ADDR1 field. */
#define RADIO_RXADDRESSES_ADDR1_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR1_Pos ) /*!< Bit mask of ADDR1 field. */
#define RADIO_RXADDRESSES_ADDR1_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR1_Enabled     ( 1UL )                                  /*!< Enable */

/* Bit 0 : Enable or disable reception on logical address 0. */
#define RADIO_RXADDRESSES_ADDR0_Pos         ( 0UL )                                  /*!< Position of ADDR0 field. */
#define RADIO_RXADDRESSES_ADDR0_Msk         ( 0x1UL << RADIO_RXADDRESSES_ADDR0_Pos ) /*!< Bit mask of ADDR0 field. */
#define RADIO_RXADDRESSES_ADDR0_Disabled    ( 0UL )                                  /*!< Disable */
#define RADIO_RXADDRESSES_ADDR0_Enabled     ( 1UL )                                  /*!< Enable */

/* Register: RADIO_CRCCNF */
/* Description: CRC configuration */

/* Bits 9..8 : Include or exclude packet address field out of CRC calculation. */
#define RADIO_CRCCNF_SKIPADDR_Pos           ( 8UL )                                /*!< Position of SKIPADDR field. */
#define RADIO_CRCCNF_SKIPADDR_Msk           ( 0x3UL << RADIO_CRCCNF_SKIPADDR_Pos ) /*!< Bit mask of SKIPADDR field. */
#define RADIO_CRCCNF_SKIPADDR_Include       ( 0UL )                                /*!< CRC calculation includes address field */
#define RADIO_CRCCNF_SKIPADDR_Skip          ( 1UL )                                /*!< CRC calculation does not include address field. The CRC calculation will start at the first byte after the address. */
#define RADIO_CRCCNF_SKIPADDR_Ieee802154    ( 2UL )                                /*!< CRC calculation as per 802.15.4 standard. Starting at first byte after length field. */

/* Bits 1..0 : CRC length in number of bytes For MODE Ble_LR125Kbit and Ble_LR500Kbit, only LEN set to 3 is supported */
#define RADIO_CRCCNF_LEN_Pos                ( 0UL )                           /*!< Position of LEN field. */
#define RADIO_CRCCNF_LEN_Msk                ( 0x3UL << RADIO_CRCCNF_LEN_Pos ) /*!< Bit mask of LEN field. */
#define RADIO_CRCCNF_LEN_Disabled           ( 0UL )                           /*!< CRC length is zero and CRC calculation is disabled */
#define RADIO_CRCCNF_LEN_One                ( 1UL )                           /*!< CRC length is one byte and CRC calculation is enabled */
#define RADIO_CRCCNF_LEN_Two                ( 2UL )                           /*!< CRC length is two bytes and CRC calculation is enabled */
#define RADIO_CRCCNF_LEN_Three              ( 3UL )                           /*!< CRC length is three bytes and CRC calculation is enabled */

/* Register: RADIO_CRCPOLY */
/* Description: CRC polynomial */

/* Bits 23..0 : CRC polynomial */
#define RADIO_CRCPOLY_CRCPOLY_Pos    ( 0UL )                                     /*!< Position of CRCPOLY field. */
#define RADIO_CRCPOLY_CRCPOLY_Msk    ( 0xFFFFFFUL << RADIO_CRCPOLY_CRCPOLY_Pos ) /*!< Bit mask of CRCPOLY field. */

