FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: RADIO_CRCINIT */
/* Description: CRC initial value */

/* Bits 23..0 : CRC initial value */
#define RADIO_CRCINIT_CRCINIT_Pos    ( 0UL )                                     /*!< Position of CRCINIT field. */
#define RADIO_CRCINIT_CRCINIT_Msk    ( 0xFFFFFFUL << RADIO_CRCINIT_CRCINIT_Pos ) /*!< Bit mask of CRCINIT field. */

/* Register: RADIO_TIFS */
/* Description: Interframe spacing in us */

/* Bits 9..0 : Interframe spacing in us. */
#define RADIO_TIFS_TIFS_Pos    ( 0UL )                            /*!< Position of TIFS field. */
#define RADIO_TIFS_TIFS_Msk    ( 0x3FFUL << RADIO_TIFS_TIFS_Pos ) /*!< Bit mask of TIFS field. */

/* Register: RADIO_RSSISAMPLE */
/* Description: RSSI sample */

/* Bits 6..0 : RSSI sample. */
#define RADIO_RSSISAMPLE_RSSISAMPLE_Pos    ( 0UL )                                       /*!< Position of RSSISAMPLE field. */
#define RADIO_RSSISAMPLE_RSSISAMPLE_Msk    ( 0x7FUL << RADIO_RSSISAMPLE_RSSISAMPLE_Pos ) /*!< Bit mask of RSSISAMPLE field. */

/* Register: RADIO_STATE */
/* Description: Current radio state */

/* Bits 3..0 : Current radio state */
#define RADIO_STATE_STATE_Pos          ( 0UL )                            /*!< Position of STATE field. */
#define RADIO_STATE_STATE_Msk          ( 0xFUL << RADIO_STATE_STATE_Pos ) /*!< Bit mask of STATE field. */
#define RADIO_STATE_STATE_Disabled     ( 0UL )                            /*!< RADIO is in the Disabled state */
#define RADIO_STATE_STATE_RxRu         ( 1UL )                            /*!< RADIO is in the RXRU state */
#define RADIO_STATE_STATE_RxIdle       ( 2UL )                            /*!< RADIO is in the RXIDLE state */
#define RADIO_STATE_STATE_Rx           ( 3UL )                            /*!< RADIO is in the RX state */
#define RADIO_STATE_STATE_RxDisable    ( 4UL )                            /*!< RADIO is in the RXDISABLED state */
#define RADIO_STATE_STATE_TxRu         ( 9UL )                            /*!< RADIO is in the TXRU state */
#define RADIO_STATE_STATE_TxIdle       ( 10UL )                           /*!< RADIO is in the TXIDLE state */
#define RADIO_STATE_STATE_Tx           ( 11UL )                           /*!< RADIO is in the TX state */
#define RADIO_STATE_STATE_TxDisable    ( 12UL )                           /*!< RADIO is in the TXDISABLED state */

/* Register: RADIO_DATAWHITEIV */
/* Description: Data whitening initial value */

/* Bits 6..0 : Data whitening initial value. Bit 6 is hardwired to '1', writing '0' to it has no effect, and it will always be read back and used by the device as '1'. */
#define RADIO_DATAWHITEIV_DATAWHITEIV_Pos    ( 0UL )                                         /*!< Position of DATAWHITEIV field. */
#define RADIO_DATAWHITEIV_DATAWHITEIV_Msk    ( 0x7FUL << RADIO_DATAWHITEIV_DATAWHITEIV_Pos ) /*!< Bit mask of DATAWHITEIV field. */

/* Register: RADIO_BCC */
/* Description: Bit counter compare */

/* Bits 31..0 : Bit counter compare */
#define RADIO_BCC_BCC_Pos    ( 0UL )                               /*!< Position of BCC field. */
#define RADIO_BCC_BCC_Msk    ( 0xFFFFFFFFUL << RADIO_BCC_BCC_Pos ) /*!< Bit mask of BCC field. */

/* Register: RADIO_DAB */
/* Description: Description collection: Device address base segment n */

/* Bits 31..0 : Device address base segment n */
#define RADIO_DAB_DAB_Pos    ( 0UL )                               /*!< Position of DAB field. */
#define RADIO_DAB_DAB_Msk    ( 0xFFFFFFFFUL << RADIO_DAB_DAB_Pos ) /*!< Bit mask of DAB field. */

/* Register: RADIO_DAP */
/* Description: Description collection: Device address prefix n */

/* Bits 15..0 : Device address prefix n */
#define RADIO_DAP_DAP_Pos    ( 0UL )                           /*!< Position of DAP field. */
#define RADIO_DAP_DAP_Msk    ( 0xFFFFUL << RADIO_DAP_DAP_Pos ) /*!< Bit mask of DAP field. */

/* Register: RADIO_DACNF */
/* Description: Device address match configuration */

/* Bit 15 : TxAdd for device address 7 */
#define RADIO_DACNF_TXADD7_Pos       ( 15UL )                            /*!< Position of TXADD7 field. */
#define RADIO_DACNF_TXADD7_Msk       ( 0x1UL << RADIO_DACNF_TXADD7_Pos ) /*!< Bit mask of TXADD7 field. */

/* Bit 14 : TxAdd for device address 6 */
#define RADIO_DACNF_TXADD6_Pos       ( 14UL )                            /*!< Position of TXADD6 field. */
#define RADIO_DACNF_TXADD6_Msk       ( 0x1UL << RADIO_DACNF_TXADD6_Pos ) /*!< Bit mask of TXADD6 field. */

/* Bit 13 : TxAdd for device address 5 */
#define RADIO_DACNF_TXADD5_Pos       ( 13UL )                            /*!< Position of TXADD5 field. */
#define RADIO_DACNF_TXADD5_Msk       ( 0x1UL << RADIO_DACNF_TXADD5_Pos ) /*!< Bit mask of TXADD5 field. */

/* Bit 12 : TxAdd for device address 4 */
#define RADIO_DACNF_TXADD4_Pos       ( 12UL )                            /*!< Position of TXADD4 field. */
#define RADIO_DACNF_TXADD4_Msk       ( 0x1UL << RADIO_DACNF_TXADD4_Pos ) /*!< Bit mask of TXADD4 field. */

/* Bit 11 : TxAdd for device address 3 */
#define RADIO_DACNF_TXADD3_Pos       ( 11UL )                            /*!< Position of TXADD3 field. */
#define RADIO_DACNF_TXADD3_Msk       ( 0x1UL << RADIO_DACNF_TXADD3_Pos ) /*!< Bit mask of TXADD3 field. */

/* Bit 10 : TxAdd for device address 2 */
#define RADIO_DACNF_TXADD2_Pos       ( 10UL )                            /*!< Position of TXADD2 field. */
#define RADIO_DACNF_TXADD2_Msk       ( 0x1UL << RADIO_DACNF_TXADD2_Pos ) /*!< Bit mask of TXADD2 field. */

/* Bit 9 : TxAdd for device address 1 */
#define RADIO_DACNF_TXADD1_Pos       ( 9UL )                             /*!< Position of TXADD1 field. */
#define RADIO_DACNF_TXADD1_Msk       ( 0x1UL << RADIO_DACNF_TXADD1_Pos ) /*!< Bit mask of TXADD1 field. */

/* Bit 8 : TxAdd for device address 0 */
#define RADIO_DACNF_TXADD0_Pos       ( 8UL )                             /*!< Position of TXADD0 field. */
#define RADIO_DACNF_TXADD0_Msk       ( 0x1UL << RADIO_DACNF_TXADD0_Pos ) /*!< Bit mask of TXADD0 field. */

/* Bit 7 : Enable or disable device address matching using device address 7 */
#define RADIO_DACNF_ENA7_Pos         ( 7UL )                           /*!< Position of ENA7 field. */
#define RADIO_DACNF_ENA7_Msk         ( 0x1UL << RADIO_DACNF_ENA7_Pos ) /*!< Bit mask of ENA7 field. */
#define RADIO_DACNF_ENA7_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA7_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 6 : Enable or disable device address matching using device address 6 */
#define RADIO_DACNF_ENA6_Pos         ( 6UL )                           /*!< Position of ENA6 field. */
#define RADIO_DACNF_ENA6_Msk         ( 0x1UL << RADIO_DACNF_ENA6_Pos ) /*!< Bit mask of ENA6 field. */
#define RADIO_DACNF_ENA6_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA6_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 5 : Enable or disable device address matching using device address 5 */
#define RADIO_DACNF_ENA5_Pos         ( 5UL )                           /*!< Position of ENA5 field. */
#define RADIO_DACNF_ENA5_Msk         ( 0x1UL << RADIO_DACNF_ENA5_Pos ) /*!< Bit mask of ENA5 field. */
#define RADIO_DACNF_ENA5_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA5_Enabled     ( 1UL )                           /*!< Enabled */

