FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 4 : Enable or disable device address matching using device address 4 */
#define RADIO_DACNF_ENA4_Pos         ( 4UL )                           /*!< Position of ENA4 field. */
#define RADIO_DACNF_ENA4_Msk         ( 0x1UL << RADIO_DACNF_ENA4_Pos ) /*!< Bit mask of ENA4 field. */
#define RADIO_DACNF_ENA4_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA4_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 3 : Enable or disable device address matching using device address 3 */
#define RADIO_DACNF_ENA3_Pos         ( 3UL )                           /*!< Position of ENA3 field. */
#define RADIO_DACNF_ENA3_Msk         ( 0x1UL << RADIO_DACNF_ENA3_Pos ) /*!< Bit mask of ENA3 field. */
#define RADIO_DACNF_ENA3_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA3_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 2 : Enable or disable device address matching using device address 2 */
#define RADIO_DACNF_ENA2_Pos         ( 2UL )                           /*!< Position of ENA2 field. */
#define RADIO_DACNF_ENA2_Msk         ( 0x1UL << RADIO_DACNF_ENA2_Pos ) /*!< Bit mask of ENA2 field. */
#define RADIO_DACNF_ENA2_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA2_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 1 : Enable or disable device address matching using device address 1 */
#define RADIO_DACNF_ENA1_Pos         ( 1UL )                           /*!< Position of ENA1 field. */
#define RADIO_DACNF_ENA1_Msk         ( 0x1UL << RADIO_DACNF_ENA1_Pos ) /*!< Bit mask of ENA1 field. */
#define RADIO_DACNF_ENA1_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA1_Enabled     ( 1UL )                           /*!< Enabled */

/* Bit 0 : Enable or disable device address matching using device address 0 */
#define RADIO_DACNF_ENA0_Pos         ( 0UL )                           /*!< Position of ENA0 field. */
#define RADIO_DACNF_ENA0_Msk         ( 0x1UL << RADIO_DACNF_ENA0_Pos ) /*!< Bit mask of ENA0 field. */
#define RADIO_DACNF_ENA0_Disabled    ( 0UL )                           /*!< Disabled */
#define RADIO_DACNF_ENA0_Enabled     ( 1UL )                           /*!< Enabled */

/* Register: RADIO_MHRMATCHCONF */
/* Description: Search pattern configuration */

/* Bits 31..0 : Search pattern configuration */
#define RADIO_MHRMATCHCONF_MHRMATCHCONF_Pos    ( 0UL )                                                 /*!< Position of MHRMATCHCONF field. */
#define RADIO_MHRMATCHCONF_MHRMATCHCONF_Msk    ( 0xFFFFFFFFUL << RADIO_MHRMATCHCONF_MHRMATCHCONF_Pos ) /*!< Bit mask of MHRMATCHCONF field. */

/* Register: RADIO_MHRMATCHMAS */
/* Description: Pattern mask */

/* Bits 31..0 : Pattern mask */
#define RADIO_MHRMATCHMAS_MHRMATCHMAS_Pos    ( 0UL )                                               /*!< Position of MHRMATCHMAS field. */
#define RADIO_MHRMATCHMAS_MHRMATCHMAS_Msk    ( 0xFFFFFFFFUL << RADIO_MHRMATCHMAS_MHRMATCHMAS_Pos ) /*!< Bit mask of MHRMATCHMAS field. */

/* Register: RADIO_MODECNF0 */
/* Description: Radio mode configuration register 0 */

/* Bits 9..8 : Default TX value */
#define RADIO_MODECNF0_DTX_Pos       ( 8UL )                             /*!< Position of DTX field. */
#define RADIO_MODECNF0_DTX_Msk       ( 0x3UL << RADIO_MODECNF0_DTX_Pos ) /*!< Bit mask of DTX field. */
#define RADIO_MODECNF0_DTX_B1        ( 0UL )                             /*!< Transmit '1' */
#define RADIO_MODECNF0_DTX_B0        ( 1UL )                             /*!< Transmit '0' */
#define RADIO_MODECNF0_DTX_Center    ( 2UL )                             /*!< Transmit center frequency */

/* Bit 0 : Radio ramp-up time */
#define RADIO_MODECNF0_RU_Pos        ( 0UL )                            /*!< Position of RU field. */
#define RADIO_MODECNF0_RU_Msk        ( 0x1UL << RADIO_MODECNF0_RU_Pos ) /*!< Bit mask of RU field. */
#define RADIO_MODECNF0_RU_Default    ( 0UL )                            /*!< Default ramp-up time (tRXEN and tTXEN), compatible with firmware written for nRF51 */
#define RADIO_MODECNF0_RU_Fast       ( 1UL )                            /*!< Fast ramp-up (tRXEN,FAST and tTXEN,FAST), see electrical specifications for more information */

/* Register: RADIO_SFD */
/* Description: IEEE 802.15.4 start of frame delimiter */

/* Bits 7..0 : IEEE 802.15.4 start of frame delimiter */
#define RADIO_SFD_SFD_Pos    ( 0UL )                         /*!< Position of SFD field. */
#define RADIO_SFD_SFD_Msk    ( 0xFFUL << RADIO_SFD_SFD_Pos ) /*!< Bit mask of SFD field. */

/* Register: RADIO_EDCNT */
/* Description: IEEE 802.15.4 energy detect loop count */

/* Bits 20..0 : IEEE 802.15.4 energy detect loop count */
#define RADIO_EDCNT_EDCNT_Pos    ( 0UL )                                 /*!< Position of EDCNT field. */
#define RADIO_EDCNT_EDCNT_Msk    ( 0x1FFFFFUL << RADIO_EDCNT_EDCNT_Pos ) /*!< Bit mask of EDCNT field. */

/* Register: RADIO_EDSAMPLE */
/* Description: IEEE 802.15.4 energy detect level */

/* Bits 7..0 : IEEE 802.15.4 energy detect level */
#define RADIO_EDSAMPLE_EDLVL_Pos    ( 0UL )                                /*!< Position of EDLVL field. */
#define RADIO_EDSAMPLE_EDLVL_Msk    ( 0xFFUL << RADIO_EDSAMPLE_EDLVL_Pos ) /*!< Bit mask of EDLVL field. */

/* Register: RADIO_CCACTRL */
/* Description: IEEE 802.15.4 clear channel assessment control */

/* Bits 31..24 : Limit for occurances above CCACORRTHRES. When not equal to zero the corrolator based signal detect is enabled. */
#define RADIO_CCACTRL_CCACORRCNT_Pos              ( 24UL )                                   /*!< Position of CCACORRCNT field. */
#define RADIO_CCACTRL_CCACORRCNT_Msk              ( 0xFFUL << RADIO_CCACTRL_CCACORRCNT_Pos ) /*!< Bit mask of CCACORRCNT field. */

/* Bits 23..16 : CCA correlator busy threshold. Only relevant to CarrierMode, CarrierAndEdMode, and CarrierOrEdMode. */
#define RADIO_CCACTRL_CCACORRTHRES_Pos            ( 16UL )                                     /*!< Position of CCACORRTHRES field. */
#define RADIO_CCACTRL_CCACORRTHRES_Msk            ( 0xFFUL << RADIO_CCACTRL_CCACORRTHRES_Pos ) /*!< Bit mask of CCACORRTHRES field. */

/* Bits 15..8 : CCA energy busy threshold. Used in all the CCA modes except CarrierMode. */
#define RADIO_CCACTRL_CCAEDTHRES_Pos              ( 8UL )                                    /*!< Position of CCAEDTHRES field. */
#define RADIO_CCACTRL_CCAEDTHRES_Msk              ( 0xFFUL << RADIO_CCACTRL_CCAEDTHRES_Pos ) /*!< Bit mask of CCAEDTHRES field. */

/* Bits 2..0 : CCA mode of operation */
#define RADIO_CCACTRL_CCAMODE_Pos                 ( 0UL )                                /*!< Position of CCAMODE field. */
#define RADIO_CCACTRL_CCAMODE_Msk                 ( 0x7UL << RADIO_CCACTRL_CCAMODE_Pos ) /*!< Bit mask of CCAMODE field. */
#define RADIO_CCACTRL_CCAMODE_EdMode              ( 0UL )                                /*!< Energy above threshold */
#define RADIO_CCACTRL_CCAMODE_CarrierMode         ( 1UL )                                /*!< Carrier seen */
#define RADIO_CCACTRL_CCAMODE_CarrierAndEdMode    ( 2UL )                                /*!< Energy above threshold AND carrier seen */
#define RADIO_CCACTRL_CCAMODE_CarrierOrEdMode     ( 3UL )                                /*!< Energy above threshold OR carrier seen */
#define RADIO_CCACTRL_CCAMODE_EdModeTest1         ( 4UL )                                /*!< Energy above threshold test mode that will abort when first ED measurement over threshold is seen. No averaging. */

/* Register: RADIO_DFEMODE */
/* Description: Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD) */

/* Bits 1..0 : Direction finding operation mode */
#define RADIO_DFEMODE_DFEOPMODE_Pos         ( 0UL )                                  /*!< Position of DFEOPMODE field. */
#define RADIO_DFEMODE_DFEOPMODE_Msk         ( 0x3UL << RADIO_DFEMODE_DFEOPMODE_Pos ) /*!< Bit mask of DFEOPMODE field. */
#define RADIO_DFEMODE_DFEOPMODE_Disabled    ( 0UL )                                  /*!< Direction finding mode disabled */
#define RADIO_DFEMODE_DFEOPMODE_AoD         ( 2UL )                                  /*!< Direction finding mode set to AoD */
#define RADIO_DFEMODE_DFEOPMODE_AoA         ( 3UL )                                  /*!< Direction finding mode set to AoA */

/* Register: RADIO_CTEINLINECONF */
/* Description: Configuration for CTE inline mode */

/* Bits 31..24 : S0 bit mask to set which bit to match */
#define RADIO_CTEINLINECONF_S0MASK_Pos                  ( 24UL )                                     /*!< Position of S0MASK field. */
#define RADIO_CTEINLINECONF_S0MASK_Msk                  ( 0xFFUL << RADIO_CTEINLINECONF_S0MASK_Pos ) /*!< Bit mask of S0MASK field. */

/* Bits 23..16 : S0 bit pattern to match */
#define RADIO_CTEINLINECONF_S0CONF_Pos                  ( 16UL )                                     /*!< Position of S0CONF field. */
#define RADIO_CTEINLINECONF_S0CONF_Msk                  ( 0xFFUL << RADIO_CTEINLINECONF_S0CONF_Pos ) /*!< Bit mask of S0CONF field. */

/* Bits 15..13 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set. */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos      ( 13UL )                                                /*!< Position of CTEINLINERXMODE2US field. */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Msk      ( 0x7UL << RADIO_CTEINLINECONF_CTEINLINERXMODE2US_Pos ) /*!< Bit mask of CTEINLINERXMODE2US field. */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_4us      ( 1UL )                                                 /*!< 4 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_2us      ( 2UL )                                                 /*!< 2 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_1us      ( 3UL )                                                 /*!< 1 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_500ns    ( 4UL )                                                 /*!< 0.5 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_250ns    ( 5UL )                                                 /*!< 0.25 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_125ns    ( 6UL )                                                 /*!< 0.125 us */

/* Bits 12..10 : Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set. */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_Pos      ( 10UL )                                                /*!< Position of CTEINLINERXMODE1US field. */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_Msk      ( 0x7UL << RADIO_CTEINLINECONF_CTEINLINERXMODE1US_Pos ) /*!< Bit mask of CTEINLINERXMODE1US field. */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_4us      ( 1UL )                                                 /*!< 4 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_2us      ( 2UL )                                                 /*!< 2 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_1us      ( 3UL )                                                 /*!< 1 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_500ns    ( 4UL )                                                 /*!< 0.5 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_250ns    ( 5UL )                                                 /*!< 0.25 us */
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_125ns    ( 6UL )                                                 /*!< 0.125 us */

/* Bits 7..6 : Max range of CTETime */
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_Pos       ( 6UL )                                                /*!< Position of CTETIMEVALIDRANGE field. */
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_Msk       ( 0x3UL << RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_Pos ) /*!< Bit mask of CTETIMEVALIDRANGE field. */
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_20        ( 0UL )                                                /*!< 20 in 8 us unit (default) Set to 20 if parsed CTETime is larger than 20 */
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_31        ( 1UL )                                                /*!< 31 in 8 us unit */
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_63        ( 2UL )                                                /*!< 63 in 8 us unit */

/* Bit 4 : Sampling/switching if CRC is not OK */
#define RADIO_CTEINLINECONF_CTEERRORHANDLING_Pos        ( 4UL )                                               /*!< Position of CTEERRORHANDLING field. */
#define RADIO_CTEINLINECONF_CTEERRORHANDLING_Msk        ( 0x1UL << RADIO_CTEINLINECONF_CTEERRORHANDLING_Pos ) /*!< Bit mask of CTEERRORHANDLING field. */
#define RADIO_CTEINLINECONF_CTEERRORHANDLING_No         ( 0UL )                                               /*!< No sampling and antenna switching when CRC is not OK */
#define RADIO_CTEINLINECONF_CTEERRORHANDLING_Yes        ( 1UL )                                               /*!< Sampling and antenna switching also when CRC is not OK */

