FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 3 : CTEInfo is S1 byte or not */
#define RADIO_CTEINLINECONF_CTEINFOINS1_Pos             ( 3UL )                                          /*!< Position of CTEINFOINS1 field. */
#define RADIO_CTEINLINECONF_CTEINFOINS1_Msk             ( 0x1UL << RADIO_CTEINLINECONF_CTEINFOINS1_Pos ) /*!< Bit mask of CTEINFOINS1 field. */
#define RADIO_CTEINLINECONF_CTEINFOINS1_NotInS1         ( 0UL )                                          /*!< CTEInfo is NOT in S1 byte (advertising PDU) */
#define RADIO_CTEINLINECONF_CTEINFOINS1_InS1            ( 1UL )                                          /*!< CTEInfo is in S1 byte (data PDU) */

/* Bit 0 : Enable parsing of CTEInfo from received packet in BLE modes */
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Pos         ( 0UL )                                              /*!< Position of CTEINLINECTRLEN field. */
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Msk         ( 0x1UL << RADIO_CTEINLINECONF_CTEINLINECTRLEN_Pos ) /*!< Bit mask of CTEINLINECTRLEN field. */
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Disabled    ( 0UL )                                              /*!< Parsing of CTEInfo is disabled */
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_Enabled     ( 1UL )                                              /*!< Parsing of CTEInfo is enabled */

/* Register: RADIO_DFECTRL1 */
/* Description: Various configuration for Direction finding */

/* Bits 27..24 : Gain will be lowered by the specified number of gain steps at the start of CTE */
#define RADIO_DFECTRL1_AGCBACKOFFGAIN_Pos         ( 24UL )                                       /*!< Position of AGCBACKOFFGAIN field. */
#define RADIO_DFECTRL1_AGCBACKOFFGAIN_Msk         ( 0xFUL << RADIO_DFECTRL1_AGCBACKOFFGAIN_Pos ) /*!< Bit mask of AGCBACKOFFGAIN field. */

/* Bits 23..20 : Repeat each individual antenna pattern N times sequentially, i.e. P0, P0, P1, P1, P2, P2, P3, P3, etc. */
#define RADIO_DFECTRL1_REPEATPATTERN_Pos          ( 20UL )                                      /*!< Position of REPEATPATTERN field. */
#define RADIO_DFECTRL1_REPEATPATTERN_Msk          ( 0xFUL << RADIO_DFECTRL1_REPEATPATTERN_Pos ) /*!< Bit mask of REPEATPATTERN field. */
#define RADIO_DFECTRL1_REPEATPATTERN_NoRepeat     ( 0UL )                                       /*!< Do not repeat (1 time in total) */

/* Bits 18..16 : Interval between samples in the SWITCHING period when CTEINLINECTRLEN is 0 */
#define RADIO_DFECTRL1_TSAMPLESPACING_Pos         ( 16UL )                                       /*!< Position of TSAMPLESPACING field. */
#define RADIO_DFECTRL1_TSAMPLESPACING_Msk         ( 0x7UL << RADIO_DFECTRL1_TSAMPLESPACING_Pos ) /*!< Bit mask of TSAMPLESPACING field. */
#define RADIO_DFECTRL1_TSAMPLESPACING_4us         ( 1UL )                                        /*!< 4 us */
#define RADIO_DFECTRL1_TSAMPLESPACING_2us         ( 2UL )                                        /*!< 2 us */
#define RADIO_DFECTRL1_TSAMPLESPACING_1us         ( 3UL )                                        /*!< 1 us */
#define RADIO_DFECTRL1_TSAMPLESPACING_500ns       ( 4UL )                                        /*!< 0.5 us */
#define RADIO_DFECTRL1_TSAMPLESPACING_250ns       ( 5UL )                                        /*!< 0.25 us */
#define RADIO_DFECTRL1_TSAMPLESPACING_125ns       ( 6UL )                                        /*!< 0.125 us */

/* Bit 15 : Whether to sample I/Q or magnitude/phase */
#define RADIO_DFECTRL1_SAMPLETYPE_Pos             ( 15UL )                                   /*!< Position of SAMPLETYPE field. */
#define RADIO_DFECTRL1_SAMPLETYPE_Msk             ( 0x1UL << RADIO_DFECTRL1_SAMPLETYPE_Pos ) /*!< Bit mask of SAMPLETYPE field. */
#define RADIO_DFECTRL1_SAMPLETYPE_IQ              ( 0UL )                                    /*!< Complex samples in I and Q */
#define RADIO_DFECTRL1_SAMPLETYPE_MagPhase        ( 1UL )                                    /*!< Complex samples as magnitude and phase */

/* Bits 14..12 : Interval between samples in the REFERENCE period */
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_Pos      ( 12UL )                                          /*!< Position of TSAMPLESPACINGREF field. */
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_Msk      ( 0x7UL << RADIO_DFECTRL1_TSAMPLESPACINGREF_Pos ) /*!< Bit mask of TSAMPLESPACINGREF field. */
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_4us      ( 1UL )                                           /*!< 4 us */
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_2us      ( 2UL )                                           /*!< 2 us */
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_1us      ( 3UL )                                           /*!< 1 us */
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_500ns    ( 4UL )                                           /*!< 0.5 us */
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_250ns    ( 5UL )                                           /*!< 0.25 us */
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_125ns    ( 6UL )                                           /*!< 0.125 us */

/* Bits 10..8 : Interval between every time the antenna is changed in the SWITCHING state */
#define RADIO_DFECTRL1_TSWITCHSPACING_Pos         ( 8UL )                                        /*!< Position of TSWITCHSPACING field. */
#define RADIO_DFECTRL1_TSWITCHSPACING_Msk         ( 0x7UL << RADIO_DFECTRL1_TSWITCHSPACING_Pos ) /*!< Bit mask of TSWITCHSPACING field. */
#define RADIO_DFECTRL1_TSWITCHSPACING_4us         ( 1UL )                                        /*!< 4 us */
#define RADIO_DFECTRL1_TSWITCHSPACING_2us         ( 2UL )                                        /*!< 2 us */
#define RADIO_DFECTRL1_TSWITCHSPACING_1us         ( 3UL )                                        /*!< 1 us */

/* Bit 7 : Add CTE extension and do antenna switching/sampling in this extension */
#define RADIO_DFECTRL1_DFEINEXTENSION_Pos         ( 7UL )                                        /*!< Position of DFEINEXTENSION field. */
#define RADIO_DFECTRL1_DFEINEXTENSION_Msk         ( 0x1UL << RADIO_DFECTRL1_DFEINEXTENSION_Pos ) /*!< Bit mask of DFEINEXTENSION field. */
#define RADIO_DFECTRL1_DFEINEXTENSION_Payload     ( 0UL )                                        /*!< Antenna switching/sampling is done in the packet payload */
#define RADIO_DFECTRL1_DFEINEXTENSION_CRC         ( 1UL )                                        /*!< AoA/AoD procedure triggered at end of CRC */

