FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 5..0 : Length of the AoA/AoD procedure in number of 8 us units */
#define RADIO_DFECTRL1_NUMBEROF8US_Pos            ( 0UL )                                      /*!< Position of NUMBEROF8US field. */
#define RADIO_DFECTRL1_NUMBEROF8US_Msk            ( 0x3FUL << RADIO_DFECTRL1_NUMBEROF8US_Pos ) /*!< Bit mask of NUMBEROF8US field. */

/* Register: RADIO_DFECTRL2 */
/* Description: Start offset for Direction finding */

/* Bits 27..16 : Signed value offset in number of 16 MHz clock cycles for fine tuning of the sampling instant for all IQ samples. With TSAMPLEOFFSET=0 the first sample is taken immediately at the start of the reference period */
#define RADIO_DFECTRL2_TSAMPLEOFFSET_Pos    ( 16UL )                                        /*!< Position of TSAMPLEOFFSET field. */
#define RADIO_DFECTRL2_TSAMPLEOFFSET_Msk    ( 0xFFFUL << RADIO_DFECTRL2_TSAMPLEOFFSET_Pos ) /*!< Bit mask of TSAMPLEOFFSET field. */

/* Bits 12..0 : Signed value offset after the end of the CRC before starting switching in number of 16 MHz clock cycles */
#define RADIO_DFECTRL2_TSWITCHOFFSET_Pos    ( 0UL )                                          /*!< Position of TSWITCHOFFSET field. */
#define RADIO_DFECTRL2_TSWITCHOFFSET_Msk    ( 0x1FFFUL << RADIO_DFECTRL2_TSWITCHOFFSET_Pos ) /*!< Bit mask of TSWITCHOFFSET field. */

/* Register: RADIO_SWITCHPATTERN */
/* Description: GPIO patterns to be used for each antenna */

/* Bits 7..0 : Fill array of GPIO patterns for antenna control. */
#define RADIO_SWITCHPATTERN_SWITCHPATTERN_Pos    ( 0UL )                                             /*!< Position of SWITCHPATTERN field. */
#define RADIO_SWITCHPATTERN_SWITCHPATTERN_Msk    ( 0xFFUL << RADIO_SWITCHPATTERN_SWITCHPATTERN_Pos ) /*!< Bit mask of SWITCHPATTERN field. */

/* Register: RADIO_CLEARPATTERN */
/* Description: Clear the GPIO pattern array for antenna control */

/* Bit 0 : Clears GPIO pattern array for antenna control */
#define RADIO_CLEARPATTERN_CLEARPATTERN_Pos      ( 0UL )                                          /*!< Position of CLEARPATTERN field. */
#define RADIO_CLEARPATTERN_CLEARPATTERN_Msk      ( 0x1UL << RADIO_CLEARPATTERN_CLEARPATTERN_Pos ) /*!< Bit mask of CLEARPATTERN field. */
#define RADIO_CLEARPATTERN_CLEARPATTERN_Clear    ( 1UL )                                          /*!< Clear the GPIO pattern */

/* Register: RADIO_PSEL_DFEGPIO */
/* Description: Description collection: Pin select for DFE pin n */

/* Bit 31 : Connection */
#define RADIO_PSEL_DFEGPIO_CONNECT_Pos             ( 31UL )                                    /*!< Position of CONNECT field. */
#define RADIO_PSEL_DFEGPIO_CONNECT_Msk             ( 0x1UL << RADIO_PSEL_DFEGPIO_CONNECT_Pos ) /*!< Bit mask of CONNECT field. */
#define RADIO_PSEL_DFEGPIO_CONNECT_Connected       ( 0UL )                                     /*!< Connect */
#define RADIO_PSEL_DFEGPIO_CONNECT_Disconnected    ( 1UL )                                     /*!< Disconnect */

/* Bit 5 : Port number */
#define RADIO_PSEL_DFEGPIO_PORT_Pos                ( 5UL )                                  /*!< Position of PORT field. */
#define RADIO_PSEL_DFEGPIO_PORT_Msk                ( 0x1UL << RADIO_PSEL_DFEGPIO_PORT_Pos ) /*!< Bit mask of PORT field. */

/* Bits 4..0 : Pin number */
#define RADIO_PSEL_DFEGPIO_PIN_Pos                 ( 0UL )                                  /*!< Position of PIN field. */
#define RADIO_PSEL_DFEGPIO_PIN_Msk                 ( 0x1FUL << RADIO_PSEL_DFEGPIO_PIN_Pos ) /*!< Bit mask of PIN field. */

/* Register: RADIO_DFEPACKET_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define RADIO_DFEPACKET_PTR_PTR_Pos    ( 0UL )                                         /*!< Position of PTR field. */
#define RADIO_DFEPACKET_PTR_PTR_Msk    ( 0xFFFFFFFFUL << RADIO_DFEPACKET_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: RADIO_DFEPACKET_MAXCNT */
/* Description: Maximum number of buffer words to transfer */

/* Bits 13..0 : Maximum number of buffer words to transfer */
#define RADIO_DFEPACKET_MAXCNT_MAXCNT_Pos    ( 0UL )                                           /*!< Position of MAXCNT field. */
#define RADIO_DFEPACKET_MAXCNT_MAXCNT_Msk    ( 0x3FFFUL << RADIO_DFEPACKET_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: RADIO_DFEPACKET_AMOUNT */
/* Description: Number of samples transferred in the last transaction */

/* Bits 15..0 : Number of samples transferred in the last transaction */
#define RADIO_DFEPACKET_AMOUNT_AMOUNT_Pos    ( 0UL )                                           /*!< Position of AMOUNT field. */
#define RADIO_DFEPACKET_AMOUNT_AMOUNT_Msk    ( 0xFFFFUL << RADIO_DFEPACKET_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: RADIO_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define RADIO_POWER_POWER_Pos         ( 0UL )                            /*!< Position of POWER field. */
#define RADIO_POWER_POWER_Msk         ( 0x1UL << RADIO_POWER_POWER_Pos ) /*!< Bit mask of POWER field. */
#define RADIO_POWER_POWER_Disabled    ( 0UL )                            /*!< Peripheral is powered off */
#define RADIO_POWER_POWER_Enabled     ( 1UL )                            /*!< Peripheral is powered on */


/* Peripheral: RESET */
/* Description: Reset control */

/* Register: RESET_RESETREAS */
/* Description: Reset reason */

/* Bit 27 : Reset from network CTRL-AP detected */
#define RESET_RESETREAS_LCTRLAP_Pos              ( 27UL )                                 /*!< Position of LCTRLAP field. */
#define RESET_RESETREAS_LCTRLAP_Msk              ( 0x1UL << RESET_RESETREAS_LCTRLAP_Pos ) /*!< Bit mask of LCTRLAP field. */
#define RESET_RESETREAS_LCTRLAP_NotDetected      ( 0UL )                                  /*!< Not detected */
#define RESET_RESETREAS_LCTRLAP_Detected         ( 1UL )                                  /*!< Detected */

/* Bit 26 : Reset after wakeup from System OFF mode due to VBUS rising into valid range */
#define RESET_RESETREAS_VBUS_Pos                 ( 26UL )                              /*!< Position of VBUS field. */
#define RESET_RESETREAS_VBUS_Msk                 ( 0x1UL << RESET_RESETREAS_VBUS_Pos ) /*!< Bit mask of VBUS field. */
#define RESET_RESETREAS_VBUS_NotDetected         ( 0UL )                               /*!< Not detected */
#define RESET_RESETREAS_VBUS_Detected            ( 1UL )                               /*!< Detected */

/* Bit 25 : Reset from application watchdog timer 1 detected */
#define RESET_RESETREAS_DOG1_Pos                 ( 25UL )                              /*!< Position of DOG1 field. */
#define RESET_RESETREAS_DOG1_Msk                 ( 0x1UL << RESET_RESETREAS_DOG1_Pos ) /*!< Bit mask of DOG1 field. */
#define RESET_RESETREAS_DOG1_NotDetected         ( 0UL )                               /*!< Not detected */
#define RESET_RESETREAS_DOG1_Detected            ( 1UL )                               /*!< Detected */

/* Bit 24 : Reset after wakeup from System OFF mode due to NFC field being detected */
#define RESET_RESETREAS_NFC_Pos                  ( 24UL )                             /*!< Position of NFC field. */
#define RESET_RESETREAS_NFC_Msk                  ( 0x1UL << RESET_RESETREAS_NFC_Pos ) /*!< Bit mask of NFC field. */
#define RESET_RESETREAS_NFC_NotDetected          ( 0UL )                              /*!< Not detected */
#define RESET_RESETREAS_NFC_Detected             ( 1UL )                              /*!< Detected */

