FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 23 : Force-OFF reset from application core detected */
#define RESET_RESETREAS_MFORCEOFF_Pos            ( 23UL )                                   /*!< Position of MFORCEOFF field. */
#define RESET_RESETREAS_MFORCEOFF_Msk            ( 0x1UL << RESET_RESETREAS_MFORCEOFF_Pos ) /*!< Bit mask of MFORCEOFF field. */
#define RESET_RESETREAS_MFORCEOFF_NotDetected    ( 0UL )                                    /*!< Not detected */
#define RESET_RESETREAS_MFORCEOFF_Detected       ( 1UL )                                    /*!< Detected */

/* Bit 18 : Reset from network watchdog timer detected */
#define RESET_RESETREAS_LDOG_Pos                 ( 18UL )                              /*!< Position of LDOG field. */
#define RESET_RESETREAS_LDOG_Msk                 ( 0x1UL << RESET_RESETREAS_LDOG_Pos ) /*!< Bit mask of LDOG field. */
#define RESET_RESETREAS_LDOG_NotDetected         ( 0UL )                               /*!< Not detected */
#define RESET_RESETREAS_LDOG_Detected            ( 1UL )                               /*!< Detected */

/* Bit 17 : Reset from network CPU lockup detected */
#define RESET_RESETREAS_LLOCKUP_Pos              ( 17UL )                                 /*!< Position of LLOCKUP field. */
#define RESET_RESETREAS_LLOCKUP_Msk              ( 0x1UL << RESET_RESETREAS_LLOCKUP_Pos ) /*!< Bit mask of LLOCKUP field. */
#define RESET_RESETREAS_LLOCKUP_NotDetected      ( 0UL )                                  /*!< Not detected */
#define RESET_RESETREAS_LLOCKUP_Detected         ( 1UL )                                  /*!< Detected */

/* Bit 16 : Reset from network soft reset detected */
#define RESET_RESETREAS_LSREQ_Pos                ( 16UL )                               /*!< Position of LSREQ field. */
#define RESET_RESETREAS_LSREQ_Msk                ( 0x1UL << RESET_RESETREAS_LSREQ_Pos ) /*!< Bit mask of LSREQ field. */
#define RESET_RESETREAS_LSREQ_NotDetected        ( 0UL )                                /*!< Not detected */
#define RESET_RESETREAS_LSREQ_Detected           ( 1UL )                                /*!< Detected */

/* Bit 7 : Reset due to wakeup from System OFF mode when wakeup is triggered by entering the Debug Interface mode */
#define RESET_RESETREAS_DIF_Pos                  ( 7UL )                              /*!< Position of DIF field. */
#define RESET_RESETREAS_DIF_Msk                  ( 0x1UL << RESET_RESETREAS_DIF_Pos ) /*!< Bit mask of DIF field. */
#define RESET_RESETREAS_DIF_NotDetected          ( 0UL )                              /*!< Not detected */
#define RESET_RESETREAS_DIF_Detected             ( 1UL )                              /*!< Detected */

/* Bit 6 : Reset due to wakeup from System OFF mode when wakeup is triggered by ANADETECT signal from LPCOMP */
#define RESET_RESETREAS_LPCOMP_Pos               ( 6UL )                                 /*!< Position of LPCOMP field. */
#define RESET_RESETREAS_LPCOMP_Msk               ( 0x1UL << RESET_RESETREAS_LPCOMP_Pos ) /*!< Bit mask of LPCOMP field. */
#define RESET_RESETREAS_LPCOMP_NotDetected       ( 0UL )                                 /*!< Not detected */
#define RESET_RESETREAS_LPCOMP_Detected          ( 1UL )                                 /*!< Detected */

/* Bit 5 : Reset due to wakeup from System OFF mode when wakeup is triggered by DETECT signal from GPIO */
#define RESET_RESETREAS_OFF_Pos                  ( 5UL )                              /*!< Position of OFF field. */
#define RESET_RESETREAS_OFF_Msk                  ( 0x1UL << RESET_RESETREAS_OFF_Pos ) /*!< Bit mask of OFF field. */
#define RESET_RESETREAS_OFF_NotDetected          ( 0UL )                              /*!< Not detected */
#define RESET_RESETREAS_OFF_Detected             ( 1UL )                              /*!< Detected */

/* Bit 4 : Reset from application CPU lockup detected */
#define RESET_RESETREAS_LOCKUP_Pos               ( 4UL )                                 /*!< Position of LOCKUP field. */
#define RESET_RESETREAS_LOCKUP_Msk               ( 0x1UL << RESET_RESETREAS_LOCKUP_Pos ) /*!< Bit mask of LOCKUP field. */
#define RESET_RESETREAS_LOCKUP_NotDetected       ( 0UL )                                 /*!< Not detected */
#define RESET_RESETREAS_LOCKUP_Detected          ( 1UL )                                 /*!< Detected */

/* Bit 3 : Reset from application soft reset detected */
#define RESET_RESETREAS_SREQ_Pos                 ( 3UL )                               /*!< Position of SREQ field. */
#define RESET_RESETREAS_SREQ_Msk                 ( 0x1UL << RESET_RESETREAS_SREQ_Pos ) /*!< Bit mask of SREQ field. */
#define RESET_RESETREAS_SREQ_NotDetected         ( 0UL )                               /*!< Not detected */
#define RESET_RESETREAS_SREQ_Detected            ( 1UL )                               /*!< Detected */

/* Bit 2 : Reset from application CTRL-AP detected */
#define RESET_RESETREAS_CTRLAP_Pos               ( 2UL )                                 /*!< Position of CTRLAP field. */
#define RESET_RESETREAS_CTRLAP_Msk               ( 0x1UL << RESET_RESETREAS_CTRLAP_Pos ) /*!< Bit mask of CTRLAP field. */
#define RESET_RESETREAS_CTRLAP_NotDetected       ( 0UL )                                 /*!< Not detected */
#define RESET_RESETREAS_CTRLAP_Detected          ( 1UL )                                 /*!< Detected */

/* Bit 1 : Reset from application watchdog timer 0 detected */
#define RESET_RESETREAS_DOG0_Pos                 ( 1UL )                               /*!< Position of DOG0 field. */
#define RESET_RESETREAS_DOG0_Msk                 ( 0x1UL << RESET_RESETREAS_DOG0_Pos ) /*!< Bit mask of DOG0 field. */
#define RESET_RESETREAS_DOG0_NotDetected         ( 0UL )                               /*!< Not detected */
#define RESET_RESETREAS_DOG0_Detected            ( 1UL )                               /*!< Detected */

/* Bit 0 : Reset from pin reset detected */
#define RESET_RESETREAS_RESETPIN_Pos             ( 0UL )                                   /*!< Position of RESETPIN field. */
#define RESET_RESETREAS_RESETPIN_Msk             ( 0x1UL << RESET_RESETREAS_RESETPIN_Pos ) /*!< Bit mask of RESETPIN field. */
#define RESET_RESETREAS_RESETPIN_NotDetected     ( 0UL )                                   /*!< Not detected */
#define RESET_RESETREAS_RESETPIN_Detected        ( 1UL )                                   /*!< Detected */


/* Peripheral: RNG */
/* Description: Random Number Generator */

/* Register: RNG_TASKS_START */
/* Description: Task starting the random number generator */

/* Bit 0 : Task starting the random number generator */
#define RNG_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define RNG_TASKS_START_TASKS_START_Msk        ( 0x1UL << RNG_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define RNG_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: RNG_TASKS_STOP */
/* Description: Task stopping the random number generator */

/* Bit 0 : Task stopping the random number generator */
#define RNG_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define RNG_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << RNG_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define RNG_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: RNG_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define RNG_SUBSCRIBE_START_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define RNG_SUBSCRIBE_START_EN_Msk         ( 0x1UL << RNG_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define RNG_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define RNG_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define RNG_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define RNG_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << RNG_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RNG_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define RNG_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define RNG_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << RNG_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define RNG_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                /*!< Disable subscription */
#define RNG_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define RNG_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define RNG_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << RNG_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RNG_EVENTS_VALRDY */
/* Description: Event being generated for every new random number written to the VALUE register */

/* Bit 0 : Event being generated for every new random number written to the VALUE register */
#define RNG_EVENTS_VALRDY_EVENTS_VALRDY_Pos             ( 0UL )                                          /*!< Position of EVENTS_VALRDY field. */
#define RNG_EVENTS_VALRDY_EVENTS_VALRDY_Msk             ( 0x1UL << RNG_EVENTS_VALRDY_EVENTS_VALRDY_Pos ) /*!< Bit mask of EVENTS_VALRDY field. */
#define RNG_EVENTS_VALRDY_EVENTS_VALRDY_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define RNG_EVENTS_VALRDY_EVENTS_VALRDY_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: RNG_PUBLISH_VALRDY */
/* Description: Publish configuration for event VALRDY */

/* Bit 31 :   */
#define RNG_PUBLISH_VALRDY_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define RNG_PUBLISH_VALRDY_EN_Msk         ( 0x1UL << RNG_PUBLISH_VALRDY_EN_Pos ) /*!< Bit mask of EN field. */
#define RNG_PUBLISH_VALRDY_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define RNG_PUBLISH_VALRDY_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

