FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: RTC_SUBSCRIBE_CAPTURE */
/* Description: Description collection: Subscribe configuration for task CAPTURE[n] */

/* Bit 31 :   */
#define RTC_SUBSCRIBE_CAPTURE_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define RTC_SUBSCRIBE_CAPTURE_EN_Msk         ( 0x1UL << RTC_SUBSCRIBE_CAPTURE_EN_Pos ) /*!< Bit mask of EN field. */
#define RTC_SUBSCRIBE_CAPTURE_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define RTC_SUBSCRIBE_CAPTURE_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CAPTURE[n] will subscribe to */
#define RTC_SUBSCRIBE_CAPTURE_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define RTC_SUBSCRIBE_CAPTURE_CHIDX_Msk      ( 0xFFUL << RTC_SUBSCRIBE_CAPTURE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RTC_EVENTS_TICK */
/* Description: Event on counter increment */

/* Bit 0 : Event on counter increment */
#define RTC_EVENTS_TICK_EVENTS_TICK_Pos             ( 0UL )                                      /*!< Position of EVENTS_TICK field. */
#define RTC_EVENTS_TICK_EVENTS_TICK_Msk             ( 0x1UL << RTC_EVENTS_TICK_EVENTS_TICK_Pos ) /*!< Bit mask of EVENTS_TICK field. */
#define RTC_EVENTS_TICK_EVENTS_TICK_NotGenerated    ( 0UL )                                      /*!< Event not generated */
#define RTC_EVENTS_TICK_EVENTS_TICK_Generated       ( 1UL )                                      /*!< Event generated */

/* Register: RTC_EVENTS_OVRFLW */
/* Description: Event on counter overflow */

/* Bit 0 : Event on counter overflow */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos             ( 0UL )                                          /*!< Position of EVENTS_OVRFLW field. */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Msk             ( 0x1UL << RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Pos ) /*!< Bit mask of EVENTS_OVRFLW field. */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_NotGenerated    ( 0UL )                                          /*!< Event not generated */
#define RTC_EVENTS_OVRFLW_EVENTS_OVRFLW_Generated       ( 1UL )                                          /*!< Event generated */

/* Register: RTC_EVENTS_COMPARE */
/* Description: Description collection: Compare event on CC[n] match */

/* Bit 0 : Compare event on CC[n] match */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos             ( 0UL )                                            /*!< Position of EVENTS_COMPARE field. */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Msk             ( 0x1UL << RTC_EVENTS_COMPARE_EVENTS_COMPARE_Pos ) /*!< Bit mask of EVENTS_COMPARE field. */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define RTC_EVENTS_COMPARE_EVENTS_COMPARE_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: RTC_PUBLISH_TICK */
/* Description: Publish configuration for event TICK */

/* Bit 31 :   */
#define RTC_PUBLISH_TICK_EN_Pos         ( 31UL )                             /*!< Position of EN field. */
#define RTC_PUBLISH_TICK_EN_Msk         ( 0x1UL << RTC_PUBLISH_TICK_EN_Pos ) /*!< Bit mask of EN field. */
#define RTC_PUBLISH_TICK_EN_Disabled    ( 0UL )                              /*!< Disable publishing */
#define RTC_PUBLISH_TICK_EN_Enabled     ( 1UL )                              /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TICK will publish to. */
#define RTC_PUBLISH_TICK_CHIDX_Pos      ( 0UL )                                  /*!< Position of CHIDX field. */
#define RTC_PUBLISH_TICK_CHIDX_Msk      ( 0xFFUL << RTC_PUBLISH_TICK_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RTC_PUBLISH_OVRFLW */
/* Description: Publish configuration for event OVRFLW */

/* Bit 31 :   */
#define RTC_PUBLISH_OVRFLW_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define RTC_PUBLISH_OVRFLW_EN_Msk         ( 0x1UL << RTC_PUBLISH_OVRFLW_EN_Pos ) /*!< Bit mask of EN field. */
#define RTC_PUBLISH_OVRFLW_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define RTC_PUBLISH_OVRFLW_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event OVRFLW will publish to. */
#define RTC_PUBLISH_OVRFLW_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define RTC_PUBLISH_OVRFLW_CHIDX_Msk      ( 0xFFUL << RTC_PUBLISH_OVRFLW_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RTC_PUBLISH_COMPARE */
/* Description: Description collection: Publish configuration for event COMPARE[n] */

/* Bit 31 :   */
#define RTC_PUBLISH_COMPARE_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define RTC_PUBLISH_COMPARE_EN_Msk         ( 0x1UL << RTC_PUBLISH_COMPARE_EN_Pos ) /*!< Bit mask of EN field. */
#define RTC_PUBLISH_COMPARE_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define RTC_PUBLISH_COMPARE_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event COMPARE[n] will publish to. */
#define RTC_PUBLISH_COMPARE_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define RTC_PUBLISH_COMPARE_CHIDX_Msk      ( 0xFFUL << RTC_PUBLISH_COMPARE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: RTC_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 3 : Shortcut between event COMPARE[3] and task CLEAR */
#define RTC_SHORTS_COMPARE3_CLEAR_Pos         ( 3UL )                                    /*!< Position of COMPARE3_CLEAR field. */
#define RTC_SHORTS_COMPARE3_CLEAR_Msk         ( 0x1UL << RTC_SHORTS_COMPARE3_CLEAR_Pos ) /*!< Bit mask of COMPARE3_CLEAR field. */
#define RTC_SHORTS_COMPARE3_CLEAR_Disabled    ( 0UL )                                    /*!< Disable shortcut */
#define RTC_SHORTS_COMPARE3_CLEAR_Enabled     ( 1UL )                                    /*!< Enable shortcut */

