FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 19 : Write '1' to disable event routing for event COMPARE[3] */
#define RTC_EVTENCLR_COMPARE3_Pos         ( 19UL )                               /*!< Position of COMPARE3 field. */
#define RTC_EVTENCLR_COMPARE3_Msk         ( 0x1UL << RTC_EVTENCLR_COMPARE3_Pos ) /*!< Bit mask of COMPARE3 field. */
#define RTC_EVTENCLR_COMPARE3_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_EVTENCLR_COMPARE3_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_EVTENCLR_COMPARE3_Clear       ( 1UL )                                /*!< Disable */

/* Bit 18 : Write '1' to disable event routing for event COMPARE[2] */
#define RTC_EVTENCLR_COMPARE2_Pos         ( 18UL )                               /*!< Position of COMPARE2 field. */
#define RTC_EVTENCLR_COMPARE2_Msk         ( 0x1UL << RTC_EVTENCLR_COMPARE2_Pos ) /*!< Bit mask of COMPARE2 field. */
#define RTC_EVTENCLR_COMPARE2_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_EVTENCLR_COMPARE2_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_EVTENCLR_COMPARE2_Clear       ( 1UL )                                /*!< Disable */

/* Bit 17 : Write '1' to disable event routing for event COMPARE[1] */
#define RTC_EVTENCLR_COMPARE1_Pos         ( 17UL )                               /*!< Position of COMPARE1 field. */
#define RTC_EVTENCLR_COMPARE1_Msk         ( 0x1UL << RTC_EVTENCLR_COMPARE1_Pos ) /*!< Bit mask of COMPARE1 field. */
#define RTC_EVTENCLR_COMPARE1_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_EVTENCLR_COMPARE1_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_EVTENCLR_COMPARE1_Clear       ( 1UL )                                /*!< Disable */

/* Bit 16 : Write '1' to disable event routing for event COMPARE[0] */
#define RTC_EVTENCLR_COMPARE0_Pos         ( 16UL )                               /*!< Position of COMPARE0 field. */
#define RTC_EVTENCLR_COMPARE0_Msk         ( 0x1UL << RTC_EVTENCLR_COMPARE0_Pos ) /*!< Bit mask of COMPARE0 field. */
#define RTC_EVTENCLR_COMPARE0_Disabled    ( 0UL )                                /*!< Read: Disabled */
#define RTC_EVTENCLR_COMPARE0_Enabled     ( 1UL )                                /*!< Read: Enabled */
#define RTC_EVTENCLR_COMPARE0_Clear       ( 1UL )                                /*!< Disable */

/* Bit 1 : Write '1' to disable event routing for event OVRFLW */
#define RTC_EVTENCLR_OVRFLW_Pos           ( 1UL )                              /*!< Position of OVRFLW field. */
#define RTC_EVTENCLR_OVRFLW_Msk           ( 0x1UL << RTC_EVTENCLR_OVRFLW_Pos ) /*!< Bit mask of OVRFLW field. */
#define RTC_EVTENCLR_OVRFLW_Disabled      ( 0UL )                              /*!< Read: Disabled */
#define RTC_EVTENCLR_OVRFLW_Enabled       ( 1UL )                              /*!< Read: Enabled */
#define RTC_EVTENCLR_OVRFLW_Clear         ( 1UL )                              /*!< Disable */

/* Bit 0 : Write '1' to disable event routing for event TICK */
#define RTC_EVTENCLR_TICK_Pos             ( 0UL )                            /*!< Position of TICK field. */
#define RTC_EVTENCLR_TICK_Msk             ( 0x1UL << RTC_EVTENCLR_TICK_Pos ) /*!< Bit mask of TICK field. */
#define RTC_EVTENCLR_TICK_Disabled        ( 0UL )                            /*!< Read: Disabled */
#define RTC_EVTENCLR_TICK_Enabled         ( 1UL )                            /*!< Read: Enabled */
#define RTC_EVTENCLR_TICK_Clear           ( 1UL )                            /*!< Disable */

/* Register: RTC_COUNTER */
/* Description: Current counter value */

/* Bits 23..0 : Counter value */
#define RTC_COUNTER_COUNTER_Pos    ( 0UL )                                   /*!< Position of COUNTER field. */
#define RTC_COUNTER_COUNTER_Msk    ( 0xFFFFFFUL << RTC_COUNTER_COUNTER_Pos ) /*!< Bit mask of COUNTER field. */

/* Register: RTC_PRESCALER */
/* Description: 12-bit prescaler for counter frequency (32768 / (PRESCALER + 1)). Must be written when RTC is stopped. */

/* Bits 11..0 : Prescaler value */
#define RTC_PRESCALER_PRESCALER_Pos    ( 0UL )                                    /*!< Position of PRESCALER field. */
#define RTC_PRESCALER_PRESCALER_Msk    ( 0xFFFUL << RTC_PRESCALER_PRESCALER_Pos ) /*!< Bit mask of PRESCALER field. */

/* Register: RTC_CC */
/* Description: Description collection: Compare register n */

/* Bits 23..0 : Compare value */
#define RTC_CC_COMPARE_Pos    ( 0UL )                              /*!< Position of COMPARE field. */
#define RTC_CC_COMPARE_Msk    ( 0xFFFFFFUL << RTC_CC_COMPARE_Pos ) /*!< Bit mask of COMPARE field. */


/* Peripheral: SPIM */
/* Description: Serial Peripheral Interface Master with EasyDMA */

/* Register: SPIM_TASKS_START */
/* Description: Start SPI transaction */

/* Bit 0 : Start SPI transaction */
#define SPIM_TASKS_START_TASKS_START_Pos        ( 0UL )                                       /*!< Position of TASKS_START field. */
#define SPIM_TASKS_START_TASKS_START_Msk        ( 0x1UL << SPIM_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define SPIM_TASKS_START_TASKS_START_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: SPIM_TASKS_STOP */
/* Description: Stop SPI transaction */

/* Bit 0 : Stop SPI transaction */
#define SPIM_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define SPIM_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << SPIM_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define SPIM_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: SPIM_TASKS_SUSPEND */
/* Description: Suspend SPI transaction */

/* Bit 0 : Suspend SPI transaction */
#define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos        ( 0UL )                                           /*!< Position of TASKS_SUSPEND field. */
#define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Msk        ( 0x1UL << SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Pos ) /*!< Bit mask of TASKS_SUSPEND field. */
#define SPIM_TASKS_SUSPEND_TASKS_SUSPEND_Trigger    ( 1UL )                                           /*!< Trigger task */

/* Register: SPIM_TASKS_RESUME */
/* Description: Resume SPI transaction */

/* Bit 0 : Resume SPI transaction */
#define SPIM_TASKS_RESUME_TASKS_RESUME_Pos        ( 0UL )                                         /*!< Position of TASKS_RESUME field. */
#define SPIM_TASKS_RESUME_TASKS_RESUME_Msk        ( 0x1UL << SPIM_TASKS_RESUME_TASKS_RESUME_Pos ) /*!< Bit mask of TASKS_RESUME field. */
#define SPIM_TASKS_RESUME_TASKS_RESUME_Trigger    ( 1UL )                                         /*!< Trigger task */

/* Register: SPIM_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define SPIM_SUBSCRIBE_START_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define SPIM_SUBSCRIBE_START_EN_Msk         ( 0x1UL << SPIM_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define SPIM_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define SPIM_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define SPIM_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << SPIM_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIM_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define SPIM_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define SPIM_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << SPIM_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define SPIM_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define SPIM_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define SPIM_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << SPIM_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIM_SUBSCRIBE_SUSPEND */
/* Description: Subscribe configuration for task SUSPEND */

/* Bit 31 :   */
#define SPIM_SUBSCRIBE_SUSPEND_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define SPIM_SUBSCRIBE_SUSPEND_EN_Msk         ( 0x1UL << SPIM_SUBSCRIBE_SUSPEND_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_SUBSCRIBE_SUSPEND_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define SPIM_SUBSCRIBE_SUSPEND_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SUSPEND will subscribe to */
#define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Msk      ( 0xFFUL << SPIM_SUBSCRIBE_SUSPEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

