FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: SPIM_SUBSCRIBE_RESUME */
/* Description: Subscribe configuration for task RESUME */

/* Bit 31 :   */
#define SPIM_SUBSCRIBE_RESUME_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define SPIM_SUBSCRIBE_RESUME_EN_Msk         ( 0x1UL << SPIM_SUBSCRIBE_RESUME_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_SUBSCRIBE_RESUME_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define SPIM_SUBSCRIBE_RESUME_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task RESUME will subscribe to */
#define SPIM_SUBSCRIBE_RESUME_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define SPIM_SUBSCRIBE_RESUME_CHIDX_Msk      ( 0xFFUL << SPIM_SUBSCRIBE_RESUME_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIM_EVENTS_STOPPED */
/* Description: SPI transaction has stopped */

/* Bit 0 : SPI transaction has stopped */
#define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                             /*!< Position of EVENTS_STOPPED field. */
#define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                             /*!< Event not generated */
#define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                             /*!< Event generated */

/* Register: SPIM_EVENTS_ENDRX */
/* Description: End of RXD buffer reached */

/* Bit 0 : End of RXD buffer reached */
#define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Pos             ( 0UL )                                         /*!< Position of EVENTS_ENDRX field. */
#define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Msk             ( 0x1UL << SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Pos ) /*!< Bit mask of EVENTS_ENDRX field. */
#define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define SPIM_EVENTS_ENDRX_EVENTS_ENDRX_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: SPIM_EVENTS_END */
/* Description: End of RXD buffer and TXD buffer reached */

/* Bit 0 : End of RXD buffer and TXD buffer reached */
#define SPIM_EVENTS_END_EVENTS_END_Pos             ( 0UL )                                     /*!< Position of EVENTS_END field. */
#define SPIM_EVENTS_END_EVENTS_END_Msk             ( 0x1UL << SPIM_EVENTS_END_EVENTS_END_Pos ) /*!< Bit mask of EVENTS_END field. */
#define SPIM_EVENTS_END_EVENTS_END_NotGenerated    ( 0UL )                                     /*!< Event not generated */
#define SPIM_EVENTS_END_EVENTS_END_Generated       ( 1UL )                                     /*!< Event generated */

/* Register: SPIM_EVENTS_ENDTX */
/* Description: End of TXD buffer reached */

/* Bit 0 : End of TXD buffer reached */
#define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Pos             ( 0UL )                                         /*!< Position of EVENTS_ENDTX field. */
#define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Msk             ( 0x1UL << SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Pos ) /*!< Bit mask of EVENTS_ENDTX field. */
#define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define SPIM_EVENTS_ENDTX_EVENTS_ENDTX_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: SPIM_EVENTS_STARTED */
/* Description: Transaction started */

/* Bit 0 : Transaction started */
#define SPIM_EVENTS_STARTED_EVENTS_STARTED_Pos             ( 0UL )                                             /*!< Position of EVENTS_STARTED field. */
#define SPIM_EVENTS_STARTED_EVENTS_STARTED_Msk             ( 0x1UL << SPIM_EVENTS_STARTED_EVENTS_STARTED_Pos ) /*!< Bit mask of EVENTS_STARTED field. */
#define SPIM_EVENTS_STARTED_EVENTS_STARTED_NotGenerated    ( 0UL )                                             /*!< Event not generated */
#define SPIM_EVENTS_STARTED_EVENTS_STARTED_Generated       ( 1UL )                                             /*!< Event generated */

/* Register: SPIM_PUBLISH_STOPPED */
/* Description: Publish configuration for event STOPPED */

/* Bit 31 :   */
#define SPIM_PUBLISH_STOPPED_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define SPIM_PUBLISH_STOPPED_EN_Msk         ( 0x1UL << SPIM_PUBLISH_STOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_PUBLISH_STOPPED_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define SPIM_PUBLISH_STOPPED_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STOPPED will publish to. */
#define SPIM_PUBLISH_STOPPED_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define SPIM_PUBLISH_STOPPED_CHIDX_Msk      ( 0xFFUL << SPIM_PUBLISH_STOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: SPIM_PUBLISH_ENDRX */
/* Description: Publish configuration for event ENDRX */

/* Bit 31 :   */
#define SPIM_PUBLISH_ENDRX_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define SPIM_PUBLISH_ENDRX_EN_Msk         ( 0x1UL << SPIM_PUBLISH_ENDRX_EN_Pos ) /*!< Bit mask of EN field. */
#define SPIM_PUBLISH_ENDRX_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define SPIM_PUBLISH_ENDRX_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDRX will publish to. */
#define SPIM_PUBLISH_ENDRX_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define SPIM_PUBLISH_ENDRX_CHIDX_Msk      ( 0xFFUL << SPIM_PUBLISH_ENDRX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

