FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 15..0 : Maximum number of bytes in transmit buffer */
#define SPIS_TXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define SPIS_TXD_MAXCNT_MAXCNT_Msk    ( 0xFFFFUL << SPIS_TXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: SPIS_TXD_AMOUNT */
/* Description: Number of bytes transmitted in last granted transaction */

/* Bits 15..0 : Number of bytes transmitted in last granted transaction */
#define SPIS_TXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define SPIS_TXD_AMOUNT_AMOUNT_Msk    ( 0xFFFFUL << SPIS_TXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: SPIS_TXD_LIST */
/* Description: EasyDMA list type */

/* Bits 1..0 : List type */
#define SPIS_TXD_LIST_LIST_Pos          ( 0UL )                             /*!< Position of LIST field. */
#define SPIS_TXD_LIST_LIST_Msk          ( 0x3UL << SPIS_TXD_LIST_LIST_Pos ) /*!< Bit mask of LIST field. */
#define SPIS_TXD_LIST_LIST_Disabled     ( 0UL )                             /*!< Disable EasyDMA list */
#define SPIS_TXD_LIST_LIST_ArrayList    ( 1UL )                             /*!< Use array list */

/* Register: SPIS_CONFIG */
/* Description: Configuration register */

/* Bit 2 : Serial clock (SCK) polarity */
#define SPIS_CONFIG_CPOL_Pos           ( 2UL )                           /*!< Position of CPOL field. */
#define SPIS_CONFIG_CPOL_Msk           ( 0x1UL << SPIS_CONFIG_CPOL_Pos ) /*!< Bit mask of CPOL field. */
#define SPIS_CONFIG_CPOL_ActiveHigh    ( 0UL )                           /*!< Active high */
#define SPIS_CONFIG_CPOL_ActiveLow     ( 1UL )                           /*!< Active low */

/* Bit 1 : Serial clock (SCK) phase */
#define SPIS_CONFIG_CPHA_Pos           ( 1UL )                           /*!< Position of CPHA field. */
#define SPIS_CONFIG_CPHA_Msk           ( 0x1UL << SPIS_CONFIG_CPHA_Pos ) /*!< Bit mask of CPHA field. */
#define SPIS_CONFIG_CPHA_Leading       ( 0UL )                           /*!< Sample on leading edge of clock, shift serial data on trailing edge */
#define SPIS_CONFIG_CPHA_Trailing      ( 1UL )                           /*!< Sample on trailing edge of clock, shift serial data on leading edge */

/* Bit 0 : Bit order */
#define SPIS_CONFIG_ORDER_Pos          ( 0UL )                            /*!< Position of ORDER field. */
#define SPIS_CONFIG_ORDER_Msk          ( 0x1UL << SPIS_CONFIG_ORDER_Pos ) /*!< Bit mask of ORDER field. */
#define SPIS_CONFIG_ORDER_MsbFirst     ( 0UL )                            /*!< Most significant bit shifted out first */
#define SPIS_CONFIG_ORDER_LsbFirst     ( 1UL )                            /*!< Least significant bit shifted out first */

/* Register: SPIS_DEF */
/* Description: Default character. Character clocked out in case of an ignored transaction. */

/* Bits 7..0 : Default character. Character clocked out in case of an ignored transaction. */
#define SPIS_DEF_DEF_Pos    ( 0UL )                        /*!< Position of DEF field. */
#define SPIS_DEF_DEF_Msk    ( 0xFFUL << SPIS_DEF_DEF_Pos ) /*!< Bit mask of DEF field. */

/* Register: SPIS_ORC */
/* Description: Over-read character */

/* Bits 7..0 : Over-read character. Character clocked out after an over-read of the transmit buffer. */
#define SPIS_ORC_ORC_Pos    ( 0UL )                        /*!< Position of ORC field. */
#define SPIS_ORC_ORC_Msk    ( 0xFFUL << SPIS_ORC_ORC_Pos ) /*!< Bit mask of ORC field. */


/* Peripheral: TEMP */
/* Description: Temperature Sensor */

/* Register: TEMP_TASKS_START */
/* Description: Start temperature measurement */

/* Bit 0 : Start temperature measurement */
#define TEMP_TASKS_START_TASKS_START_Pos        ( 0UL )                                       /*!< Position of TASKS_START field. */
#define TEMP_TASKS_START_TASKS_START_Msk        ( 0x1UL << TEMP_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define TEMP_TASKS_START_TASKS_START_Trigger    ( 1UL )                                       /*!< Trigger task */

/* Register: TEMP_TASKS_STOP */
/* Description: Stop temperature measurement */

/* Bit 0 : Stop temperature measurement */
#define TEMP_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                     /*!< Position of TASKS_STOP field. */
#define TEMP_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << TEMP_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define TEMP_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                     /*!< Trigger task */

/* Register: TEMP_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define TEMP_SUBSCRIBE_START_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define TEMP_SUBSCRIBE_START_EN_Msk         ( 0x1UL << TEMP_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define TEMP_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define TEMP_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define TEMP_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define TEMP_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << TEMP_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TEMP_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define TEMP_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define TEMP_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << TEMP_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define TEMP_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define TEMP_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define TEMP_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define TEMP_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << TEMP_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TEMP_EVENTS_DATARDY */
/* Description: Temperature measurement complete, data ready */

