FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: TEMP_B3 */
/* Description: y-intercept of fourth piecewise linear function */

/* Bits 11..0 : y-intercept of fourth piecewise linear function */
#define TEMP_B3_B3_Pos    ( 0UL )                       /*!< Position of B3 field. */
#define TEMP_B3_B3_Msk    ( 0xFFFUL << TEMP_B3_B3_Pos ) /*!< Bit mask of B3 field. */

/* Register: TEMP_B4 */
/* Description: y-intercept of fifth piecewise linear function */

/* Bits 11..0 : y-intercept of fifth piecewise linear function */
#define TEMP_B4_B4_Pos    ( 0UL )                       /*!< Position of B4 field. */
#define TEMP_B4_B4_Msk    ( 0xFFFUL << TEMP_B4_B4_Pos ) /*!< Bit mask of B4 field. */

/* Register: TEMP_B5 */
/* Description: y-intercept of sixth piecewise linear function */

/* Bits 11..0 : y-intercept of sixth piecewise linear function */
#define TEMP_B5_B5_Pos    ( 0UL )                       /*!< Position of B5 field. */
#define TEMP_B5_B5_Msk    ( 0xFFFUL << TEMP_B5_B5_Pos ) /*!< Bit mask of B5 field. */

/* Register: TEMP_T0 */
/* Description: Endpoint of first piecewise linear function */

/* Bits 7..0 : Endpoint of first piecewise linear function */
#define TEMP_T0_T0_Pos    ( 0UL )                      /*!< Position of T0 field. */
#define TEMP_T0_T0_Msk    ( 0xFFUL << TEMP_T0_T0_Pos ) /*!< Bit mask of T0 field. */

/* Register: TEMP_T1 */
/* Description: Endpoint of second piecewise linear function */

/* Bits 7..0 : Endpoint of second piecewise linear function */
#define TEMP_T1_T1_Pos    ( 0UL )                      /*!< Position of T1 field. */
#define TEMP_T1_T1_Msk    ( 0xFFUL << TEMP_T1_T1_Pos ) /*!< Bit mask of T1 field. */

/* Register: TEMP_T2 */
/* Description: Endpoint of third piecewise linear function */

/* Bits 7..0 : Endpoint of third piecewise linear function */
#define TEMP_T2_T2_Pos    ( 0UL )                      /*!< Position of T2 field. */
#define TEMP_T2_T2_Msk    ( 0xFFUL << TEMP_T2_T2_Pos ) /*!< Bit mask of T2 field. */

/* Register: TEMP_T3 */
/* Description: Endpoint of fourth piecewise linear function */

/* Bits 7..0 : Endpoint of fourth piecewise linear function */
#define TEMP_T3_T3_Pos    ( 0UL )                      /*!< Position of T3 field. */
#define TEMP_T3_T3_Msk    ( 0xFFUL << TEMP_T3_T3_Pos ) /*!< Bit mask of T3 field. */

/* Register: TEMP_T4 */
/* Description: Endpoint of fifth piecewise linear function */

/* Bits 7..0 : Endpoint of fifth piecewise linear function */
#define TEMP_T4_T4_Pos    ( 0UL )                      /*!< Position of T4 field. */
#define TEMP_T4_T4_Msk    ( 0xFFUL << TEMP_T4_T4_Pos ) /*!< Bit mask of T4 field. */


/* Peripheral: TIMER */
/* Description: Timer/Counter 0 */

/* Register: TIMER_TASKS_START */
/* Description: Start Timer */

/* Bit 0 : Start Timer */
#define TIMER_TASKS_START_TASKS_START_Pos        ( 0UL )                                        /*!< Position of TASKS_START field. */
#define TIMER_TASKS_START_TASKS_START_Msk        ( 0x1UL << TIMER_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define TIMER_TASKS_START_TASKS_START_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_STOP */
/* Description: Stop Timer */

/* Bit 0 : Stop Timer */
#define TIMER_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                      /*!< Position of TASKS_STOP field. */
#define TIMER_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << TIMER_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define TIMER_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: TIMER_TASKS_COUNT */
/* Description: Increment Timer (Counter mode only) */

/* Bit 0 : Increment Timer (Counter mode only) */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Pos        ( 0UL )                                        /*!< Position of TASKS_COUNT field. */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Msk        ( 0x1UL << TIMER_TASKS_COUNT_TASKS_COUNT_Pos ) /*!< Bit mask of TASKS_COUNT field. */
#define TIMER_TASKS_COUNT_TASKS_COUNT_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_CLEAR */
/* Description: Clear time */

/* Bit 0 : Clear time */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos        ( 0UL )                                        /*!< Position of TASKS_CLEAR field. */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Msk        ( 0x1UL << TIMER_TASKS_CLEAR_TASKS_CLEAR_Pos ) /*!< Bit mask of TASKS_CLEAR field. */
#define TIMER_TASKS_CLEAR_TASKS_CLEAR_Trigger    ( 1UL )                                        /*!< Trigger task */

/* Register: TIMER_TASKS_SHUTDOWN */
/* Description: Deprecated register - Shut down timer */

/* Bit 0 : Deprecated field -  Shut down timer */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos        ( 0UL )                                              /*!< Position of TASKS_SHUTDOWN field. */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Msk        ( 0x1UL << TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Pos ) /*!< Bit mask of TASKS_SHUTDOWN field. */
#define TIMER_TASKS_SHUTDOWN_TASKS_SHUTDOWN_Trigger    ( 1UL )                                              /*!< Trigger task */

/* Register: TIMER_TASKS_CAPTURE */
/* Description: Description collection: Capture Timer value to CC[n] register */

/* Bit 0 : Capture Timer value to CC[n] register */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos        ( 0UL )                                            /*!< Position of TASKS_CAPTURE field. */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Msk        ( 0x1UL << TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Pos ) /*!< Bit mask of TASKS_CAPTURE field. */
#define TIMER_TASKS_CAPTURE_TASKS_CAPTURE_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: TIMER_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_START_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_START_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define TIMER_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define TIMER_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

