FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: TIMER_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                  /*!< Disable subscription */
#define TIMER_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                  /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define TIMER_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SUBSCRIBE_COUNT */
/* Description: Subscribe configuration for task COUNT */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_COUNT_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_COUNT_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_COUNT_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_COUNT_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define TIMER_SUBSCRIBE_COUNT_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task COUNT will subscribe to */
#define TIMER_SUBSCRIBE_COUNT_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_COUNT_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_COUNT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SUBSCRIBE_CLEAR */
/* Description: Subscribe configuration for task CLEAR */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_CLEAR_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_CLEAR_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_CLEAR_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_CLEAR_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define TIMER_SUBSCRIBE_CLEAR_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CLEAR will subscribe to */
#define TIMER_SUBSCRIBE_CLEAR_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_CLEAR_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_CLEAR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SUBSCRIBE_SHUTDOWN */
/* Description: Deprecated register - Subscribe configuration for task SHUTDOWN */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_SHUTDOWN_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_SHUTDOWN_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_SHUTDOWN_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_SHUTDOWN_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define TIMER_SUBSCRIBE_SHUTDOWN_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SHUTDOWN will subscribe to */
#define TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_SHUTDOWN_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SUBSCRIBE_CAPTURE */
/* Description: Description collection: Subscribe configuration for task CAPTURE[n] */

/* Bit 31 :   */
#define TIMER_SUBSCRIBE_CAPTURE_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define TIMER_SUBSCRIBE_CAPTURE_EN_Msk         ( 0x1UL << TIMER_SUBSCRIBE_CAPTURE_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_SUBSCRIBE_CAPTURE_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define TIMER_SUBSCRIBE_CAPTURE_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CAPTURE[n] will subscribe to */
#define TIMER_SUBSCRIBE_CAPTURE_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define TIMER_SUBSCRIBE_CAPTURE_CHIDX_Msk      ( 0xFFUL << TIMER_SUBSCRIBE_CAPTURE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_EVENTS_COMPARE */
/* Description: Description collection: Compare event on CC[n] match */

/* Bit 0 : Compare event on CC[n] match */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos             ( 0UL )                                              /*!< Position of EVENTS_COMPARE field. */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Msk             ( 0x1UL << TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Pos ) /*!< Bit mask of EVENTS_COMPARE field. */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_NotGenerated    ( 0UL )                                              /*!< Event not generated */
#define TIMER_EVENTS_COMPARE_EVENTS_COMPARE_Generated       ( 1UL )                                              /*!< Event generated */

/* Register: TIMER_PUBLISH_COMPARE */
/* Description: Description collection: Publish configuration for event COMPARE[n] */

/* Bit 31 :   */
#define TIMER_PUBLISH_COMPARE_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TIMER_PUBLISH_COMPARE_EN_Msk         ( 0x1UL << TIMER_PUBLISH_COMPARE_EN_Pos ) /*!< Bit mask of EN field. */
#define TIMER_PUBLISH_COMPARE_EN_Disabled    ( 0UL )                                   /*!< Disable publishing */
#define TIMER_PUBLISH_COMPARE_EN_Enabled     ( 1UL )                                   /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event COMPARE[n] will publish to. */
#define TIMER_PUBLISH_COMPARE_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TIMER_PUBLISH_COMPARE_CHIDX_Msk      ( 0xFFUL << TIMER_PUBLISH_COMPARE_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TIMER_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 23 : Shortcut between event COMPARE[7] and task STOP */
#define TIMER_SHORTS_COMPARE7_STOP_Pos          ( 23UL )                                    /*!< Position of COMPARE7_STOP field. */
#define TIMER_SHORTS_COMPARE7_STOP_Msk          ( 0x1UL << TIMER_SHORTS_COMPARE7_STOP_Pos ) /*!< Bit mask of COMPARE7_STOP field. */
#define TIMER_SHORTS_COMPARE7_STOP_Disabled     ( 0UL )                                     /*!< Disable shortcut */
#define TIMER_SHORTS_COMPARE7_STOP_Enabled      ( 1UL )                                     /*!< Enable shortcut */

