FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 0 : Receive sequence started */
#define TWIM_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos             ( 0UL )                                                 /*!< Position of EVENTS_RXSTARTED field. */
#define TWIM_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Msk             ( 0x1UL << TWIM_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos ) /*!< Bit mask of EVENTS_RXSTARTED field. */
#define TWIM_EVENTS_RXSTARTED_EVENTS_RXSTARTED_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define TWIM_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: TWIM_EVENTS_TXSTARTED */
/* Description: Transmit sequence started */

/* Bit 0 : Transmit sequence started */
#define TWIM_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos             ( 0UL )                                                 /*!< Position of EVENTS_TXSTARTED field. */
#define TWIM_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Msk             ( 0x1UL << TWIM_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos ) /*!< Bit mask of EVENTS_TXSTARTED field. */
#define TWIM_EVENTS_TXSTARTED_EVENTS_TXSTARTED_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define TWIM_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: TWIM_EVENTS_LASTRX */
/* Description: Byte boundary, starting to receive the last byte */

/* Bit 0 : Byte boundary, starting to receive the last byte */
#define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Pos             ( 0UL )                                           /*!< Position of EVENTS_LASTRX field. */
#define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Msk             ( 0x1UL << TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Pos ) /*!< Bit mask of EVENTS_LASTRX field. */
#define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_NotGenerated    ( 0UL )                                           /*!< Event not generated */
#define TWIM_EVENTS_LASTRX_EVENTS_LASTRX_Generated       ( 1UL )                                           /*!< Event generated */

/* Register: TWIM_EVENTS_LASTTX */
/* Description: Byte boundary, starting to transmit the last byte */

/* Bit 0 : Byte boundary, starting to transmit the last byte */
#define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Pos             ( 0UL )                                           /*!< Position of EVENTS_LASTTX field. */
#define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Msk             ( 0x1UL << TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Pos ) /*!< Bit mask of EVENTS_LASTTX field. */
#define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_NotGenerated    ( 0UL )                                           /*!< Event not generated */
#define TWIM_EVENTS_LASTTX_EVENTS_LASTTX_Generated       ( 1UL )                                           /*!< Event generated */

/* Register: TWIM_PUBLISH_STOPPED */
/* Description: Publish configuration for event STOPPED */

/* Bit 31 :   */
#define TWIM_PUBLISH_STOPPED_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define TWIM_PUBLISH_STOPPED_EN_Msk         ( 0x1UL << TWIM_PUBLISH_STOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIM_PUBLISH_STOPPED_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define TWIM_PUBLISH_STOPPED_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STOPPED will publish to. */
#define TWIM_PUBLISH_STOPPED_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define TWIM_PUBLISH_STOPPED_CHIDX_Msk      ( 0xFFUL << TWIM_PUBLISH_STOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIM_PUBLISH_ERROR */
/* Description: Publish configuration for event ERROR */

/* Bit 31 :   */
#define TWIM_PUBLISH_ERROR_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define TWIM_PUBLISH_ERROR_EN_Msk         ( 0x1UL << TWIM_PUBLISH_ERROR_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIM_PUBLISH_ERROR_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define TWIM_PUBLISH_ERROR_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ERROR will publish to. */
#define TWIM_PUBLISH_ERROR_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define TWIM_PUBLISH_ERROR_CHIDX_Msk      ( 0xFFUL << TWIM_PUBLISH_ERROR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIM_PUBLISH_SUSPENDED */
/* Description: Publish configuration for event SUSPENDED */

/* Bit 31 :   */
#define TWIM_PUBLISH_SUSPENDED_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define TWIM_PUBLISH_SUSPENDED_EN_Msk         ( 0x1UL << TWIM_PUBLISH_SUSPENDED_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIM_PUBLISH_SUSPENDED_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define TWIM_PUBLISH_SUSPENDED_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event SUSPENDED will publish to. */
#define TWIM_PUBLISH_SUSPENDED_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define TWIM_PUBLISH_SUSPENDED_CHIDX_Msk      ( 0xFFUL << TWIM_PUBLISH_SUSPENDED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIM_PUBLISH_RXSTARTED */
/* Description: Publish configuration for event RXSTARTED */

/* Bit 31 :   */
#define TWIM_PUBLISH_RXSTARTED_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define TWIM_PUBLISH_RXSTARTED_EN_Msk         ( 0x1UL << TWIM_PUBLISH_RXSTARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIM_PUBLISH_RXSTARTED_EN_Disabled    ( 0UL )                                    /*!< Disable publishing */
#define TWIM_PUBLISH_RXSTARTED_EN_Enabled     ( 1UL )                                    /*!< Enable publishing */

