FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: TWIS_SUBSCRIBE_SUSPEND */
/* Description: Subscribe configuration for task SUSPEND */

/* Bit 31 :   */
#define TWIS_SUBSCRIBE_SUSPEND_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define TWIS_SUBSCRIBE_SUSPEND_EN_Msk         ( 0x1UL << TWIS_SUBSCRIBE_SUSPEND_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_SUBSCRIBE_SUSPEND_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define TWIS_SUBSCRIBE_SUSPEND_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task SUSPEND will subscribe to */
#define TWIS_SUBSCRIBE_SUSPEND_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define TWIS_SUBSCRIBE_SUSPEND_CHIDX_Msk      ( 0xFFUL << TWIS_SUBSCRIBE_SUSPEND_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_SUBSCRIBE_RESUME */
/* Description: Subscribe configuration for task RESUME */

/* Bit 31 :   */
#define TWIS_SUBSCRIBE_RESUME_EN_Pos         ( 31UL )                                  /*!< Position of EN field. */
#define TWIS_SUBSCRIBE_RESUME_EN_Msk         ( 0x1UL << TWIS_SUBSCRIBE_RESUME_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_SUBSCRIBE_RESUME_EN_Disabled    ( 0UL )                                   /*!< Disable subscription */
#define TWIS_SUBSCRIBE_RESUME_EN_Enabled     ( 1UL )                                   /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task RESUME will subscribe to */
#define TWIS_SUBSCRIBE_RESUME_CHIDX_Pos      ( 0UL )                                       /*!< Position of CHIDX field. */
#define TWIS_SUBSCRIBE_RESUME_CHIDX_Msk      ( 0xFFUL << TWIS_SUBSCRIBE_RESUME_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_SUBSCRIBE_PREPARERX */
/* Description: Subscribe configuration for task PREPARERX */

/* Bit 31 :   */
#define TWIS_SUBSCRIBE_PREPARERX_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define TWIS_SUBSCRIBE_PREPARERX_EN_Msk         ( 0x1UL << TWIS_SUBSCRIBE_PREPARERX_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_SUBSCRIBE_PREPARERX_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define TWIS_SUBSCRIBE_PREPARERX_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PREPARERX will subscribe to */
#define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define TWIS_SUBSCRIBE_PREPARERX_CHIDX_Msk      ( 0xFFUL << TWIS_SUBSCRIBE_PREPARERX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_SUBSCRIBE_PREPARETX */
/* Description: Subscribe configuration for task PREPARETX */

/* Bit 31 :   */
#define TWIS_SUBSCRIBE_PREPARETX_EN_Pos         ( 31UL )                                     /*!< Position of EN field. */
#define TWIS_SUBSCRIBE_PREPARETX_EN_Msk         ( 0x1UL << TWIS_SUBSCRIBE_PREPARETX_EN_Pos ) /*!< Bit mask of EN field. */
#define TWIS_SUBSCRIBE_PREPARETX_EN_Disabled    ( 0UL )                                      /*!< Disable subscription */
#define TWIS_SUBSCRIBE_PREPARETX_EN_Enabled     ( 1UL )                                      /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PREPARETX will subscribe to */
#define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Pos      ( 0UL )                                          /*!< Position of CHIDX field. */
#define TWIS_SUBSCRIBE_PREPARETX_CHIDX_Msk      ( 0xFFUL << TWIS_SUBSCRIBE_PREPARETX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: TWIS_EVENTS_STOPPED */
/* Description: TWI stopped */

/* Bit 0 : TWI stopped */
#define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                             /*!< Position of EVENTS_STOPPED field. */
#define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                             /*!< Event not generated */
#define TWIS_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                             /*!< Event generated */

/* Register: TWIS_EVENTS_ERROR */
/* Description: TWI error */

/* Bit 0 : TWI error */
#define TWIS_EVENTS_ERROR_EVENTS_ERROR_Pos             ( 0UL )                                         /*!< Position of EVENTS_ERROR field. */
#define TWIS_EVENTS_ERROR_EVENTS_ERROR_Msk             ( 0x1UL << TWIS_EVENTS_ERROR_EVENTS_ERROR_Pos ) /*!< Bit mask of EVENTS_ERROR field. */
#define TWIS_EVENTS_ERROR_EVENTS_ERROR_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define TWIS_EVENTS_ERROR_EVENTS_ERROR_Generated       ( 1UL )                                         /*!< Event generated */

/* Register: TWIS_EVENTS_RXSTARTED */
/* Description: Receive sequence started */

/* Bit 0 : Receive sequence started */
#define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos             ( 0UL )                                                 /*!< Position of EVENTS_RXSTARTED field. */
#define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Msk             ( 0x1UL << TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Pos ) /*!< Bit mask of EVENTS_RXSTARTED field. */
#define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define TWIS_EVENTS_RXSTARTED_EVENTS_RXSTARTED_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: TWIS_EVENTS_TXSTARTED */
/* Description: Transmit sequence started */

/* Bit 0 : Transmit sequence started */
#define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos             ( 0UL )                                                 /*!< Position of EVENTS_TXSTARTED field. */
#define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Msk             ( 0x1UL << TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Pos ) /*!< Bit mask of EVENTS_TXSTARTED field. */
#define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_NotGenerated    ( 0UL )                                                 /*!< Event not generated */
#define TWIS_EVENTS_TXSTARTED_EVENTS_TXSTARTED_Generated       ( 1UL )                                                 /*!< Event generated */

/* Register: TWIS_EVENTS_WRITE */
/* Description: Write command received */

/* Bit 0 : Write command received */
#define TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos             ( 0UL )                                         /*!< Position of EVENTS_WRITE field. */
#define TWIS_EVENTS_WRITE_EVENTS_WRITE_Msk             ( 0x1UL << TWIS_EVENTS_WRITE_EVENTS_WRITE_Pos ) /*!< Bit mask of EVENTS_WRITE field. */
#define TWIS_EVENTS_WRITE_EVENTS_WRITE_NotGenerated    ( 0UL )                                         /*!< Event not generated */
#define TWIS_EVENTS_WRITE_EVENTS_WRITE_Generated       ( 1UL )                                         /*!< Event generated */

