FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 1 : Enable or disable interrupt for event STOPPED */
#define TWIS_INTEN_STOPPED_Pos           ( 1UL )                             /*!< Position of STOPPED field. */
#define TWIS_INTEN_STOPPED_Msk           ( 0x1UL << TWIS_INTEN_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define TWIS_INTEN_STOPPED_Disabled      ( 0UL )                             /*!< Disable */
#define TWIS_INTEN_STOPPED_Enabled       ( 1UL )                             /*!< Enable */

/* Register: TWIS_INTENSET */
/* Description: Enable interrupt */

/* Bit 26 : Write '1' to enable interrupt for event READ */
#define TWIS_INTENSET_READ_Pos              ( 26UL )                            /*!< Position of READ field. */
#define TWIS_INTENSET_READ_Msk              ( 0x1UL << TWIS_INTENSET_READ_Pos ) /*!< Bit mask of READ field. */
#define TWIS_INTENSET_READ_Disabled         ( 0UL )                             /*!< Read: Disabled */
#define TWIS_INTENSET_READ_Enabled          ( 1UL )                             /*!< Read: Enabled */
#define TWIS_INTENSET_READ_Set              ( 1UL )                             /*!< Enable */

/* Bit 25 : Write '1' to enable interrupt for event WRITE */
#define TWIS_INTENSET_WRITE_Pos             ( 25UL )                             /*!< Position of WRITE field. */
#define TWIS_INTENSET_WRITE_Msk             ( 0x1UL << TWIS_INTENSET_WRITE_Pos ) /*!< Bit mask of WRITE field. */
#define TWIS_INTENSET_WRITE_Disabled        ( 0UL )                              /*!< Read: Disabled */
#define TWIS_INTENSET_WRITE_Enabled         ( 1UL )                              /*!< Read: Enabled */
#define TWIS_INTENSET_WRITE_Set             ( 1UL )                              /*!< Enable */

/* Bit 20 : Write '1' to enable interrupt for event TXSTARTED */
#define TWIS_INTENSET_TXSTARTED_Pos         ( 20UL )                                 /*!< Position of TXSTARTED field. */
#define TWIS_INTENSET_TXSTARTED_Msk         ( 0x1UL << TWIS_INTENSET_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define TWIS_INTENSET_TXSTARTED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIS_INTENSET_TXSTARTED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIS_INTENSET_TXSTARTED_Set         ( 1UL )                                  /*!< Enable */

/* Bit 19 : Write '1' to enable interrupt for event RXSTARTED */
#define TWIS_INTENSET_RXSTARTED_Pos         ( 19UL )                                 /*!< Position of RXSTARTED field. */
#define TWIS_INTENSET_RXSTARTED_Msk         ( 0x1UL << TWIS_INTENSET_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define TWIS_INTENSET_RXSTARTED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIS_INTENSET_RXSTARTED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIS_INTENSET_RXSTARTED_Set         ( 1UL )                                  /*!< Enable */

/* Bit 9 : Write '1' to enable interrupt for event ERROR */
#define TWIS_INTENSET_ERROR_Pos             ( 9UL )                              /*!< Position of ERROR field. */
#define TWIS_INTENSET_ERROR_Msk             ( 0x1UL << TWIS_INTENSET_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWIS_INTENSET_ERROR_Disabled        ( 0UL )                              /*!< Read: Disabled */
#define TWIS_INTENSET_ERROR_Enabled         ( 1UL )                              /*!< Read: Enabled */
#define TWIS_INTENSET_ERROR_Set             ( 1UL )                              /*!< Enable */

/* Bit 1 : Write '1' to enable interrupt for event STOPPED */
#define TWIS_INTENSET_STOPPED_Pos           ( 1UL )                                /*!< Position of STOPPED field. */
#define TWIS_INTENSET_STOPPED_Msk           ( 0x1UL << TWIS_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define TWIS_INTENSET_STOPPED_Disabled      ( 0UL )                                /*!< Read: Disabled */
#define TWIS_INTENSET_STOPPED_Enabled       ( 1UL )                                /*!< Read: Enabled */
#define TWIS_INTENSET_STOPPED_Set           ( 1UL )                                /*!< Enable */

/* Register: TWIS_INTENCLR */
/* Description: Disable interrupt */

/* Bit 26 : Write '1' to disable interrupt for event READ */
#define TWIS_INTENCLR_READ_Pos              ( 26UL )                            /*!< Position of READ field. */
#define TWIS_INTENCLR_READ_Msk              ( 0x1UL << TWIS_INTENCLR_READ_Pos ) /*!< Bit mask of READ field. */
#define TWIS_INTENCLR_READ_Disabled         ( 0UL )                             /*!< Read: Disabled */
#define TWIS_INTENCLR_READ_Enabled          ( 1UL )                             /*!< Read: Enabled */
#define TWIS_INTENCLR_READ_Clear            ( 1UL )                             /*!< Disable */

/* Bit 25 : Write '1' to disable interrupt for event WRITE */
#define TWIS_INTENCLR_WRITE_Pos             ( 25UL )                             /*!< Position of WRITE field. */
#define TWIS_INTENCLR_WRITE_Msk             ( 0x1UL << TWIS_INTENCLR_WRITE_Pos ) /*!< Bit mask of WRITE field. */
#define TWIS_INTENCLR_WRITE_Disabled        ( 0UL )                              /*!< Read: Disabled */
#define TWIS_INTENCLR_WRITE_Enabled         ( 1UL )                              /*!< Read: Enabled */
#define TWIS_INTENCLR_WRITE_Clear           ( 1UL )                              /*!< Disable */

/* Bit 20 : Write '1' to disable interrupt for event TXSTARTED */
#define TWIS_INTENCLR_TXSTARTED_Pos         ( 20UL )                                 /*!< Position of TXSTARTED field. */
#define TWIS_INTENCLR_TXSTARTED_Msk         ( 0x1UL << TWIS_INTENCLR_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define TWIS_INTENCLR_TXSTARTED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIS_INTENCLR_TXSTARTED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIS_INTENCLR_TXSTARTED_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 19 : Write '1' to disable interrupt for event RXSTARTED */
#define TWIS_INTENCLR_RXSTARTED_Pos         ( 19UL )                                 /*!< Position of RXSTARTED field. */
#define TWIS_INTENCLR_RXSTARTED_Msk         ( 0x1UL << TWIS_INTENCLR_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define TWIS_INTENCLR_RXSTARTED_Disabled    ( 0UL )                                  /*!< Read: Disabled */
#define TWIS_INTENCLR_RXSTARTED_Enabled     ( 1UL )                                  /*!< Read: Enabled */
#define TWIS_INTENCLR_RXSTARTED_Clear       ( 1UL )                                  /*!< Disable */

/* Bit 9 : Write '1' to disable interrupt for event ERROR */
#define TWIS_INTENCLR_ERROR_Pos             ( 9UL )                              /*!< Position of ERROR field. */
#define TWIS_INTENCLR_ERROR_Msk             ( 0x1UL << TWIS_INTENCLR_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define TWIS_INTENCLR_ERROR_Disabled        ( 0UL )                              /*!< Read: Disabled */
#define TWIS_INTENCLR_ERROR_Enabled         ( 1UL )                              /*!< Read: Enabled */
#define TWIS_INTENCLR_ERROR_Clear           ( 1UL )                              /*!< Disable */

