FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 31..0 : TXD Data pointer */
#define TWIS_TXD_PTR_PTR_Pos    ( 0UL )                                  /*!< Position of PTR field. */
#define TWIS_TXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << TWIS_TXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: TWIS_TXD_MAXCNT */
/* Description: Maximum number of bytes in TXD buffer */

/* Bits 15..0 : Maximum number of bytes in TXD buffer */
#define TWIS_TXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                    /*!< Position of MAXCNT field. */
#define TWIS_TXD_MAXCNT_MAXCNT_Msk    ( 0xFFFFUL << TWIS_TXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: TWIS_TXD_AMOUNT */
/* Description: Number of bytes transferred in the last TXD transaction */

/* Bits 15..0 : Number of bytes transferred in the last TXD transaction */
#define TWIS_TXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                    /*!< Position of AMOUNT field. */
#define TWIS_TXD_AMOUNT_AMOUNT_Msk    ( 0xFFFFUL << TWIS_TXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: TWIS_TXD_LIST */
/* Description: EasyDMA list type */

/* Bits 1..0 : List type */
#define TWIS_TXD_LIST_LIST_Pos          ( 0UL )                             /*!< Position of LIST field. */
#define TWIS_TXD_LIST_LIST_Msk          ( 0x3UL << TWIS_TXD_LIST_LIST_Pos ) /*!< Bit mask of LIST field. */
#define TWIS_TXD_LIST_LIST_Disabled     ( 0UL )                             /*!< Disable EasyDMA list */
#define TWIS_TXD_LIST_LIST_ArrayList    ( 1UL )                             /*!< Use array list */

/* Register: TWIS_ADDRESS */
/* Description: Description collection: TWI slave address n */

/* Bits 6..0 : TWI slave address */
#define TWIS_ADDRESS_ADDRESS_Pos    ( 0UL )                                /*!< Position of ADDRESS field. */
#define TWIS_ADDRESS_ADDRESS_Msk    ( 0x7FUL << TWIS_ADDRESS_ADDRESS_Pos ) /*!< Bit mask of ADDRESS field. */

/* Register: TWIS_CONFIG */
/* Description: Configuration register for the address match mechanism */

/* Bit 1 : Enable or disable address matching on ADDRESS[1] */
#define TWIS_CONFIG_ADDRESS1_Pos         ( 1UL )                               /*!< Position of ADDRESS1 field. */
#define TWIS_CONFIG_ADDRESS1_Msk         ( 0x1UL << TWIS_CONFIG_ADDRESS1_Pos ) /*!< Bit mask of ADDRESS1 field. */
#define TWIS_CONFIG_ADDRESS1_Disabled    ( 0UL )                               /*!< Disabled */
#define TWIS_CONFIG_ADDRESS1_Enabled     ( 1UL )                               /*!< Enabled */

/* Bit 0 : Enable or disable address matching on ADDRESS[0] */
#define TWIS_CONFIG_ADDRESS0_Pos         ( 0UL )                               /*!< Position of ADDRESS0 field. */
#define TWIS_CONFIG_ADDRESS0_Msk         ( 0x1UL << TWIS_CONFIG_ADDRESS0_Pos ) /*!< Bit mask of ADDRESS0 field. */
#define TWIS_CONFIG_ADDRESS0_Disabled    ( 0UL )                               /*!< Disabled */
#define TWIS_CONFIG_ADDRESS0_Enabled     ( 1UL )                               /*!< Enabled */

/* Register: TWIS_ORC */
/* Description: Over-read character. Character sent out in case of an over-read of the transmit buffer. */

/* Bits 7..0 : Over-read character. Character sent out in case of an over-read of the transmit buffer. */
#define TWIS_ORC_ORC_Pos    ( 0UL )                        /*!< Position of ORC field. */
#define TWIS_ORC_ORC_Msk    ( 0xFFUL << TWIS_ORC_ORC_Pos ) /*!< Bit mask of ORC field. */


/* Peripheral: UARTE */
/* Description: UART with EasyDMA */

/* Register: UARTE_TASKS_STARTRX */
/* Description: Start UART receiver */

/* Bit 0 : Start UART receiver */
#define UARTE_TASKS_STARTRX_TASKS_STARTRX_Pos        ( 0UL )                                            /*!< Position of TASKS_STARTRX field. */
#define UARTE_TASKS_STARTRX_TASKS_STARTRX_Msk        ( 0x1UL << UARTE_TASKS_STARTRX_TASKS_STARTRX_Pos ) /*!< Bit mask of TASKS_STARTRX field. */
#define UARTE_TASKS_STARTRX_TASKS_STARTRX_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: UARTE_TASKS_STOPRX */
/* Description: Stop UART receiver */

/* Bit 0 : Stop UART receiver */
#define UARTE_TASKS_STOPRX_TASKS_STOPRX_Pos        ( 0UL )                                          /*!< Position of TASKS_STOPRX field. */
#define UARTE_TASKS_STOPRX_TASKS_STOPRX_Msk        ( 0x1UL << UARTE_TASKS_STOPRX_TASKS_STOPRX_Pos ) /*!< Bit mask of TASKS_STOPRX field. */
#define UARTE_TASKS_STOPRX_TASKS_STOPRX_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: UARTE_TASKS_STARTTX */
/* Description: Start UART transmitter */

/* Bit 0 : Start UART transmitter */
#define UARTE_TASKS_STARTTX_TASKS_STARTTX_Pos        ( 0UL )                                            /*!< Position of TASKS_STARTTX field. */
#define UARTE_TASKS_STARTTX_TASKS_STARTTX_Msk        ( 0x1UL << UARTE_TASKS_STARTTX_TASKS_STARTTX_Pos ) /*!< Bit mask of TASKS_STARTTX field. */
#define UARTE_TASKS_STARTTX_TASKS_STARTTX_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: UARTE_TASKS_STOPTX */
/* Description: Stop UART transmitter */

/* Bit 0 : Stop UART transmitter */
#define UARTE_TASKS_STOPTX_TASKS_STOPTX_Pos        ( 0UL )                                          /*!< Position of TASKS_STOPTX field. */
#define UARTE_TASKS_STOPTX_TASKS_STOPTX_Msk        ( 0x1UL << UARTE_TASKS_STOPTX_TASKS_STOPTX_Pos ) /*!< Bit mask of TASKS_STOPTX field. */
#define UARTE_TASKS_STOPTX_TASKS_STOPTX_Trigger    ( 1UL )                                          /*!< Trigger task */

/* Register: UARTE_TASKS_FLUSHRX */
/* Description: Flush RX FIFO into RX buffer */

/* Bit 0 : Flush RX FIFO into RX buffer */
#define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos        ( 0UL )                                            /*!< Position of TASKS_FLUSHRX field. */
#define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Msk        ( 0x1UL << UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos ) /*!< Bit mask of TASKS_FLUSHRX field. */
#define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Trigger    ( 1UL )                                            /*!< Trigger task */

/* Register: UARTE_SUBSCRIBE_STARTRX */
/* Description: Subscribe configuration for task STARTRX */

/* Bit 31 :   */
#define UARTE_SUBSCRIBE_STARTRX_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define UARTE_SUBSCRIBE_STARTRX_EN_Msk         ( 0x1UL << UARTE_SUBSCRIBE_STARTRX_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_SUBSCRIBE_STARTRX_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define UARTE_SUBSCRIBE_STARTRX_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

