FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 7..0 : DPPI channel that task STARTRX will subscribe to */
#define UARTE_SUBSCRIBE_STARTRX_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define UARTE_SUBSCRIBE_STARTRX_CHIDX_Msk      ( 0xFFUL << UARTE_SUBSCRIBE_STARTRX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_SUBSCRIBE_STOPRX */
/* Description: Subscribe configuration for task STOPRX */

/* Bit 31 :   */
#define UARTE_SUBSCRIBE_STOPRX_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define UARTE_SUBSCRIBE_STOPRX_EN_Msk         ( 0x1UL << UARTE_SUBSCRIBE_STOPRX_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_SUBSCRIBE_STOPRX_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define UARTE_SUBSCRIBE_STOPRX_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOPRX will subscribe to */
#define UARTE_SUBSCRIBE_STOPRX_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define UARTE_SUBSCRIBE_STOPRX_CHIDX_Msk      ( 0xFFUL << UARTE_SUBSCRIBE_STOPRX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_SUBSCRIBE_STARTTX */
/* Description: Subscribe configuration for task STARTTX */

/* Bit 31 :   */
#define UARTE_SUBSCRIBE_STARTTX_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define UARTE_SUBSCRIBE_STARTTX_EN_Msk         ( 0x1UL << UARTE_SUBSCRIBE_STARTTX_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_SUBSCRIBE_STARTTX_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define UARTE_SUBSCRIBE_STARTTX_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STARTTX will subscribe to */
#define UARTE_SUBSCRIBE_STARTTX_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define UARTE_SUBSCRIBE_STARTTX_CHIDX_Msk      ( 0xFFUL << UARTE_SUBSCRIBE_STARTTX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_SUBSCRIBE_STOPTX */
/* Description: Subscribe configuration for task STOPTX */

/* Bit 31 :   */
#define UARTE_SUBSCRIBE_STOPTX_EN_Pos         ( 31UL )                                   /*!< Position of EN field. */
#define UARTE_SUBSCRIBE_STOPTX_EN_Msk         ( 0x1UL << UARTE_SUBSCRIBE_STOPTX_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_SUBSCRIBE_STOPTX_EN_Disabled    ( 0UL )                                    /*!< Disable subscription */
#define UARTE_SUBSCRIBE_STOPTX_EN_Enabled     ( 1UL )                                    /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOPTX will subscribe to */
#define UARTE_SUBSCRIBE_STOPTX_CHIDX_Pos      ( 0UL )                                        /*!< Position of CHIDX field. */
#define UARTE_SUBSCRIBE_STOPTX_CHIDX_Msk      ( 0xFFUL << UARTE_SUBSCRIBE_STOPTX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_SUBSCRIBE_FLUSHRX */
/* Description: Subscribe configuration for task FLUSHRX */

/* Bit 31 :   */
#define UARTE_SUBSCRIBE_FLUSHRX_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define UARTE_SUBSCRIBE_FLUSHRX_EN_Msk         ( 0x1UL << UARTE_SUBSCRIBE_FLUSHRX_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_SUBSCRIBE_FLUSHRX_EN_Disabled    ( 0UL )                                     /*!< Disable subscription */
#define UARTE_SUBSCRIBE_FLUSHRX_EN_Enabled     ( 1UL )                                     /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task FLUSHRX will subscribe to */
#define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Msk      ( 0xFFUL << UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_EVENTS_CTS */
/* Description: CTS is activated (set low). Clear To Send. */

/* Bit 0 : CTS is activated (set low). Clear To Send. */
#define UARTE_EVENTS_CTS_EVENTS_CTS_Pos             ( 0UL )                                      /*!< Position of EVENTS_CTS field. */
#define UARTE_EVENTS_CTS_EVENTS_CTS_Msk             ( 0x1UL << UARTE_EVENTS_CTS_EVENTS_CTS_Pos ) /*!< Bit mask of EVENTS_CTS field. */
#define UARTE_EVENTS_CTS_EVENTS_CTS_NotGenerated    ( 0UL )                                      /*!< Event not generated */
#define UARTE_EVENTS_CTS_EVENTS_CTS_Generated       ( 1UL )                                      /*!< Event generated */

/* Register: UARTE_EVENTS_NCTS */
/* Description: CTS is deactivated (set high). Not Clear To Send. */

/* Bit 0 : CTS is deactivated (set high). Not Clear To Send. */
#define UARTE_EVENTS_NCTS_EVENTS_NCTS_Pos             ( 0UL )                                        /*!< Position of EVENTS_NCTS field. */
#define UARTE_EVENTS_NCTS_EVENTS_NCTS_Msk             ( 0x1UL << UARTE_EVENTS_NCTS_EVENTS_NCTS_Pos ) /*!< Bit mask of EVENTS_NCTS field. */
#define UARTE_EVENTS_NCTS_EVENTS_NCTS_NotGenerated    ( 0UL )                                        /*!< Event not generated */
#define UARTE_EVENTS_NCTS_EVENTS_NCTS_Generated       ( 1UL )                                        /*!< Event generated */

/* Register: UARTE_EVENTS_RXDRDY */
/* Description: Data received in RXD (but potentially not yet transferred to Data RAM) */

/* Bit 0 : Data received in RXD (but potentially not yet transferred to Data RAM) */
#define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Pos             ( 0UL )                                            /*!< Position of EVENTS_RXDRDY field. */
#define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Msk             ( 0x1UL << UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Pos ) /*!< Bit mask of EVENTS_RXDRDY field. */
#define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Generated       ( 1UL )                                            /*!< Event generated */

