FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: UARTE_PUBLISH_RXDRDY */
/* Description: Publish configuration for event RXDRDY */

/* Bit 31 :   */
#define UARTE_PUBLISH_RXDRDY_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define UARTE_PUBLISH_RXDRDY_EN_Msk         ( 0x1UL << UARTE_PUBLISH_RXDRDY_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_RXDRDY_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define UARTE_PUBLISH_RXDRDY_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RXDRDY will publish to. */
#define UARTE_PUBLISH_RXDRDY_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_RXDRDY_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_RXDRDY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_PUBLISH_ENDRX */
/* Description: Publish configuration for event ENDRX */

/* Bit 31 :   */
#define UARTE_PUBLISH_ENDRX_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define UARTE_PUBLISH_ENDRX_EN_Msk         ( 0x1UL << UARTE_PUBLISH_ENDRX_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_ENDRX_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define UARTE_PUBLISH_ENDRX_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDRX will publish to. */
#define UARTE_PUBLISH_ENDRX_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_ENDRX_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_ENDRX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_PUBLISH_TXDRDY */
/* Description: Publish configuration for event TXDRDY */

/* Bit 31 :   */
#define UARTE_PUBLISH_TXDRDY_EN_Pos         ( 31UL )                                 /*!< Position of EN field. */
#define UARTE_PUBLISH_TXDRDY_EN_Msk         ( 0x1UL << UARTE_PUBLISH_TXDRDY_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_TXDRDY_EN_Disabled    ( 0UL )                                  /*!< Disable publishing */
#define UARTE_PUBLISH_TXDRDY_EN_Enabled     ( 1UL )                                  /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TXDRDY will publish to. */
#define UARTE_PUBLISH_TXDRDY_CHIDX_Pos      ( 0UL )                                      /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_TXDRDY_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_TXDRDY_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_PUBLISH_ENDTX */
/* Description: Publish configuration for event ENDTX */

/* Bit 31 :   */
#define UARTE_PUBLISH_ENDTX_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define UARTE_PUBLISH_ENDTX_EN_Msk         ( 0x1UL << UARTE_PUBLISH_ENDTX_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_ENDTX_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define UARTE_PUBLISH_ENDTX_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ENDTX will publish to. */
#define UARTE_PUBLISH_ENDTX_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_ENDTX_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_ENDTX_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_PUBLISH_ERROR */
/* Description: Publish configuration for event ERROR */

/* Bit 31 :   */
#define UARTE_PUBLISH_ERROR_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define UARTE_PUBLISH_ERROR_EN_Msk         ( 0x1UL << UARTE_PUBLISH_ERROR_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_ERROR_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define UARTE_PUBLISH_ERROR_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ERROR will publish to. */
#define UARTE_PUBLISH_ERROR_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_ERROR_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_ERROR_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_PUBLISH_RXTO */
/* Description: Publish configuration for event RXTO */

/* Bit 31 :   */
#define UARTE_PUBLISH_RXTO_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define UARTE_PUBLISH_RXTO_EN_Msk         ( 0x1UL << UARTE_PUBLISH_RXTO_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_RXTO_EN_Disabled    ( 0UL )                                /*!< Disable publishing */
#define UARTE_PUBLISH_RXTO_EN_Enabled     ( 1UL )                                /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RXTO will publish to. */
#define UARTE_PUBLISH_RXTO_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_RXTO_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_RXTO_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_PUBLISH_RXSTARTED */
/* Description: Publish configuration for event RXSTARTED */

/* Bit 31 :   */
#define UARTE_PUBLISH_RXSTARTED_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define UARTE_PUBLISH_RXSTARTED_EN_Msk         ( 0x1UL << UARTE_PUBLISH_RXSTARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_RXSTARTED_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define UARTE_PUBLISH_RXSTARTED_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event RXSTARTED will publish to. */
#define UARTE_PUBLISH_RXSTARTED_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_RXSTARTED_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_RXSTARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

