FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: UARTE_PUBLISH_TXSTARTED */
/* Description: Publish configuration for event TXSTARTED */

/* Bit 31 :   */
#define UARTE_PUBLISH_TXSTARTED_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define UARTE_PUBLISH_TXSTARTED_EN_Msk         ( 0x1UL << UARTE_PUBLISH_TXSTARTED_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_TXSTARTED_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define UARTE_PUBLISH_TXSTARTED_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TXSTARTED will publish to. */
#define UARTE_PUBLISH_TXSTARTED_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_TXSTARTED_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_TXSTARTED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_PUBLISH_TXSTOPPED */
/* Description: Publish configuration for event TXSTOPPED */

/* Bit 31 :   */
#define UARTE_PUBLISH_TXSTOPPED_EN_Pos         ( 31UL )                                    /*!< Position of EN field. */
#define UARTE_PUBLISH_TXSTOPPED_EN_Msk         ( 0x1UL << UARTE_PUBLISH_TXSTOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define UARTE_PUBLISH_TXSTOPPED_EN_Disabled    ( 0UL )                                     /*!< Disable publishing */
#define UARTE_PUBLISH_TXSTOPPED_EN_Enabled     ( 1UL )                                     /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TXSTOPPED will publish to. */
#define UARTE_PUBLISH_TXSTOPPED_CHIDX_Pos      ( 0UL )                                         /*!< Position of CHIDX field. */
#define UARTE_PUBLISH_TXSTOPPED_CHIDX_Msk      ( 0xFFUL << UARTE_PUBLISH_TXSTOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: UARTE_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 6 : Shortcut between event ENDRX and task STOPRX */
#define UARTE_SHORTS_ENDRX_STOPRX_Pos          ( 6UL )                                    /*!< Position of ENDRX_STOPRX field. */
#define UARTE_SHORTS_ENDRX_STOPRX_Msk          ( 0x1UL << UARTE_SHORTS_ENDRX_STOPRX_Pos ) /*!< Bit mask of ENDRX_STOPRX field. */
#define UARTE_SHORTS_ENDRX_STOPRX_Disabled     ( 0UL )                                    /*!< Disable shortcut */
#define UARTE_SHORTS_ENDRX_STOPRX_Enabled      ( 1UL )                                    /*!< Enable shortcut */

/* Bit 5 : Shortcut between event ENDRX and task STARTRX */
#define UARTE_SHORTS_ENDRX_STARTRX_Pos         ( 5UL )                                     /*!< Position of ENDRX_STARTRX field. */
#define UARTE_SHORTS_ENDRX_STARTRX_Msk         ( 0x1UL << UARTE_SHORTS_ENDRX_STARTRX_Pos ) /*!< Bit mask of ENDRX_STARTRX field. */
#define UARTE_SHORTS_ENDRX_STARTRX_Disabled    ( 0UL )                                     /*!< Disable shortcut */
#define UARTE_SHORTS_ENDRX_STARTRX_Enabled     ( 1UL )                                     /*!< Enable shortcut */

/* Register: UARTE_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 22 : Enable or disable interrupt for event TXSTOPPED */
#define UARTE_INTEN_TXSTOPPED_Pos         ( 22UL )                               /*!< Position of TXSTOPPED field. */
#define UARTE_INTEN_TXSTOPPED_Msk         ( 0x1UL << UARTE_INTEN_TXSTOPPED_Pos ) /*!< Bit mask of TXSTOPPED field. */
#define UARTE_INTEN_TXSTOPPED_Disabled    ( 0UL )                                /*!< Disable */
#define UARTE_INTEN_TXSTOPPED_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 20 : Enable or disable interrupt for event TXSTARTED */
#define UARTE_INTEN_TXSTARTED_Pos         ( 20UL )                               /*!< Position of TXSTARTED field. */
#define UARTE_INTEN_TXSTARTED_Msk         ( 0x1UL << UARTE_INTEN_TXSTARTED_Pos ) /*!< Bit mask of TXSTARTED field. */
#define UARTE_INTEN_TXSTARTED_Disabled    ( 0UL )                                /*!< Disable */
#define UARTE_INTEN_TXSTARTED_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 19 : Enable or disable interrupt for event RXSTARTED */
#define UARTE_INTEN_RXSTARTED_Pos         ( 19UL )                               /*!< Position of RXSTARTED field. */
#define UARTE_INTEN_RXSTARTED_Msk         ( 0x1UL << UARTE_INTEN_RXSTARTED_Pos ) /*!< Bit mask of RXSTARTED field. */
#define UARTE_INTEN_RXSTARTED_Disabled    ( 0UL )                                /*!< Disable */
#define UARTE_INTEN_RXSTARTED_Enabled     ( 1UL )                                /*!< Enable */

/* Bit 17 : Enable or disable interrupt for event RXTO */
#define UARTE_INTEN_RXTO_Pos              ( 17UL )                          /*!< Position of RXTO field. */
#define UARTE_INTEN_RXTO_Msk              ( 0x1UL << UARTE_INTEN_RXTO_Pos ) /*!< Bit mask of RXTO field. */
#define UARTE_INTEN_RXTO_Disabled         ( 0UL )                           /*!< Disable */
#define UARTE_INTEN_RXTO_Enabled          ( 1UL )                           /*!< Enable */

/* Bit 9 : Enable or disable interrupt for event ERROR */
#define UARTE_INTEN_ERROR_Pos             ( 9UL )                            /*!< Position of ERROR field. */
#define UARTE_INTEN_ERROR_Msk             ( 0x1UL << UARTE_INTEN_ERROR_Pos ) /*!< Bit mask of ERROR field. */
#define UARTE_INTEN_ERROR_Disabled        ( 0UL )                            /*!< Disable */
#define UARTE_INTEN_ERROR_Enabled         ( 1UL )                            /*!< Enable */

/* Bit 8 : Enable or disable interrupt for event ENDTX */
#define UARTE_INTEN_ENDTX_Pos             ( 8UL )                            /*!< Position of ENDTX field. */
#define UARTE_INTEN_ENDTX_Msk             ( 0x1UL << UARTE_INTEN_ENDTX_Pos ) /*!< Bit mask of ENDTX field. */
#define UARTE_INTEN_ENDTX_Disabled        ( 0UL )                            /*!< Disable */
#define UARTE_INTEN_ENDTX_Enabled         ( 1UL )                            /*!< Enable */

/* Bit 7 : Enable or disable interrupt for event TXDRDY */
#define UARTE_INTEN_TXDRDY_Pos            ( 7UL )                             /*!< Position of TXDRDY field. */
#define UARTE_INTEN_TXDRDY_Msk            ( 0x1UL << UARTE_INTEN_TXDRDY_Pos ) /*!< Bit mask of TXDRDY field. */
#define UARTE_INTEN_TXDRDY_Disabled       ( 0UL )                             /*!< Disable */
#define UARTE_INTEN_TXDRDY_Enabled        ( 1UL )                             /*!< Enable */

/* Bit 4 : Enable or disable interrupt for event ENDRX */
#define UARTE_INTEN_ENDRX_Pos             ( 4UL )                            /*!< Position of ENDRX field. */
#define UARTE_INTEN_ENDRX_Msk             ( 0x1UL << UARTE_INTEN_ENDRX_Pos ) /*!< Bit mask of ENDRX field. */
#define UARTE_INTEN_ENDRX_Disabled        ( 0UL )                            /*!< Disable */
#define UARTE_INTEN_ENDRX_Enabled         ( 1UL )                            /*!< Enable */

/* Bit 2 : Enable or disable interrupt for event RXDRDY */
#define UARTE_INTEN_RXDRDY_Pos            ( 2UL )                             /*!< Position of RXDRDY field. */
#define UARTE_INTEN_RXDRDY_Msk            ( 0x1UL << UARTE_INTEN_RXDRDY_Pos ) /*!< Bit mask of RXDRDY field. */
#define UARTE_INTEN_RXDRDY_Disabled       ( 0UL )                             /*!< Disable */
#define UARTE_INTEN_RXDRDY_Enabled        ( 1UL )                             /*!< Enable */

/* Bit 1 : Enable or disable interrupt for event NCTS */
#define UARTE_INTEN_NCTS_Pos              ( 1UL )                           /*!< Position of NCTS field. */
#define UARTE_INTEN_NCTS_Msk              ( 0x1UL << UARTE_INTEN_NCTS_Pos ) /*!< Bit mask of NCTS field. */
#define UARTE_INTEN_NCTS_Disabled         ( 0UL )                           /*!< Disable */
#define UARTE_INTEN_NCTS_Enabled          ( 1UL )                           /*!< Enable */

/* Bit 0 : Enable or disable interrupt for event CTS */
#define UARTE_INTEN_CTS_Pos               ( 0UL )                          /*!< Position of CTS field. */
#define UARTE_INTEN_CTS_Msk               ( 0x1UL << UARTE_INTEN_CTS_Pos ) /*!< Bit mask of CTS field. */
#define UARTE_INTEN_CTS_Disabled          ( 0UL )                          /*!< Disable */
#define UARTE_INTEN_CTS_Enabled           ( 1UL )                          /*!< Enable */

/* Register: UARTE_INTENSET */
/* Description: Enable interrupt */

/* Bit 22 : Write '1' to enable interrupt for event TXSTOPPED */
#define UARTE_INTENSET_TXSTOPPED_Pos         ( 22UL )                                  /*!< Position of TXSTOPPED field. */
#define UARTE_INTENSET_TXSTOPPED_Msk         ( 0x1UL << UARTE_INTENSET_TXSTOPPED_Pos ) /*!< Bit mask of TXSTOPPED field. */
#define UARTE_INTENSET_TXSTOPPED_Disabled    ( 0UL )                                   /*!< Read: Disabled */
#define UARTE_INTENSET_TXSTOPPED_Enabled     ( 1UL )                                   /*!< Read: Enabled */
#define UARTE_INTENSET_TXSTOPPED_Set         ( 1UL )                                   /*!< Enable */

