FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bits 31..0 : Data pointer */
#define UARTE_RXD_PTR_PTR_Pos    ( 0UL )                                   /*!< Position of PTR field. */
#define UARTE_RXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << UARTE_RXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: UARTE_RXD_MAXCNT */
/* Description: Maximum number of bytes in receive buffer */

/* Bits 15..0 : Maximum number of bytes in receive buffer */
#define UARTE_RXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                     /*!< Position of MAXCNT field. */
#define UARTE_RXD_MAXCNT_MAXCNT_Msk    ( 0xFFFFUL << UARTE_RXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_RXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 15..0 : Number of bytes transferred in the last transaction */
#define UARTE_RXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                     /*!< Position of AMOUNT field. */
#define UARTE_RXD_AMOUNT_AMOUNT_Msk    ( 0xFFFFUL << UARTE_RXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_TXD_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define UARTE_TXD_PTR_PTR_Pos    ( 0UL )                                   /*!< Position of PTR field. */
#define UARTE_TXD_PTR_PTR_Msk    ( 0xFFFFFFFFUL << UARTE_TXD_PTR_PTR_Pos ) /*!< Bit mask of PTR field. */

/* Register: UARTE_TXD_MAXCNT */
/* Description: Maximum number of bytes in transmit buffer */

/* Bits 15..0 : Maximum number of bytes in transmit buffer */
#define UARTE_TXD_MAXCNT_MAXCNT_Pos    ( 0UL )                                     /*!< Position of MAXCNT field. */
#define UARTE_TXD_MAXCNT_MAXCNT_Msk    ( 0xFFFFUL << UARTE_TXD_MAXCNT_MAXCNT_Pos ) /*!< Bit mask of MAXCNT field. */

/* Register: UARTE_TXD_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 15..0 : Number of bytes transferred in the last transaction */
#define UARTE_TXD_AMOUNT_AMOUNT_Pos    ( 0UL )                                     /*!< Position of AMOUNT field. */
#define UARTE_TXD_AMOUNT_AMOUNT_Msk    ( 0xFFFFUL << UARTE_TXD_AMOUNT_AMOUNT_Pos ) /*!< Bit mask of AMOUNT field. */

/* Register: UARTE_CONFIG */
/* Description: Configuration of parity and hardware flow control */

/* Bit 8 : Even or odd parity type */
#define UARTE_CONFIG_PARITYTYPE_Pos     ( 8UL )                                  /*!< Position of PARITYTYPE field. */
#define UARTE_CONFIG_PARITYTYPE_Msk     ( 0x1UL << UARTE_CONFIG_PARITYTYPE_Pos ) /*!< Bit mask of PARITYTYPE field. */
#define UARTE_CONFIG_PARITYTYPE_Even    ( 0UL )                                  /*!< Even parity */
#define UARTE_CONFIG_PARITYTYPE_Odd     ( 1UL )                                  /*!< Odd parity */

/* Bit 4 : Stop bits */
#define UARTE_CONFIG_STOP_Pos           ( 4UL )                            /*!< Position of STOP field. */
#define UARTE_CONFIG_STOP_Msk           ( 0x1UL << UARTE_CONFIG_STOP_Pos ) /*!< Bit mask of STOP field. */
#define UARTE_CONFIG_STOP_One           ( 0UL )                            /*!< One stop bit */
#define UARTE_CONFIG_STOP_Two           ( 1UL )                            /*!< Two stop bits */

/* Bits 3..1 : Parity */
#define UARTE_CONFIG_PARITY_Pos         ( 1UL )                              /*!< Position of PARITY field. */
#define UARTE_CONFIG_PARITY_Msk         ( 0x7UL << UARTE_CONFIG_PARITY_Pos ) /*!< Bit mask of PARITY field. */
#define UARTE_CONFIG_PARITY_Excluded    ( 0x0UL )                            /*!< Exclude parity bit */
#define UARTE_CONFIG_PARITY_Included    ( 0x7UL )                            /*!< Include even parity bit */

/* Bit 0 : Hardware flow control */
#define UARTE_CONFIG_HWFC_Pos           ( 0UL )                            /*!< Position of HWFC field. */
#define UARTE_CONFIG_HWFC_Msk           ( 0x1UL << UARTE_CONFIG_HWFC_Pos ) /*!< Bit mask of HWFC field. */
#define UARTE_CONFIG_HWFC_Disabled      ( 0UL )                            /*!< Disabled */
#define UARTE_CONFIG_HWFC_Enabled       ( 1UL )                            /*!< Enabled */


/* Peripheral: UICR */
/* Description: User Information Configuration Registers */

/* Register: UICR_APPROTECT */
/* Description: Access port protection */

/* Bits 31..0 : Blocks debugger read/write access to all CPU registers and memory mapped
 *      addresses. */
#define UICR_APPROTECT_PALL_Pos            ( 0UL )                                     /*!< Position of PALL field. */
#define UICR_APPROTECT_PALL_Msk            ( 0xFFFFFFFFUL << UICR_APPROTECT_PALL_Pos ) /*!< Bit mask of PALL field. */
#define UICR_APPROTECT_PALL_Protected      ( 0x00000000UL )                            /*!< Protected */
#define UICR_APPROTECT_PALL_Unprotected    ( 0x50FA50FAUL )                            /*!< Unprotected */

/* Register: UICR_ERASEPROTECT */
/* Description: Erase protection */

/* Bits 31..0 : Blocks NVMC ERASEALL and CTRLAP ERASEALL functionality. Using any value except Unprotected will lead to the protection being enabled. */
#define UICR_ERASEPROTECT_PALL_Pos            ( 0UL )                                        /*!< Position of PALL field. */
#define UICR_ERASEPROTECT_PALL_Msk            ( 0xFFFFFFFFUL << UICR_ERASEPROTECT_PALL_Pos ) /*!< Bit mask of PALL field. */
#define UICR_ERASEPROTECT_PALL_Protected      ( 0x00000000UL )                               /*!< Protected */
#define UICR_ERASEPROTECT_PALL_Unprotected    ( 0xFFFFFFFFUL )                               /*!< Unprotected */

/* Register: UICR_NRFFW */
/* Description: Description collection: Reserved for Nordic firmware design */

/* Bits 31..0 : Reserved for Nordic firmware design */
#define UICR_NRFFW_NRFFW_Pos    ( 0UL )                                  /*!< Position of NRFFW field. */
#define UICR_NRFFW_NRFFW_Msk    ( 0xFFFFFFFFUL << UICR_NRFFW_NRFFW_Pos ) /*!< Bit mask of NRFFW field. */

/* Register: UICR_CUSTOMER */
/* Description: Description collection: Reserved for customer */

/* Bits 31..0 : Reserved for customer */
#define UICR_CUSTOMER_CUSTOMER_Pos    ( 0UL )                                        /*!< Position of CUSTOMER field. */
#define UICR_CUSTOMER_CUSTOMER_Msk    ( 0xFFFFFFFFUL << UICR_CUSTOMER_CUSTOMER_Pos ) /*!< Bit mask of CUSTOMER field. */


/* Peripheral: VMC */
/* Description: Volatile Memory controller */

/* Register: VMC_RAM_POWER */
/* Description: Description cluster: RAM[n] power control register */

/* Bit 19 : Keep retention on RAM section S3 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S3RETENTION_Pos    ( 19UL )                                   /*!< Position of S3RETENTION field. */
#define VMC_RAM_POWER_S3RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S3RETENTION_Pos ) /*!< Bit mask of S3RETENTION field. */
#define VMC_RAM_POWER_S3RETENTION_Off    ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S3RETENTION_On     ( 1UL )                                    /*!< On */

/* Bit 18 : Keep retention on RAM section S2 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S2RETENTION_Pos    ( 18UL )                                   /*!< Position of S2RETENTION field. */
#define VMC_RAM_POWER_S2RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S2RETENTION_Pos ) /*!< Bit mask of S2RETENTION field. */
#define VMC_RAM_POWER_S2RETENTION_Off    ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S2RETENTION_On     ( 1UL )                                    /*!< On */

/* Bit 17 : Keep retention on RAM section S1 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S1RETENTION_Pos    ( 17UL )                                   /*!< Position of S1RETENTION field. */
#define VMC_RAM_POWER_S1RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S1RETENTION_Pos ) /*!< Bit mask of S1RETENTION field. */
#define VMC_RAM_POWER_S1RETENTION_Off    ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S1RETENTION_On     ( 1UL )                                    /*!< On */

/* Bit 16 : Keep retention on RAM section S0 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S0RETENTION_Pos    ( 16UL )                                   /*!< Position of S0RETENTION field. */
#define VMC_RAM_POWER_S0RETENTION_Msk    ( 0x1UL << VMC_RAM_POWER_S0RETENTION_Pos ) /*!< Bit mask of S0RETENTION field. */
#define VMC_RAM_POWER_S0RETENTION_Off    ( 0UL )                                    /*!< Off */
#define VMC_RAM_POWER_S0RETENTION_On     ( 1UL )                                    /*!< On */

/* Bit 3 : Keep RAM section S3 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S3POWER_Pos        ( 3UL )                                /*!< Position of S3POWER field. */
#define VMC_RAM_POWER_S3POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S3POWER_Pos ) /*!< Bit mask of S3POWER field. */
#define VMC_RAM_POWER_S3POWER_Off        ( 0UL )                                /*!< Off */
#define VMC_RAM_POWER_S3POWER_On         ( 1UL )                                /*!< On */

