FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 2 : Keep RAM section S2 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S2POWER_Pos        ( 2UL )                                /*!< Position of S2POWER field. */
#define VMC_RAM_POWER_S2POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S2POWER_Pos ) /*!< Bit mask of S2POWER field. */
#define VMC_RAM_POWER_S2POWER_Off        ( 0UL )                                /*!< Off */
#define VMC_RAM_POWER_S2POWER_On         ( 1UL )                                /*!< On */

/* Bit 1 : Keep RAM section S1 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S1POWER_Pos        ( 1UL )                                /*!< Position of S1POWER field. */
#define VMC_RAM_POWER_S1POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S1POWER_Pos ) /*!< Bit mask of S1POWER field. */
#define VMC_RAM_POWER_S1POWER_Off        ( 0UL )                                /*!< Off */
#define VMC_RAM_POWER_S1POWER_On         ( 1UL )                                /*!< On */

/* Bit 0 : Keep RAM section S0 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S0POWER_Pos        ( 0UL )                                /*!< Position of S0POWER field. */
#define VMC_RAM_POWER_S0POWER_Msk        ( 0x1UL << VMC_RAM_POWER_S0POWER_Pos ) /*!< Bit mask of S0POWER field. */
#define VMC_RAM_POWER_S0POWER_Off        ( 0UL )                                /*!< Off */
#define VMC_RAM_POWER_S0POWER_On         ( 1UL )                                /*!< On */

/* Register: VMC_RAM_POWERSET */
/* Description: Description cluster: RAM[n] power control set register */

/* Bit 19 : Keep retention on RAM section S3 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERSET_S3RETENTION_Pos    ( 19UL )                                      /*!< Position of S3RETENTION field. */
#define VMC_RAM_POWERSET_S3RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERSET_S3RETENTION_Pos ) /*!< Bit mask of S3RETENTION field. */
#define VMC_RAM_POWERSET_S3RETENTION_On     ( 1UL )                                       /*!< On */

/* Bit 18 : Keep retention on RAM section S2 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERSET_S2RETENTION_Pos    ( 18UL )                                      /*!< Position of S2RETENTION field. */
#define VMC_RAM_POWERSET_S2RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERSET_S2RETENTION_Pos ) /*!< Bit mask of S2RETENTION field. */
#define VMC_RAM_POWERSET_S2RETENTION_On     ( 1UL )                                       /*!< On */

/* Bit 17 : Keep retention on RAM section S1 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERSET_S1RETENTION_Pos    ( 17UL )                                      /*!< Position of S1RETENTION field. */
#define VMC_RAM_POWERSET_S1RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERSET_S1RETENTION_Pos ) /*!< Bit mask of S1RETENTION field. */
#define VMC_RAM_POWERSET_S1RETENTION_On     ( 1UL )                                       /*!< On */

/* Bit 16 : Keep retention on RAM section S0 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERSET_S0RETENTION_Pos    ( 16UL )                                      /*!< Position of S0RETENTION field. */
#define VMC_RAM_POWERSET_S0RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERSET_S0RETENTION_Pos ) /*!< Bit mask of S0RETENTION field. */
#define VMC_RAM_POWERSET_S0RETENTION_On     ( 1UL )                                       /*!< On */

/* Bit 3 : Keep RAM section S3 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S3POWER_Pos        ( 3UL )                                   /*!< Position of S3POWER field. */
#define VMC_RAM_POWERSET_S3POWER_Msk        ( 0x1UL << VMC_RAM_POWERSET_S3POWER_Pos ) /*!< Bit mask of S3POWER field. */
#define VMC_RAM_POWERSET_S3POWER_On         ( 1UL )                                   /*!< On */

/* Bit 2 : Keep RAM section S2 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S2POWER_Pos        ( 2UL )                                   /*!< Position of S2POWER field. */
#define VMC_RAM_POWERSET_S2POWER_Msk        ( 0x1UL << VMC_RAM_POWERSET_S2POWER_Pos ) /*!< Bit mask of S2POWER field. */
#define VMC_RAM_POWERSET_S2POWER_On         ( 1UL )                                   /*!< On */

/* Bit 1 : Keep RAM section S1 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S1POWER_Pos        ( 1UL )                                   /*!< Position of S1POWER field. */
#define VMC_RAM_POWERSET_S1POWER_Msk        ( 0x1UL << VMC_RAM_POWERSET_S1POWER_Pos ) /*!< Bit mask of S1POWER field. */
#define VMC_RAM_POWERSET_S1POWER_On         ( 1UL )                                   /*!< On */

/* Bit 0 : Keep RAM section S0 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S0POWER_Pos        ( 0UL )                                   /*!< Position of S0POWER field. */
#define VMC_RAM_POWERSET_S0POWER_Msk        ( 0x1UL << VMC_RAM_POWERSET_S0POWER_Pos ) /*!< Bit mask of S0POWER field. */
#define VMC_RAM_POWERSET_S0POWER_On         ( 1UL )                                   /*!< On */

/* Register: VMC_RAM_POWERCLR */
/* Description: Description cluster: RAM[n] power control clear register */

/* Bit 19 : Keep retention on RAM section S3 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S3RETENTION_Pos    ( 19UL )                                      /*!< Position of S3RETENTION field. */
#define VMC_RAM_POWERCLR_S3RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERCLR_S3RETENTION_Pos ) /*!< Bit mask of S3RETENTION field. */
#define VMC_RAM_POWERCLR_S3RETENTION_Off    ( 1UL )                                       /*!< Off */

/* Bit 18 : Keep retention on RAM section S2 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S2RETENTION_Pos    ( 18UL )                                      /*!< Position of S2RETENTION field. */
#define VMC_RAM_POWERCLR_S2RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERCLR_S2RETENTION_Pos ) /*!< Bit mask of S2RETENTION field. */
#define VMC_RAM_POWERCLR_S2RETENTION_Off    ( 1UL )                                       /*!< Off */

/* Bit 17 : Keep retention on RAM section S1 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S1RETENTION_Pos    ( 17UL )                                      /*!< Position of S1RETENTION field. */
#define VMC_RAM_POWERCLR_S1RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERCLR_S1RETENTION_Pos ) /*!< Bit mask of S1RETENTION field. */
#define VMC_RAM_POWERCLR_S1RETENTION_Off    ( 1UL )                                       /*!< Off */

/* Bit 16 : Keep retention on RAM section S0 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S0RETENTION_Pos    ( 16UL )                                      /*!< Position of S0RETENTION field. */
#define VMC_RAM_POWERCLR_S0RETENTION_Msk    ( 0x1UL << VMC_RAM_POWERCLR_S0RETENTION_Pos ) /*!< Bit mask of S0RETENTION field. */
#define VMC_RAM_POWERCLR_S0RETENTION_Off    ( 1UL )                                       /*!< Off */

/* Bit 3 : Keep RAM section S3 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S3POWER_Pos        ( 3UL )                                   /*!< Position of S3POWER field. */
#define VMC_RAM_POWERCLR_S3POWER_Msk        ( 0x1UL << VMC_RAM_POWERCLR_S3POWER_Pos ) /*!< Bit mask of S3POWER field. */
#define VMC_RAM_POWERCLR_S3POWER_Off        ( 1UL )                                   /*!< Off */

