FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 2 : Keep RAM section S2 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S2POWER_Pos        ( 2UL )                                   /*!< Position of S2POWER field. */
#define VMC_RAM_POWERCLR_S2POWER_Msk        ( 0x1UL << VMC_RAM_POWERCLR_S2POWER_Pos ) /*!< Bit mask of S2POWER field. */
#define VMC_RAM_POWERCLR_S2POWER_Off        ( 1UL )                                   /*!< Off */

/* Bit 1 : Keep RAM section S1 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S1POWER_Pos        ( 1UL )                                   /*!< Position of S1POWER field. */
#define VMC_RAM_POWERCLR_S1POWER_Msk        ( 0x1UL << VMC_RAM_POWERCLR_S1POWER_Pos ) /*!< Bit mask of S1POWER field. */
#define VMC_RAM_POWERCLR_S1POWER_Off        ( 1UL )                                   /*!< Off */

/* Bit 0 : Keep RAM section S0 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S0POWER_Pos        ( 0UL )                                   /*!< Position of S0POWER field. */
#define VMC_RAM_POWERCLR_S0POWER_Msk        ( 0x1UL << VMC_RAM_POWERCLR_S0POWER_Pos ) /*!< Bit mask of S0POWER field. */
#define VMC_RAM_POWERCLR_S0POWER_Off        ( 1UL )                                   /*!< Off */


/* Peripheral: VREQCTRL */
/* Description: Voltage request control */

/* Register: VREQCTRL_VREGRADIO_VREQH */
/* Description: Request high voltage on RADIO After requesting high voltage, the user must wait until VREQHREADY is set to Ready */

/* Bit 0 : Request high voltage */
#define VREQCTRL_VREGRADIO_VREQH_VREQH_Pos         ( 0UL )                                         /*!< Position of VREQH field. */
#define VREQCTRL_VREGRADIO_VREQH_VREQH_Msk         ( 0x1UL << VREQCTRL_VREGRADIO_VREQH_VREQH_Pos ) /*!< Bit mask of VREQH field. */
#define VREQCTRL_VREGRADIO_VREQH_VREQH_Disabled    ( 0UL )                                         /*!< Disable */
#define VREQCTRL_VREGRADIO_VREQH_VREQH_Enabled     ( 1UL )                                         /*!< Enable */

/* Register: VREQCTRL_VREGRADIO_VREQHREADY */
/* Description: High voltage on RADIO is ready */

/* Bit 0 : RADIO is ready to operate on high voltage */
#define VREQCTRL_VREGRADIO_VREQHREADY_READY_Pos         ( 0UL )                                              /*!< Position of READY field. */
#define VREQCTRL_VREGRADIO_VREQHREADY_READY_Msk         ( 0x1UL << VREQCTRL_VREGRADIO_VREQHREADY_READY_Pos ) /*!< Bit mask of READY field. */
#define VREQCTRL_VREGRADIO_VREQHREADY_READY_NotReady    ( 0UL )                                              /*!< Not ready */
#define VREQCTRL_VREGRADIO_VREQHREADY_READY_Ready       ( 1UL )                                              /*!< Ready */


/* Peripheral: WDT */
/* Description: Watchdog Timer */

/* Register: WDT_TASKS_START */
/* Description: Start WDT */

/* Bit 0 : Start WDT */
#define WDT_TASKS_START_TASKS_START_Pos        ( 0UL )                                      /*!< Position of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Msk        ( 0x1UL << WDT_TASKS_START_TASKS_START_Pos ) /*!< Bit mask of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Trigger    ( 1UL )                                      /*!< Trigger task */

/* Register: WDT_TASKS_STOP */
/* Description: Stop WDT */

/* Bit 0 : Stop WDT */
#define WDT_TASKS_STOP_TASKS_STOP_Pos        ( 0UL )                                    /*!< Position of TASKS_STOP field. */
#define WDT_TASKS_STOP_TASKS_STOP_Msk        ( 0x1UL << WDT_TASKS_STOP_TASKS_STOP_Pos ) /*!< Bit mask of TASKS_STOP field. */
#define WDT_TASKS_STOP_TASKS_STOP_Trigger    ( 1UL )                                    /*!< Trigger task */

/* Register: WDT_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define WDT_SUBSCRIBE_START_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define WDT_SUBSCRIBE_START_EN_Msk         ( 0x1UL << WDT_SUBSCRIBE_START_EN_Pos ) /*!< Bit mask of EN field. */
#define WDT_SUBSCRIBE_START_EN_Disabled    ( 0UL )                                 /*!< Disable subscription */
#define WDT_SUBSCRIBE_START_EN_Enabled     ( 1UL )                                 /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define WDT_SUBSCRIBE_START_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define WDT_SUBSCRIBE_START_CHIDX_Msk      ( 0xFFUL << WDT_SUBSCRIBE_START_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: WDT_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define WDT_SUBSCRIBE_STOP_EN_Pos         ( 31UL )                               /*!< Position of EN field. */
#define WDT_SUBSCRIBE_STOP_EN_Msk         ( 0x1UL << WDT_SUBSCRIBE_STOP_EN_Pos ) /*!< Bit mask of EN field. */
#define WDT_SUBSCRIBE_STOP_EN_Disabled    ( 0UL )                                /*!< Disable subscription */
#define WDT_SUBSCRIBE_STOP_EN_Enabled     ( 1UL )                                /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define WDT_SUBSCRIBE_STOP_CHIDX_Pos      ( 0UL )                                    /*!< Position of CHIDX field. */
#define WDT_SUBSCRIBE_STOP_CHIDX_Msk      ( 0xFFUL << WDT_SUBSCRIBE_STOP_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: WDT_EVENTS_TIMEOUT */
/* Description: Watchdog timeout */

/* Bit 0 : Watchdog timeout */
#define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Pos             ( 0UL )                                            /*!< Position of EVENTS_TIMEOUT field. */
#define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Msk             ( 0x1UL << WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Pos ) /*!< Bit mask of EVENTS_TIMEOUT field. */
#define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define WDT_EVENTS_TIMEOUT_EVENTS_TIMEOUT_Generated       ( 1UL )                                            /*!< Event generated */

