FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Register: WDT_EVENTS_STOPPED */
/* Description: Watchdog stopped */

/* Bit 0 : Watchdog stopped */
#define WDT_EVENTS_STOPPED_EVENTS_STOPPED_Pos             ( 0UL )                                            /*!< Position of EVENTS_STOPPED field. */
#define WDT_EVENTS_STOPPED_EVENTS_STOPPED_Msk             ( 0x1UL << WDT_EVENTS_STOPPED_EVENTS_STOPPED_Pos ) /*!< Bit mask of EVENTS_STOPPED field. */
#define WDT_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated    ( 0UL )                                            /*!< Event not generated */
#define WDT_EVENTS_STOPPED_EVENTS_STOPPED_Generated       ( 1UL )                                            /*!< Event generated */

/* Register: WDT_PUBLISH_TIMEOUT */
/* Description: Publish configuration for event TIMEOUT */

/* Bit 31 :   */
#define WDT_PUBLISH_TIMEOUT_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define WDT_PUBLISH_TIMEOUT_EN_Msk         ( 0x1UL << WDT_PUBLISH_TIMEOUT_EN_Pos ) /*!< Bit mask of EN field. */
#define WDT_PUBLISH_TIMEOUT_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define WDT_PUBLISH_TIMEOUT_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event TIMEOUT will publish to. */
#define WDT_PUBLISH_TIMEOUT_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define WDT_PUBLISH_TIMEOUT_CHIDX_Msk      ( 0xFFUL << WDT_PUBLISH_TIMEOUT_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: WDT_PUBLISH_STOPPED */
/* Description: Publish configuration for event STOPPED */

/* Bit 31 :   */
#define WDT_PUBLISH_STOPPED_EN_Pos         ( 31UL )                                /*!< Position of EN field. */
#define WDT_PUBLISH_STOPPED_EN_Msk         ( 0x1UL << WDT_PUBLISH_STOPPED_EN_Pos ) /*!< Bit mask of EN field. */
#define WDT_PUBLISH_STOPPED_EN_Disabled    ( 0UL )                                 /*!< Disable publishing */
#define WDT_PUBLISH_STOPPED_EN_Enabled     ( 1UL )                                 /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event STOPPED will publish to. */
#define WDT_PUBLISH_STOPPED_CHIDX_Pos      ( 0UL )                                     /*!< Position of CHIDX field. */
#define WDT_PUBLISH_STOPPED_CHIDX_Msk      ( 0xFFUL << WDT_PUBLISH_STOPPED_CHIDX_Pos ) /*!< Bit mask of CHIDX field. */

/* Register: WDT_INTENSET */
/* Description: Enable interrupt */

/* Bit 1 : Write '1' to enable interrupt for event STOPPED */
#define WDT_INTENSET_STOPPED_Pos         ( 1UL )                               /*!< Position of STOPPED field. */
#define WDT_INTENSET_STOPPED_Msk         ( 0x1UL << WDT_INTENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define WDT_INTENSET_STOPPED_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_INTENSET_STOPPED_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_INTENSET_STOPPED_Set         ( 1UL )                               /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event TIMEOUT */
#define WDT_INTENSET_TIMEOUT_Pos         ( 0UL )                               /*!< Position of TIMEOUT field. */
#define WDT_INTENSET_TIMEOUT_Msk         ( 0x1UL << WDT_INTENSET_TIMEOUT_Pos ) /*!< Bit mask of TIMEOUT field. */
#define WDT_INTENSET_TIMEOUT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_INTENSET_TIMEOUT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_INTENSET_TIMEOUT_Set         ( 1UL )                               /*!< Enable */

/* Register: WDT_INTENCLR */
/* Description: Disable interrupt */

/* Bit 1 : Write '1' to disable interrupt for event STOPPED */
#define WDT_INTENCLR_STOPPED_Pos         ( 1UL )                               /*!< Position of STOPPED field. */
#define WDT_INTENCLR_STOPPED_Msk         ( 0x1UL << WDT_INTENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define WDT_INTENCLR_STOPPED_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_INTENCLR_STOPPED_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_INTENCLR_STOPPED_Clear       ( 1UL )                               /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event TIMEOUT */
#define WDT_INTENCLR_TIMEOUT_Pos         ( 0UL )                               /*!< Position of TIMEOUT field. */
#define WDT_INTENCLR_TIMEOUT_Msk         ( 0x1UL << WDT_INTENCLR_TIMEOUT_Pos ) /*!< Bit mask of TIMEOUT field. */
#define WDT_INTENCLR_TIMEOUT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_INTENCLR_TIMEOUT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_INTENCLR_TIMEOUT_Clear       ( 1UL )                               /*!< Disable */

/* Register: WDT_NMIENSET */
/* Description: Enable interrupt */

/* Bit 1 : Write '1' to enable interrupt for event STOPPED */
#define WDT_NMIENSET_STOPPED_Pos         ( 1UL )                               /*!< Position of STOPPED field. */
#define WDT_NMIENSET_STOPPED_Msk         ( 0x1UL << WDT_NMIENSET_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define WDT_NMIENSET_STOPPED_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_NMIENSET_STOPPED_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_NMIENSET_STOPPED_Set         ( 1UL )                               /*!< Enable */

/* Bit 0 : Write '1' to enable interrupt for event TIMEOUT */
#define WDT_NMIENSET_TIMEOUT_Pos         ( 0UL )                               /*!< Position of TIMEOUT field. */
#define WDT_NMIENSET_TIMEOUT_Msk         ( 0x1UL << WDT_NMIENSET_TIMEOUT_Pos ) /*!< Bit mask of TIMEOUT field. */
#define WDT_NMIENSET_TIMEOUT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_NMIENSET_TIMEOUT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_NMIENSET_TIMEOUT_Set         ( 1UL )                               /*!< Enable */

/* Register: WDT_NMIENCLR */
/* Description: Disable interrupt */

