FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M33F_Nordic_NRF9160_SES/Nordic_Code/nRF/Device/Include/nrf5340_network_bitfields.h
/* Bit 1 : Write '1' to disable interrupt for event STOPPED */
#define WDT_NMIENCLR_STOPPED_Pos         ( 1UL )                               /*!< Position of STOPPED field. */
#define WDT_NMIENCLR_STOPPED_Msk         ( 0x1UL << WDT_NMIENCLR_STOPPED_Pos ) /*!< Bit mask of STOPPED field. */
#define WDT_NMIENCLR_STOPPED_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_NMIENCLR_STOPPED_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_NMIENCLR_STOPPED_Clear       ( 1UL )                               /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event TIMEOUT */
#define WDT_NMIENCLR_TIMEOUT_Pos         ( 0UL )                               /*!< Position of TIMEOUT field. */
#define WDT_NMIENCLR_TIMEOUT_Msk         ( 0x1UL << WDT_NMIENCLR_TIMEOUT_Pos ) /*!< Bit mask of TIMEOUT field. */
#define WDT_NMIENCLR_TIMEOUT_Disabled    ( 0UL )                               /*!< Read: Disabled */
#define WDT_NMIENCLR_TIMEOUT_Enabled     ( 1UL )                               /*!< Read: Enabled */
#define WDT_NMIENCLR_TIMEOUT_Clear       ( 1UL )                               /*!< Disable */

/* Register: WDT_RUNSTATUS */
/* Description: Run status */

/* Bit 0 : Indicates whether or not WDT is running */
#define WDT_RUNSTATUS_RUNSTATUSWDT_Pos           ( 0UL )                                     /*!< Position of RUNSTATUSWDT field. */
#define WDT_RUNSTATUS_RUNSTATUSWDT_Msk           ( 0x1UL << WDT_RUNSTATUS_RUNSTATUSWDT_Pos ) /*!< Bit mask of RUNSTATUSWDT field. */
#define WDT_RUNSTATUS_RUNSTATUSWDT_NotRunning    ( 0UL )                                     /*!< Watchdog is not running */
#define WDT_RUNSTATUS_RUNSTATUSWDT_Running       ( 1UL )                                     /*!< Watchdog is running */

/* Register: WDT_REQSTATUS */
/* Description: Request status */

/* Bit 7 : Request status for RR[7] register */
#define WDT_REQSTATUS_RR7_Pos                      ( 7UL )                            /*!< Position of RR7 field. */
#define WDT_REQSTATUS_RR7_Msk                      ( 0x1UL << WDT_REQSTATUS_RR7_Pos ) /*!< Bit mask of RR7 field. */
#define WDT_REQSTATUS_RR7_DisabledOrRequested      ( 0UL )                            /*!< RR[7] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR7_EnabledAndUnrequested    ( 1UL )                            /*!< RR[7] register is enabled, and are not yet requesting reload */

/* Bit 6 : Request status for RR[6] register */
#define WDT_REQSTATUS_RR6_Pos                      ( 6UL )                            /*!< Position of RR6 field. */
#define WDT_REQSTATUS_RR6_Msk                      ( 0x1UL << WDT_REQSTATUS_RR6_Pos ) /*!< Bit mask of RR6 field. */
#define WDT_REQSTATUS_RR6_DisabledOrRequested      ( 0UL )                            /*!< RR[6] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR6_EnabledAndUnrequested    ( 1UL )                            /*!< RR[6] register is enabled, and are not yet requesting reload */

/* Bit 5 : Request status for RR[5] register */
#define WDT_REQSTATUS_RR5_Pos                      ( 5UL )                            /*!< Position of RR5 field. */
#define WDT_REQSTATUS_RR5_Msk                      ( 0x1UL << WDT_REQSTATUS_RR5_Pos ) /*!< Bit mask of RR5 field. */
#define WDT_REQSTATUS_RR5_DisabledOrRequested      ( 0UL )                            /*!< RR[5] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR5_EnabledAndUnrequested    ( 1UL )                            /*!< RR[5] register is enabled, and are not yet requesting reload */

/* Bit 4 : Request status for RR[4] register */
#define WDT_REQSTATUS_RR4_Pos                      ( 4UL )                            /*!< Position of RR4 field. */
#define WDT_REQSTATUS_RR4_Msk                      ( 0x1UL << WDT_REQSTATUS_RR4_Pos ) /*!< Bit mask of RR4 field. */
#define WDT_REQSTATUS_RR4_DisabledOrRequested      ( 0UL )                            /*!< RR[4] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR4_EnabledAndUnrequested    ( 1UL )                            /*!< RR[4] register is enabled, and are not yet requesting reload */

/* Bit 3 : Request status for RR[3] register */
#define WDT_REQSTATUS_RR3_Pos                      ( 3UL )                            /*!< Position of RR3 field. */
#define WDT_REQSTATUS_RR3_Msk                      ( 0x1UL << WDT_REQSTATUS_RR3_Pos ) /*!< Bit mask of RR3 field. */
#define WDT_REQSTATUS_RR3_DisabledOrRequested      ( 0UL )                            /*!< RR[3] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR3_EnabledAndUnrequested    ( 1UL )                            /*!< RR[3] register is enabled, and are not yet requesting reload */

/* Bit 2 : Request status for RR[2] register */
#define WDT_REQSTATUS_RR2_Pos                      ( 2UL )                            /*!< Position of RR2 field. */
#define WDT_REQSTATUS_RR2_Msk                      ( 0x1UL << WDT_REQSTATUS_RR2_Pos ) /*!< Bit mask of RR2 field. */
#define WDT_REQSTATUS_RR2_DisabledOrRequested      ( 0UL )                            /*!< RR[2] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR2_EnabledAndUnrequested    ( 1UL )                            /*!< RR[2] register is enabled, and are not yet requesting reload */

/* Bit 1 : Request status for RR[1] register */
#define WDT_REQSTATUS_RR1_Pos                      ( 1UL )                            /*!< Position of RR1 field. */
#define WDT_REQSTATUS_RR1_Msk                      ( 0x1UL << WDT_REQSTATUS_RR1_Pos ) /*!< Bit mask of RR1 field. */
#define WDT_REQSTATUS_RR1_DisabledOrRequested      ( 0UL )                            /*!< RR[1] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR1_EnabledAndUnrequested    ( 1UL )                            /*!< RR[1] register is enabled, and are not yet requesting reload */

/* Bit 0 : Request status for RR[0] register */
#define WDT_REQSTATUS_RR0_Pos                      ( 0UL )                            /*!< Position of RR0 field. */
#define WDT_REQSTATUS_RR0_Msk                      ( 0x1UL << WDT_REQSTATUS_RR0_Pos ) /*!< Bit mask of RR0 field. */
#define WDT_REQSTATUS_RR0_DisabledOrRequested      ( 0UL )                            /*!< RR[0] register is not enabled, or are already requesting reload */
#define WDT_REQSTATUS_RR0_EnabledAndUnrequested    ( 1UL )                            /*!< RR[0] register is enabled, and are not yet requesting reload */

/* Register: WDT_CRV */
/* Description: Counter reload value */

/* Bits 31..0 : Counter reload value in number of cycles of the 32.768 kHz clock */
#define WDT_CRV_CRV_Pos    ( 0UL )                             /*!< Position of CRV field. */
#define WDT_CRV_CRV_Msk    ( 0xFFFFFFFFUL << WDT_CRV_CRV_Pos ) /*!< Bit mask of CRV field. */

/* Register: WDT_RREN */
/* Description: Enable register for reload request registers */

/* Bit 7 : Enable or disable RR[7] register */
#define WDT_RREN_RR7_Pos         ( 7UL )                       /*!< Position of RR7 field. */
#define WDT_RREN_RR7_Msk         ( 0x1UL << WDT_RREN_RR7_Pos ) /*!< Bit mask of RR7 field. */
#define WDT_RREN_RR7_Disabled    ( 0UL )                       /*!< Disable RR[7] register */
#define WDT_RREN_RR7_Enabled     ( 1UL )                       /*!< Enable RR[7] register */

/* Bit 6 : Enable or disable RR[6] register */
#define WDT_RREN_RR6_Pos         ( 6UL )                       /*!< Position of RR6 field. */
#define WDT_RREN_RR6_Msk         ( 0x1UL << WDT_RREN_RR6_Pos ) /*!< Bit mask of RR6 field. */
#define WDT_RREN_RR6_Disabled    ( 0UL )                       /*!< Disable RR[6] register */
#define WDT_RREN_RR6_Enabled     ( 1UL )                       /*!< Enable RR[6] register */

/* Bit 5 : Enable or disable RR[5] register */
#define WDT_RREN_RR5_Pos         ( 5UL )                       /*!< Position of RR5 field. */
#define WDT_RREN_RR5_Msk         ( 0x1UL << WDT_RREN_RR5_Pos ) /*!< Bit mask of RR5 field. */
#define WDT_RREN_RR5_Disabled    ( 0UL )                       /*!< Disable RR[5] register */
#define WDT_RREN_RR5_Enabled     ( 1UL )                       /*!< Enable RR[5] register */

/* Bit 4 : Enable or disable RR[4] register */
#define WDT_RREN_RR4_Pos         ( 4UL )                       /*!< Position of RR4 field. */
#define WDT_RREN_RR4_Msk         ( 0x1UL << WDT_RREN_RR4_Pos ) /*!< Bit mask of RR4 field. */
#define WDT_RREN_RR4_Disabled    ( 0UL )                       /*!< Disable RR[4] register */
#define WDT_RREN_RR4_Enabled     ( 1UL )                       /*!< Enable RR[4] register */

/* Bit 3 : Enable or disable RR[3] register */
#define WDT_RREN_RR3_Pos         ( 3UL )                       /*!< Position of RR3 field. */
#define WDT_RREN_RR3_Msk         ( 0x1UL << WDT_RREN_RR3_Pos ) /*!< Bit mask of RR3 field. */
#define WDT_RREN_RR3_Disabled    ( 0UL )                       /*!< Disable RR[3] register */
#define WDT_RREN_RR3_Enabled     ( 1UL )                       /*!< Enable RR[3] register */

